Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Return a status of 0 or 1 depending on the evaluation of the conditional expression @var{expression}. Expressions are composed of the primaries described below in @ref{Bash Conditional Expressions}. Word splitting and filename expansion are not performed on the words between the @code{[[} and @code{]]}; tilde expansion, parameter and variable expansion, arithmetic expansion, command substitution, process substitution, and quote removal are performed. Conditional operators such as @samp{-f} must be unquoted to be recognized as primaries.
es: Devuelve un estado de 0 o 1 dependiendo de la evaluación de la expresión condicional @var{expresión}. Las expresiones están compuestas de los elementos primarios descritos más adelante en @ref{Expresiones Condicionales de Bash}. La división de palabras y la expansión de nombre de archivo no se realizan en las palabras entre el @code{[[} y el @code{]]}; son realizadas la expansión de virgulilla, la expansión de parámetro y de variable, la expansión aritmética, la sustitución de instrucciones, la sustitución de proceso y la eliminación de entrecomillado. Los operadores condicionales como @samp{-f} no deben estar entrecomillados para ser reconocidos como opciones primarias.

source: When used with @code{[[}, the @samp{<} and @samp{>} operators sort lexicographically using the current locale.
es: Cuando se usa con @code{[[}, los operadores @samp{<} y @samp{>} ordenan lexicográficamente usando la configuración regional actual.

source: When the @samp{==} and @samp{!=} operators are used, the string to the right of the operator is considered a pattern and matched according to the rules described below in @ref{Pattern Matching}, as if the @code{extglob} shell option were enabled. The @samp{=} operator is identical to @samp{==}. If the @code{nocasematch} shell option (see the description of @code{shopt} in @ref{The Shopt Builtin}) is enabled, the match is performed without regard to the case of alphabetic characters. The return value is 0 if the string matches (@samp{==}) or does not match (@samp{!=}) the pattern, and 1 otherwise. Any part of the pattern may be quoted to force the quoted portion to be matched as a string.
es: Cuando se usan los operadores @samp{==} y @samp{!=}, la cadena a la derecha del operador es considerada un patrón y es correspondida según las reglas descritas a continuación en @ref{Coincidencia de Patrones}, como si la opción del intérprete @code{extglob} estuviera habilitada. El operador @samp{=} es idéntico a @samp{==}. Si la opción del intérprete @code{nocasematch} (vea la descripción de @code{shopt} en @ref{La Instrucción Integrada Shopt}) está habilitada, la correspondencia se realiza sin importar las mayúsculas y minúsculas de los caracteres alfabéticos. El valor de retorno es 0 si la cadena coincide (@samp{==}) o no coincide (@samp{!=}) con el patrón, y 1 en caso contrario. Cualquier parte del patrón puede ser entrecomillada para forzar la porción entrecomillada a que sea coincidida con una cadena.

source: An additional binary operator, @samp{=~}, is available, with the same precedence as @samp{==} and @samp{!=}. When it is used, the string to the right of the operator is considered a @sc{POSIX} extended regular expression and matched accordingly (as in @i{regex}3)). The return value is 0 if the string matches the pattern, and 1 otherwise. If the regular expression is syntactically incorrect, the conditional expression's return value is 2. If the @code{nocasematch} shell option (see the description of @code{shopt} in @ref{The Shopt Builtin}) is enabled, the match is performed without regard to the case of alphabetic characters. Any part of the pattern may be quoted to force the quoted portion to be matched as a string. Bracket expressions in regular expressions must be treated carefully, since normal quoting characters lose their meanings between brackets. If the pattern is stored in a shell variable, quoting the variable expansion forces the entire pattern to be matched as a string. Substrings matched by parenthesized subexpressions within the regular expression are saved in the array variable @code{BASH_REMATCH}. The element of @code{BASH_REMATCH} with index 0 is the portion of the string matching the entire regular expression. The element of @code{BASH_REMATCH} with index @var{n} is the portion of the string matching the @var{n}th parenthesized subexpression.
es: Un operador binario adicional, @samp{=~}, está disponible, con la misma precedencia que @samp{==} y @samp{!=}. Cuando se usa, la cadena a la derecha del operador es considerada una expresión regular extendida @sc{POSIX} y coincide debidamente (como en @i{regex}3)). El valor de retorno es 0 si la cadena coincide con el patrón, y 1 en caso contrario. Si la expresión regular es sintácticamente incorrecta, el valor de retorno de la expresión condicional es 2. Si está habilitada la opción del intérprete @code{nocasematch} (vea la descripción de @code{shopt} en @ref{La Instrucción Integrada Shopt}), la coincidencia se realiza sin consideración de mayúsculas y minúsculas de los caracteres alfabéticos. Cualquier parte del patrón puede ser entrecomillada para obligar a que la porción entrecomillada sea coincidida como cadena. Las expresiones de llaves en expresiones regulares deben ser tratadas cuidadosamente, pues los caracteres de entrecomillado normales pierden sus significados entre llaves. Si el patrón se guardaen una variable del intérprete, entrecomillar la expansión de variable fuerza el patrón entero a que coincida como cadena. Las subcadenas coincididas por subexpresiones entre paréntesis dentro de la expresión regular son guardadas en la variable de vector @code{BASH_REMATCH}. El elemento de @code{BASH_REMATCH} con índice 0 es la porción de la cadena que coincide con la expresión regular completa. El elemento de @code{BASH_REMATCH} con índice @var{n} es la porción de la cadena que coincide con la subexpresión entre paréntesis número @var{n}.

source: For example, the following will match a line (stored in the shell variable @var{line}) if there is a sequence of characters in the value consisting of any number, including zero, of space characters, zero or one instances of @samp{a}, then a @samp{b}:
es: Por ejemplo, lo siguiente coincidirá con una línea (guardada en la variable del intérprete @var{linea}) si hay una secuencia de caracteres en el valor que conste de cualquier número, incluido cero, de caracteres de espacio, cero o más instancias de @samp{a}, después una @samp{b}:

source: [[ $line =~ [[:space:]]*?(a)b ]]
es: [[ $linea =~ [[:es:]]*?(a)b ]]

source: That means values like @samp{aab} and @samp{ aaaaaab} will match, as will a line containing a @samp{b} anywhere in its value.
es: Eso quiere decir que valores como @samp{aab} y @samp{ aaaaaab} coincidirán, como también lo hará una línea que contenga una @samp{b} en cualquier lugar en su valor.

source: Storing the regular expression in a shell variable is often a useful way to avoid problems with quoting characters that are special to the shell. It is sometimes difficult to specify a regular expression literally without using quotes, or to keep track of the quoting used by regular expressions while paying attention to the shell's quote removal. Using a shell variable to store the pattern decreases these problems. For example, the following is equivalent to the above:
es: Guardar la expresión regular en una variable del intérprete es habitualmente una forma útil de evitar problemas con entrecomillar caracteres que son especiales para el intérprete. A veces es difícil especificar una expresión regular literalmente sin usar comillas, o llevar un seguimiento del entrecomillado usado por las expresiones regulares mientras se presta atención a la eliminación de comillas del intérprete. Usar una variable del intérprete disminuye estos problemas. Por ejemplo, lo siguiente es equivalente a lo anterior:

source: pattern='[[:space:]]*?(a)b' [[ $line =~ $pattern ]]
es: patron='[[:space:]]*?(a)b' [[ $linea =~ $patron ]]

source: If you want to match a character that's special to the regular expression grammar, it has to be quoted to remove its special meaning. This means that in the pattern @samp{xxx.txt}, the @samp{.} matches any character in the string (its usual regular expression meaning), but in the pattern @samp{"xxx.txt"} it can only match a literal @samp{.}. Shell programmers should take special care with backslashes, since backslashes are used both by the shell and regular expressions to remove the special meaning from the following character. The following two sets of commands are @emph{not} equivalent:
es: Si quieres hacer coincidir un carácter que es especial para la gramática de expresiones regulares, tiene que ser entrecomillado para eliminar su significado especial. Esto significa que en el patrón @samp{xxx.txt}, el @samp{.} corresponde a cualquier carácter en la cadena (su significado usual de expresión regular), pero en el patrón @samp{"xxx.txt"} puede corresponder solo a un @samp{.} literal. Los programadores del intérprete deberían tener un especial cuidado con las barras invertidas, puesto que las barras invertidas son usadas tanto por el intérprete como por las expresiones regulares para eliminar el significado especial del siguiente carácter. Los siguientes dos conjuntos de instrucciones @emph{no} son equivalentes:

source: pattern='\.'
es: patron='\.'

source: [[ . =~ $pattern ]] [[ . =~ \. ]]
es: [[ . =~ $patron ]] [[ . =~ \. ]]

source: [[ . =~ "$pattern" ]] [[ . =~ '\.' ]]
es: [[ . =~ "$patron" ]] [[ . =~ '\.' ]]

source: The first two matches will succeed, but the second two will not, because in the second two the backslash will be part of the pattern to be matched. In the first two examples, the backslash removes the special meaning from @samp{.}, so the literal @samp{.} matches. If the string in the first examples were anything other than @samp{.}, say @samp{a}, the pattern would not match, because the quoted @samp{.} in the pattern loses its special meaning of matching any single character.
es: Las primeras dos coincidencias tendrán éxito, pero las segundas dos no, porque en las segundas las barras invertidas serán parte del patrón que será coincidido. En los primeros dos ejemplos, la barra invertida elimina el significado especial de @samp{.}, para que el @samp{.} coincida. Si la cadena en los primeros ejemplos fuera cualquier cosa distinta de @samp{.}, digamos que @samp{a}, el patrón no coincidiría, porque el @samp{.} entrecomillado en el patrón pierde su significado especial de coincidir con cualquier carácter.

source: Expressions may be combined using the following operators, listed in decreasing order of precedence:
es: Las expresiones pueden ser combinadas usando los siguientes operadores, listados en orden decreciente de precedencia:

source: ( @var{expression} )
es: ( @var{expresión} )

source: Returns the value of @var{expression}. This may be used to override the normal precedence of operators.
es: Devuelve el valor de @var{expresión}. Esto puede ser usado para sobrescribir la precedencia normal de operadores.

source: ! @var{expression}
es: ! @var{expresión}

source: True if @var{expression} is false.
es: Verdadero si @var{expresión} es falso.

source: @var{expression1} && @var{expression2}
es: @var{expresión1} && @var{expresión2}

source: True if both @var{expression1} and @var{expression2} are true.
es: Verdadero si tanto @var{expresión1} como @var{expresión} son verdaderas.

source: @var{expression1} || @var{expression2}
es: @var{expresión1} || @var{expresión2}

source: True if either @var{expression1} or @var{expression2} is true.
es: Verdadero si @var{expresión1} o @var{expresión2} es verdadera.

source: The @code{&&} and @code{||} operators do not evaluate @var{expression2} if the value of @var{expression1} is sufficient to determine the return value of the entire conditional expression.
es: Los operadores @code{&&} y @code{||} no evalúan @var{expresión2} si el valor de @var{expresión1} es suficiente para determinar el valor de retorno de la expresión condicional completa.

source: Grouping Commands
es: Agrupación de Instrucciones

source: commands, grouping
es: instrucciones, agrupación

source: Bash provides two ways to group a list of commands to be executed as a unit. When commands are grouped, redirections may be applied to the entire command list. For example, the output of all the commands in the list may be redirected to a single stream.
es: Bash proporciona dos maneras de agrupar una lista de instrucciones para ser ejecutada como una únidad. Cuando las instrucciones son agrupadas, las redirecciones pueden ser agrupadas por la lista de instrucciones completa. Por ejemplo, la salida de todas las instrucciones en la lista puede ser redirigida a un único flujo.

source: ( @var{list} )
es: ( @var{lista} )

source: Placing a list of commands between parentheses causes a subshell environment to be created (@pxref{Command Execution Environment}), and each of the commands in @var{list} to be executed in that subshell. Since the @var{list} is executed in a subshell, variable assignments do not remain in effect after the subshell completes.
es: Ubicar una lista de instrucciones entre paréntesis hace que se cree un entorno de subintérprete (@pxref{Entorno de Ejecución de Instrucciones}), y cada una de las instrucciones en @var{lista} sea ejecutada en ese subintérprete. Dado que la @var{lista} es ejecutada en un subintérprete, las asignaciones de variable no permanecen en vigor después de que el subintérprete finalice.

source: @{ @var{list}; @}
es: @{ @var{lista}; @}

source: Placing a list of commands between curly braces causes the list to be executed in the current shell context. No subshell is created. The semicolon (or newline) following @var{list} is required.
es: Ubicar una lista de instrucciones entre llaves hace que la lista sea ejecutada en el contexto actual del intérprete. No se crea un subintérprete. Se requiere el punto y coma (o nueva línea) después de @var{lista}.

source: In addition to the creation of a subshell, there is a subtle difference between these two constructs due to historical reasons. The braces are @code{reserved words}, so they must be separated from the @var{list} by @code{blank}s or other shell metacharacters. The parentheses are @code{operators}, and are recognized as separate tokens by the shell even if they are not separated from the @var{list} by whitespace.
es: Además de la creación de un subintérprete, hay una sutil diferencia entre estas dos construcciones debido a razones históricas. Las llaves son @code{palabras reservadas}, así que tienen que estar separadas de @var{lista} por @code{blanco}s u otros metacaracteres del intérprete. Los paréntesis son @code{operadores}, y son reconocidos como símbolos separados por el intérprete incluso si no están separados de la @var{lista} por espacios en blanco.

source: The exit status of both of these constructs is the exit status of @var{list}.
es: El estado de salida de estas dos construcciones es el estado de salida de @var{lista}.

source: coprocess
es: coprocesos

source: A @code{coprocess} is a shell command preceded by the @code{coproc} reserved word. A coprocess is executed asynchronously in a subshell, as if the command had been terminated with the @samp{&} control operator, with a two-way pipe established between the executing shell and the coprocess.
es: Un @code{coproceso} es una instrucción del intérprete precedida por la palabra reservada @code{coproc}. Un coproceso es ejecutado asíncronamente en un subintérprete, como si la instrucción se hubiera terminado con el operador de control @samp{&}, con una tubería de dos sentidos establecida entre el intérprete en ejecución y el coproceso.

source: The format for a coprocess is:
es: El formato para un coproceso es:

source: coproc [@var{NAME}] @var{command} [@var{redirections}]
es: coproc [@var{NOMBRE}] @var{instrucción} [@var{redirecciones}]

source: This creates a coprocess named @var{NAME}. If @var{NAME} is not supplied, the default name is @var{COPROC}. @var{NAME} must not be supplied if @var{command} is a simple command (@pxref{Simple Commands}); otherwise, it is interpreted as the first word of the simple command.
es: Esto crea un coproceso llamado @var{NOMBRE}. Si no se proporciona @var{NOMBRE}, el nombre predeterminado es @var{COPROC}. @var{NOMBRE} no tiene que ser proporcionado si @var{instrucción} es una instrucción simple (@pxref{Instrucciones Simples}); de lo contrario, se interpreta como la primera palabra de una instrucción simple.

source: When the coprocess is executed, the shell creates an array variable (@pxref{Arrays}) named @env{NAME} in the context of the executing shell. The standard output of @var{command} is connected via a pipe to a file descriptor in the executing shell, and that file descriptor is assigned to @env{NAME}[0]. The standard input of @var{command} is connected via a pipe to a file descriptor in the executing shell, and that file descriptor is assigned to @env{NAME}[1]. This pipe is established before any redirections specified by the command (@pxref{Redirections}). The file descriptors can be utilized as arguments to shell commands and redirections using standard word expansions. Other than those created to execute command and process substitutions, the file descriptors are not available in subshells.
es: Cuando se ejecuta el coproceso, el intérprete crea una variable de vector (@pxref{Vectores}) llamada @env{NAME} en el contexto del intérprete en ejecución. La salida estándar de @var{instrucción} se conecta a través de una tubería al descriptor de archivo en el intérprete en ejecución, y ese descriptor de archivo es asignado a @env{NAME}[0]. La entrada estándar de @var{instrucción} se conecta a través de una tubería a un descriptor de archivo en el intérprete en ejecución, y ese descriptor de archivo es asignado a @env{NAME}[1]. Esta tubería se establece antes de cualquier redirección especificada por la instrucción (@pxref{Redirecciones}). Los descriptores de archivo pueden ser utilizados como argumentos para instrucciones del intérprete y redirecciones usando expansiones de palabras estándares. Aparte de aquellos creados para ejecutar sustituciones de instrucciones y procesos, los descriptores de archivos no están disponibles en subintérpretes.

source: The process ID of the shell spawned to execute the coprocess is available as the value of the variable @env{NAME}_PID. The @code{wait} builtin command may be used to wait for the coprocess to terminate.
es: El identificador de proceso del intérprete generado para ejecutar el coproceso está disponible como el valor de la variable @var{NAME}_PID. La instrucción integrada @code{wait} puede usarse para esperar a que el coproceso finalice.

source: Since the coprocess is created as an asynchronous command, the @code{coproc} command always returns success. The return status of a coprocess is the exit status of @var{command}.
es: Dado que el coproceso es creado como una instrucción asíncrona, la instrucción @code{coproc} siempre retorna éxito. El estado de retorno de un coproceso es el estado de salida de @var{instrucción}.

source: There are ways to run commands in parallel that are not built into Bash. GNU Parallel is a tool to do just that.
es: Hay varias maneras de ejecutar instrucciones en paralelo que no están integradas en Bash. GNU Parallel es una herramienta para hacer precisamente esto.

source: GNU Parallel, as its name suggests, can be used to build and run commands in parallel. You may run the same command with different arguments, whether they are filenames, usernames, hostnames, or lines read from files. GNU Parallel provides shorthand references to many of the most common operations (input lines, various portions of the input line, different ways to specify the input source, and so on). Parallel can replace @code{xargs} or feed commands from its input sources to several different instances of Bash.
es: GNU Parallel, como su nombre sugiere, puede ser usado para construir y ejecutar instrucciones en paralelo. Puede ejecutar las mismas instrucciones con diferentes argumentos, ya sean nombres de archivo, nombre de usuario, nombres de equipos o líneas leídas de archivos. GNU Parallel proporciona referencias abreviadas a muchas de las operaciones más comunes (líneas de entrada, varias porciones de la línea de entrada, diferentes formas de especificar la fuente de entrada y demás). Parallel puede reemplazar @code{xargs} o surtir de instrucciones de sus fuentes de entrada a varias instancias diferentes de Bash.

source: For a complete description, refer to the GNU Parallel documentation. A few examples should provide a brief introduction to its use.
es: Para una descripción completa, consulte la documentación de GNU Parallel. Unos pocos ejemplos deberían proporcionar una breve introducción a su uso.

source: For example, it is easy to replace @code{xargs} to gzip all html files in the current directory and its subdirectories:
es: Por ejemplo, es fácil reemplazar @code{xargs} para comprimir con gzip todos los archivos HTML en el directorio actual y sus subdirectorios:

source: If you need to protect special characters such as newlines in file names, use find's @option{-print0} option and parallel's @option{-0} option.
es: Si necesita proteger caracteres especiales como nuevas líneas en nombres de archivo, use la opción de find @option{-print0} y la opción de parallel @option{-0}.

source: You can use Parallel to move files from the current directory when the number of files is too large to process with one @code{mv} invocation:
es: Puede usar Parallel para mover archivos desde el directorio actual cuando el número de archivos es muy grande para procesar con una llamada a @code{mv}:

source: ls | parallel mv @{@} destdir
es: ls | parallel mv @{@} dirdest

source: As you can see, the @{@} is replaced with each line read from standard input. While using @code{ls} will work in most instances, it is not sufficient to deal with all filenames. If you need to accommodate special characters in filenames, you can use
es: Como puede ver, la @{@} es reemplazada con cada línea leída de la entrada estándar. Mientras que usar @code{ls} funcionará en la mayoría de los casos, no es suficiente encargarse de todos los nombres de archivo. Si necesita acomodar caracteres especiales en nombres de archivo, puede usar

source: find . -depth 1 \! -name '.*' -print0 | parallel -0 mv @{@} destdir
es: find . -depth 1 \! -name '.*' -print0 | parallel -0 mv @{@} dirdest

source: as alluded to above.
es: como se menciona anteriormente.

source: This will run as many @code{mv} commands as there are files in the current directory. You can emulate a parallel @code{xargs} by adding the @option{-X} option:
es: Esto ejecutará tantas instrucciones @code{mv} como archivos haya en el directorio actual. Puede emular un @code{xargs} paralelo añadiendo la opción @option{-X}:

source: find . -depth 1 \! -name '.*' -print0 | parallel -0 -X mv @{@} destdir
es: find . -depth 1 \! -name '.*' -print0 | parallel -0 -X mv @{@} dirdest

source: GNU Parallel can replace certain common idioms that operate on lines read from a file (in this case, filenames listed one per line):
es: GNU Parallel puede reemplazar ciertas expresiones comunes que operan en líneas leídas de un archivo (en este caso, los nombres de archivo listados uno por línea):

source: while IFS= read -r x; do do-something1 "$x" "config-$x" do-something2 < "$x" done < file | process-output
es: while IFS= read -r x; do haz-algo1 "$x" "config-$x" haz-algo2 < "$x" done < archivo | procesa-salida

source: with a more compact syntax reminiscent of lambdas:
es: con una sintaxis más compleja reminiscente de lambdas:
