Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: If set, the suffixes specified by the @env{FIGNORE} shell variable cause words to be ignored when performing word completion even if the ignored words are the only possible completions. @xref{Bash Variables}, for a description of @env{FIGNORE}. This option is enabled by default.
es: Si está habilitada, los sufijos especificados por la variable del intérprete @env{FIGNORE} hacen que las palabras sean ignoradas al realizar la compleción de palabras incluso si las palabras ignoradas son las únicas compleciones posibles. @xref{Variables de Bash}, para una descripción de @env{FIGNORE}. Esta opción está habilitada por defecto.

source: If set, range expressions used in pattern matching bracket expressions (@pxref{Pattern Matching}) behave as if in the traditional C locale when performing comparisons. That is, the current locale's collating sequence is not taken into account, so @samp{b} will not collate between @samp{A} and @samp{B}, and upper-case and lower-case ASCII characters will collate together.
es: Si está habilitada, las expresiones de rango usadas en las expresiones de llaves de coincidencia de patrones (@pxref{Coincidencia de Patrones}) se comportan como en la configuración regional C tradicional al realizar comparaciones. Es decir, no se tiene en cuenta la actual secuencia de ordenación de configuración regional, por lo que @samp{b} no se ordena entre @samp{A} y @samp{B}, y los caracteres ASCII en minúscula o mayúscula se ordenarán juntos.

source: If set, the pattern @samp{**} used in a filename expansion context will match all files and zero or more directories and subdirectories. If the pattern is followed by a @samp{/}, only directories and subdirectories match.
es: Si está habilitada, el patrón @samp{**} usado en un contexto de expansión de nombre de archivo corresponderá a todos los archivos y cero o más directorios y subdirectorios. Si al patrón lo sigue un @samp{/}, solo coinciden directorios y subdirectorios.

source: If set, shell error messages are written in the standard @sc{gnu} error message format.
es: Si está habilitada, los mensajes de error del intérprete son escritos en el formato de error estándar de @sc{gnu}.

source: If set, the history list is appended to the file named by the value of the @env{HISTFILE} variable when the shell exits, rather than overwriting the file.
es: Si está habilitada, la lista del historial es añadida al nombre de archivo nombrado por el valor de la variable @env{HISTFILE} cuando el intérprete se cierra, en vez de sobreescribir el archivo.

source: If set, and Readline is being used, a user is given the opportunity to re-edit a failed history substitution.
es: Si está habilitada, y se está usando Readline, se le da la oportunidad al usuario de reeditar una sustitución del historial fallida.

source: If set, and Readline is being used, the results of history substitution are not immediately passed to the shell parser. Instead, the resulting line is loaded into the Readline editing buffer, allowing further modification.
es: Si está habilitada, y se está usando Readline, los resultados de la sustitución del historial no son inmediatamente pasados al analizador del intérprete. En su lugar, la línea resultante es cargada en el búfer de edición de Readline, permitiendo una modificación posterior.

source: If set, and Readline is being used, Bash will attempt to perform hostname completion when a word containing a @samp{@@} is being completed (@pxref{Commands For Completion}). This option is enabled by default.
es: Si está habilitada, y se está usando Readline, Bash tratará de realizar una compleción del nombre de anfitrión cuando una palabra que contiene un @samp{@@} esté siendo completada (@pxref{Órdenes para Compleción}). Esta opción está habilitada por defecto.

source: If set, Bash will send @code{SIGHUP} to all jobs when an interactive login shell exits (@pxref{Signals}).
es: Si está establecida, Bash enviará @code{SIGHUP} a todas las tareas cuando se cierre un intérprete de acceso interactivo (@pxref{Señales}).

source: If set, command substitution inherits the value of the @code{errexit} option, instead of unsetting it in the subshell environment. This option is enabled when @sc{posix} mode is enabled.
es: Si está establecida, la sustitución de instrucciones hereda el valor de la opción @code{errexit}, en vez de eliminarlo en el entorno del subintérprete. Esta opción es habilitada cuando se habilita el modo @sc{posix}.

source: Allow a word beginning with @samp{#} to cause that word and all remaining characters on that line to be ignored in an interactive shell. This option is enabled by default.
es: Permite que una palabra que comience por @samp{#} haga que esa palabra y todos los caracteres restantes en esa línea sean ignorados en un intérprete interactivo. Esta opción está habilitada por defecto.

source: If set, and job control is not active, the shell runs the last command of a pipeline not executed in the background in the current shell environment.
es: Si está habilitada, y el control de tareas no está activado, el intérprete ejecuta la última instrucción de una tubería no ejecutada en segundo plano en el entorno actual del intérprete.

source: If enabled, and the @code{cmdhist} option is enabled, multi-line commands are saved to the history with embedded newlines rather than using semicolon separators where possible.
es: Si está habilitada, y la opción @code{cmdhist} está habilitada, las instrucciones de múltiples líneas son guardadas en el historial con nuevas líneas incorporadas en vez de usar separadores de puntos y comas donde sea posible.

source: If set, local variables inherit the value and attributes of a variable of the same name that exists at a previous scope before any new value is assigned. The @var{nameref} attribute is not inherited.
es: Si está habilitada, las variables locales heredan el valor y los atributos de una variable del mismo nombre que exista en un alcance previo antes de que se asigne un nuevo valor. El atributo @var{nameref} no se hereda.

source: If set, calling @code{unset} on local variables in previous function scopes marks them so subsequent lookups find them unset until that function returns. This is identical to the behavior of unsetting local variables at the current function scope.
es: Si está habilitada, llamar a @code{unset} con variables locales en alcances previos de funciones las marca de forma que las siguientes consultas las encuentran sin asignar hasta que la función retorne. Esto es idéntico al comportamiento de eliminar variables locales en el alcance actual de la función.

source: The shell sets this option if it is started as a login shell (@pxref{Invoking Bash}). The value may not be changed.
es: El intérprete establece esta opción si se inicia como un intérprete de acceso (@pxref{Llamando a Bash}). El valor no puede ser cambiado.

source: If set, and a file that Bash is checking for mail has been accessed since the last time it was checked, the message @code{"The mail in @var{mailfile} has been read"} is displayed.
es: Si está habilitada, y un archivo que Bash está comprobando en busca de correo ha sido accedido desde la última hora en que fue comprobado, el mensaje @code{"El correo en @var{mailfile} ha sido leído"} será mostrado.

source: If set, and Readline is being used, Bash will not attempt to search the @env{PATH} for possible completions when completion is attempted on an empty line.
es: Si está habilitada, y se está usando Readline, Bash no tratará de buscar en el @env{PATH} para posibles compleciones cuando la compleción se intenta en una línea vacía.

source: If set, Bash matches filenames in a case-insensitive fashion when performing filename expansion.
es: Si está habilitada, Bash hace coincidir nombres de archivo independientemente de mayúsculas y minúscula al realizar la expansión de nombre de archivo.

source: If set, Bash matches patterns in a case-insensitive fashion when performing matching while executing @code{case} or @code{[[} conditional commands, when performing pattern substitution word expansions, or when filtering possible completions as part of programmable completion.
es: Si está habilitada, Bash hace coincidir patrones independientemente de mayúsculas y minúsculas al realizar coincidencias mientras ejecuta las instrucciones condicionales @code{case} o @code{[[}, cuando realiza expansiones de palabra de sustitución de patrón o cuando filtra posibles compleciones como parte de compleción programable.

source: If set, Bash allows filename patterns which match no files to expand to a null string, rather than themselves.
es: Si está habilitada, Bash permite que patrones de nombre de archivo que no corresponden con ningún archivo se expandan a una cadena vacía, en vez de a sí mismos.

source: If set, the programmable completion facilities (@pxref{Programmable Completion}) are enabled. This option is enabled by default.
es: Si está habilitada, las facilidades programables de compleción (@pxref{Compleción Programable}) son habilitadas. Está opción está habilitada por defecto.

source: If set, and programmable completion is enabled, Bash treats a command name that doesn't have any completions as a possible alias and attempts alias expansion. If it has an alias, Bash attempts programmable completion using the command word resulting from the expanded alias.
es: Si está habilitada y la compleción programable está activada, Bash trata un nombre de instrucción que no tiene ninguna compleción como un posible alias e intenta la expansión de alias. Si tiene un alias, Bash intenta la compleción programable usando la palabra de instrucción resultante del alias expandido.

source: If set, prompt strings undergo parameter expansion, command substitution, arithmetic expansion, and quote removal after being expanded as described below (@pxref{Controlling the Prompt}). This option is enabled by default.
es: Si está habilitada, las cadenas de prompt experimentan la expansión de parámetros, sustitución de instrucciones, expansión aritmética y eliminación de comillas después de ser expandidas como se describe más adelante (@pxref{Controlando el Prompt}). Esta opción está habilitada por defecto.

source: The shell sets this option if it is started in restricted mode (@pxref{The Restricted Shell}). The value may not be changed. This is not reset when the startup files are executed, allowing the startup files to discover whether or not a shell is restricted.
es: El intérprete establece esta opción si es iniciado en modo restringido (@pxref{El Intérprete Restringido}). El valor no puede ser cambiado. Esto no se elimina cuando los archivos de arranque se ejecutan, permitiendo a los archivos de arranque descubrir si el intérprete está restringido o no.

source: If this is set, the @code{shift} builtin prints an error message when the shift count exceeds the number of positional parameters.
es: Si esto está establecido, la instrucción integrada @code{shift} imprime un mensaje de error cuando la cuenta de shift excede el número de parámetros posicionales.

source: If set, the @code{source} builtin uses the value of @env{PATH} to find the directory containing the file supplied as an argument. This option is enabled by default.
es: Si está habilitada, la instrucción integrada @code{source} usa el valor de @env{PATH} para encontrar el directorio que contiene el archivo proporcionado como un argumento. Está opción está habilitada por defecto.

source: If set, the @code{echo} builtin expands backslash-escape sequences by default.
es: Si está habilitada, la instrucción integrada @code{echo} expande por defecto las secuencias de escape de barras invertidas.

source: For historical reasons, the @sc{posix} standard has classified several builtin commands as @emph{special}. When Bash is executing in @sc{posix} mode, the special builtins differ from other builtin commands in three respects:
es: Por razones históricas, el estándar @sc{posix} ha clasificado varias instrucciones integradas como @emph{especiales}. Cuando Bash se ejecuta en modo @sc{posix}, las instrucciones integradas especiales difieren de otras instrucciones integradas en tres aspectos:

source: Special builtins are found before shell functions during command lookup.
es: Las instrucciones integradas especiales son encontradas antes que las funciones del intérprete durante la búsqueda de órdenes.

source: If a special builtin returns an error status, a non-interactive shell exits.
es: Si una instrucción integrada especial devuelve un estado de error, un intérprete no interactivo se cierra.

source: Assignment statements preceding the command stay in effect in the shell environment after the command completes.
es: Las sentencias de asignación que preceden a la instrucción se mantienen en efecto en el entorno del intérprete después de que la instrucción se complete.

source: When Bash is not executing in @sc{posix} mode, these builtins behave no differently than the rest of the Bash builtin commands. The Bash @sc{posix} mode is described in @ref{Bash POSIX Mode}.
es: Cuando Bash no se ejecuta en modo @sc{posix}, estas instrucciones integradas no se comportan de modo diferente al del resto de instrucciones integradas de Bash. El modo @sc{posix} de Bash se describe en @ref{Modo POSIX de Bash}.

source: These are the @sc{posix} special builtins:
es: Estas son las instrucciones integradas especiales @sc{posix}:

source: Bourne Shell Variables
es: Variables del Bourne Shell

source: Variables which Bash uses in the same way as the Bourne Shell.
es: Variables que Bash usa de la misma forma que el Bourne Shell.

source: Bash Variables
es: Variables de Bash

source: List of variables that exist in Bash.
es: Lista de variables que existen en Bash.

source: This chapter describes the shell variables that Bash uses. Bash automatically assigns default values to a number of variables.
es: Este capítulo describe las variables del intérprete que usa Bash. Bash asigna automáticamente valores predeterminados a varias variables.

source: Bash uses certain shell variables in the same way as the Bourne shell. In some cases, Bash assigns a default value to the variable.
es: Bash usa ciertas variables del intérprete de la misma forma que el Bourne shell. En algunos casos, Bash asigna un valor predeterminado a la variable.

source: A colon-separated list of directories used as a search path for the @code{cd} builtin command.
es: Una lista de directorios separada por dos puntos usada como una ruta de búsqueda para la instrucción integrada @code{cd}.

source: The current user's home directory; the default for the @code{cd} builtin command. The value of this variable is also used by tilde expansion (@pxref{Tilde Expansion}).
es: El directorio personal del usuario actual; el predeterminado para la instrucción integrada @code{cd}. El valor de esta variable es usado también por la expansión de virgulilla (@pxref{Expansión de Virgulilla}).

source: A list of characters that separate fields; used when the shell splits words as part of expansion.
es: Una lista de caracteres que separa campos; usada cuando el intérprete divide palabras como partes de expansión.

source: If this parameter is set to a filename or directory name and the @env{MAILPATH} variable is not set, Bash informs the user of the arrival of mail in the specified file or Maildir-format directory.
es: Si este parámetro está establecido a un nombre de archivo o directorio y la variable @env{MAILPATH} no está asignada, Bash informa al usuario de la llegada de correo en el archivo especificado o directorio con formato de Maildir.

source: A colon-separated list of filenames which the shell periodically checks for new mail. Each list entry can specify the message that is printed when new mail arrives in the mail file by separating the filename from the message with a @samp{?}. When used in the text of the message, @code{$_} expands to the name of the current mail file.
es: Una lista separada por dos puntos de nombres de archivos que el intérprete comprueba periódicamente en busca de nuevo correo. Cada entrada de la lista puede especificar el mensaje que es imprimido cuando llega correo nuevo en el archivo de correo separando el nombre de archivo del mensaje con un @samp{?}. Cuando se usa en el texto del mensaje, @code{$_} se expande al nombre del actual archivo de correo.

source: The value of the last option argument processed by the @code{getopts} builtin.
es: El valor del último argumento de opción procesado por la instrucción integrada @code{getopts}.

source: The index of the last option argument processed by the @code{getopts} builtin.
es: El índice del último argumento de opción procesado por la instrucción integrada @code{getopts}.

source: A colon-separated list of directories in which the shell looks for commands. A zero-length (null) directory name in the value of @code{PATH} indicates the current directory. A null directory name may appear as two adjacent colons, or as an initial or trailing colon.
es: Una lista de directorios separada por dos puntos en la que el intérprete busca instrucciones. Un nombre de directorio de longitud cero (nulo) en el valor de @code{PATH} indica el directorio actual. Un nombre de directorio nulo puede aparecer como dos dos puntos adyacentes o como dos puntos al final o al principio.

source: The primary prompt string. The default value is @samp{\s-\v\$ }. @xref{Controlling the Prompt}, for the complete list of escape sequences that are expanded before @env{PS1} is displayed.
es: La cadena de prompt primaria. El valor predeterminado es @samp{\s-\v\$ }. @xref{Controlando el Prompt}, para la lista completa de secuencias de escape que son expandidas antes de que se muestre @env{PS1}.

source: The secondary prompt string. The default value is @samp{> }. @env{PS2} is expanded in the same way as @env{PS1} before being displayed.
es: La cadena de prompt secundaria. El valor predeterminado es @samp{>}. @env{PS2} se expande de la misma forma que @env{PS1} antes de ser mostrado.

source: These variables are set or used by Bash, but other shells do not normally treat them specially.
es: Estas palabras son establecidas o usadas por Bash, pero otros intérpretes no las tratan normalmente de forma especial.

source: A few variables used by Bash are described in different chapters: variables for controlling the job control facilities (@pxref{Job Control Variables}).
es: Unas pocas variables usadas por Bash son descritas en diferentes capítulos: variables para controlar las herramientas de control de tareas (@pxref{Variables de Control de Tareas}).

source: The full pathname used to execute the current instance of Bash.
es: El nombre de ruta completo usado para ejecutar la actual instancia de Bash.

source: A colon-separated list of enabled shell options. Each word in the list is a valid argument for the @option{-s} option to the @code{shopt} builtin command (@pxref{The Shopt Builtin}). The options appearing in @env{BASHOPTS} are those reported as @samp{on} by @samp{shopt}. If this variable is in the environment when Bash starts up, each shell option in the list will be enabled before reading any startup files. This variable is readonly.
es: Una lista separada por dos puntos de opciones del intérprete habilitadas. Cada palabra en la lista es un argumento válido para la opción @option{-s} de la instrucción integrada @code{shopt} (@pxref{La Instrucción Integrada Shopt}). Las opciones que aparecen en @env{BASHOPTS} son aquellas que se muestran como @samp{on} por @samp{shopt}. Si esta variable está en el entorno cuando Bash se inicia, cada opción del intérprete en la lista será activada antes de leer cualquier archivo de inicio. La variable es de solo lectura.

source: Expands to the process ID of the current Bash process. This differs from @code{$$} under certain circumstances, such as subshells that do not require Bash to be re-initialized. Assignments to @env{BASHPID} have no effect. If @code{BASHPID} is unset, it loses its special properties, even if it is subsequently reset.
es: Se expande al ID de proceso del proceso actual de Bash. Esto difiere de @code{$$} bajo algunas circunstancias, como subintérpretes que no necesitan que Bash sea reinicializado. Las asignaciones a @env{BASHPID} no tienen efecto. Si @code{BASHPID} está sin asignar, pierde sus propiedades especiales, incluso si es posteriormente restablecido.

source: An associative array variable whose members correspond to the internal list of aliases as maintained by the @code{alias} builtin. (@pxref{Bourne Shell Builtins}). Elements added to this array appear in the alias list; however, unsetting array elements currently does not cause aliases to be removed from the alias list. If @code{BASH_ALIASES} is unset, it loses its special properties, even if it is subsequently reset.
es: Una variable de vector asociativo cuyos miembros corresponden a la lista interna de aliases como es mantenida por la instrucción integrada @code{alias}. (@pxref{Instrucciones Integradas del Bourne Shell}). Los elementos añadidos a este vector aparecen en la lista de aliases; sin embargo, eliminar elementos del vector actualmente no hace que los aliases sean eliminados de la lista de aliases. Si @code{BASH_ALIASES} no está asignada, pierde sus propiedades especiales, incluso si es restablecida posteriormente.

source: An array variable whose values are the number of parameters in each frame of the current bash execution call stack. The number of parameters to the current subroutine (shell function or script executed with @code{.} or @code{source}) is at the top of the stack. When a subroutine is executed, the number of parameters passed is pushed onto @code{BASH_ARGC}. The shell sets @code{BASH_ARGC} only when in extended debugging mode (see @ref{The Shopt Builtin} for a description of the @code{extdebug} option to the @code{shopt} builtin). Setting @code{extdebug} after the shell has started to execute a script, or referencing this variable when @code{extdebug} is not set, may result in inconsistent values.
es: Una variable de vector cuyos valores son el número de parámetros en cada marco de la actual pila de llamadas de ejecución de bash. El número de parámetros para la subrutina actual (función del intérprete o guion ejecutado con @code{.} o @code{source}) está encima en la pila. Cuando se ejecuta una subrutina, el número de parámetros pasados se mete en @code{BASH_ARGC}. El intérprete asigna @code{BASH_ARGC} solo cuando está en el modo de depuración extendido (consulte @ref{La Instrucción Integrada Shopt} para una descripción de la opción @code{extdebug} para la instrucción integrada @code{shopt}). Asignar @code{extdebug} después de que se haya iniciado el intérprete para ejecutar un guion o referenciar esta variable cuando @code{extdebug} no está activada, puede producir valores inconsistentes.
