Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: An array variable containing all of the parameters in the current bash execution call stack. The final parameter of the last subroutine call is at the top of the stack; the first parameter of the initial call is at the bottom. When a subroutine is executed, the parameters supplied are pushed onto @code{BASH_ARGV}. The shell sets @code{BASH_ARGV} only when in extended debugging mode (see @ref{The Shopt Builtin} for a description of the @code{extdebug} option to the @code{shopt} builtin). Setting @code{extdebug} after the shell has started to execute a script, or referencing this variable when @code{extdebug} is not set, may result in inconsistent values.
es: Una variable de vector que contiene todos los parámetros en la pila de ejecución actual de bash. El parámetro final de la última llamada de subrutina está encima en la pila; el primer parámetro de la llamada inicial está abajo. Cuando se ejecuta una subrutina, los parámetros proporcionados se meten en @code{BASH_ARGV}. El intérprete asigna @code{BASH_ARGV} solo cuando está en el modo de depuración extendido (vea @ref{La Instrucción Integrada Shopt} para una descripción de la opción @code{extdebug} de la instrucción integrada @code{shopt}). Establecer @code{extdebug} después de que el intérprete ha empezado a ejecutar un guion o hacer referencia a esta variable cuando @code{extdebug} no está habilitado, puede producir valores inconsistentes.

source: When referenced, this variable expands to the name of the shell or shell script (identical to @code{$0}; @xref{Special Parameters}, for the description of special parameter 0). Assignment to @code{BASH_ARGV0} causes the value assigned to also be assigned to @code{$0}. If @code{BASH_ARGV0} is unset, it loses its special properties, even if it is subsequently reset.
es: Cuando se hace referencia, esta variable se expande al nombre del intérprete o el guion del intérprete (idéntica a @code{$0}; @xref{Parámetros Especiales}, para una descripción del parámetro especial 0). La asignación a @code{BASH_ARGV0} hace que el valor asignado también sea asignado a @code{$0}. Si @code{BASH_ARGV0} es eliminado, pierde sus propiedades especiales, incluso si es posteriormente restablecido.

source: An associative array variable whose members correspond to the internal hash table of commands as maintained by the @code{hash} builtin (@pxref{Bourne Shell Builtins}). Elements added to this array appear in the hash table; however, unsetting array elements currently does not cause command names to be removed from the hash table. If @code{BASH_CMDS} is unset, it loses its special properties, even if it is subsequently reset.
es: Una variable de vector asociativo cuyos miembros corresponden a la tabla hash interna de instrucciones como mantiene la instrucción integrada @code{hash} (@pxref{Instrucciones Integradas del Bourne Shell}). Los elementos añadidos a este vector aparecen en la tabla hash; sin embargo, eliminar elementos de vector actualmente no hace que los nombres de instrucciones sean eliminados de la tabla hash. Si @code{BASH_CMDS} no está asignada, pierde sus propiedades iniciales, incluso si es posteriormente restablecida.

source: The command currently being executed or about to be executed, unless the shell is executing a command as the result of a trap, in which case it is the command executing at the time of the trap.
es: La instrucción actualmente en ejecución o a punto de ser ejecutada, a no ser que el intérprete esté ejecutando una instrucción como resultado de una trap, en cuyo caso es la instrucción ejecutándose en el momento de la trap.

source: The value is used to set the shell's compatibility level. @xref{The Shopt Builtin}, for a description of the various compatibility levels and their effects. The value may be a decimal number (e.g., 4.2) or an integer (e.g., 42) corresponding to the desired compatibility level. If @code{BASH_COMPAT} is unset or set to the empty string, the compatibility level is set to the default for the current version. If @code{BASH_COMPAT} is set to a value that is not one of the valid compatibility levels, the shell prints an error message and sets the compatibility level to the default for the current version. The valid compatibility levels correspond to the compatibility options accepted by the @code{shopt} builtin described above (for example, @var{compat42} means that 4.2 and 42 are valid values). The current version is also a valid value.
es: Este valor se usa para establecer el nivel de compatibilidad del intérprete. @xref{La Instrucción Integrada Shopt}, para una descripción de los varios niveles de compatibilidad y sus efectos. El valor puede ser un número decimal (p. ej., 4,2) o un entero (p. ej., 42) correspondiente al nivel de compatibilidad deseado. Si @code{BASH_COMPAT} está sin asignar o asignado a la cadena vacía, el nivel de compatibilidad se establece al predeterminado para la versión actual. Si @code{BASH_COMPAT} está establecida a un valor que no es uno de los niveles de compatibilidad válidos, el intérprete imprime un mensaje de error y establece el nivel de compatibilidad al predeterminado para la versión actual. Los niveles de compatibilidad válidos corresponden a las opciones de compatibilidad aceptadas por la instrucción integrada @code{shopt} descritas anteriormente (por ejemplo, @var{compat42} significa que 4.2 y 42 son valores válidos). La versión actual es también un valor válido.

source: If this variable is set when Bash is invoked to execute a shell script, its value is expanded and used as the name of a startup file to read before executing the script. @xref{Bash Startup Files}.
es: Si esta variable está asignada cuando Bash es llamado para ejecutar un guion del intérprete, su valor se expande y se usa como el nombre de un archivo de inicio que leer antes de ejecutar el guion. @xref{Archivos de Inicio de Bash}.

source: The command argument to the @option{-c} invocation option.
es: El argumento de instrucción para la opción de llamada @option{-c}.

source: An array variable whose members are the line numbers in source files where each corresponding member of @var{FUNCNAME} was invoked. @code{$@{BASH_LINENO[$i]@}} is the line number in the source file (@code{$@{BASH_SOURCE[$i+1]@}}) where @code{$@{FUNCNAME[$i]@}} was called (or @code{$@{BASH_LINENO[$i-1]@}} if referenced within another shell function). Use @code{LINENO} to obtain the current line number.
es: Una variable de vector cuyos miembros son los números de línea en archivos fuentes donde se invocó cada miembro correspondiente de @var{FUNCNAME}. @code{$@{BASH_LINENO[$i]@}} es el número de línea en el archivo fuente (@code{$@{BASH_SOURCE[$i+1]@}}) donde @code{$@{FUNCNAME[$i]@}} fue llamado (o @code{$@{BASH_LINENO[$i-1]@}} si se referencia dentro de otra función del intérprete). Use @code{LINENO} para obtener el número de línea actual.

source: A colon-separated list of directories in which the shell looks for dynamically loadable builtins specified by the @code{enable} command.
es: Una lista de directorios separada por dos puntos en la que el intérprete busca instrucciones integradas dinámicamente cargables especificadas por la instrucción @code{enable}.

source: An array variable whose members are assigned by the @samp{=~} binary operator to the @code{[[} conditional command (@pxref{Conditional Constructs}). The element with index 0 is the portion of the string matching the entire regular expression. The element with index @var{n} is the portion of the string matching the @var{n}th parenthesized subexpression. This variable is read-only.
es: Una variable de vector cuyos miembros son asignados por el operador binario @samp{=~} de la instrucción condicional @code{[[} (@pxref{Construcciones Condicionales}). El elemento con índice 0 es la porción de la cadena que coincide la expresión regular entera. El elemento con índice @var{n} es la porción de la cadena que coincide con la subexpresión entre paréntesis número @var{n}. Esta variable es de solo lectura.

source: An array variable whose members are the source filenames where the corresponding shell function names in the @code{FUNCNAME} array variable are defined. The shell function @code{$@{FUNCNAME[$i]@}} is defined in the file @code{$@{BASH_SOURCE[$i]@}} and called from @code{$@{BASH_SOURCE[$i+1]@}}
es: Una variable de vector cuyos miembros son los nombres de archivo fuentes donde están definidos los correspondientes nombres de funciones del intérprete en la variable de vector @code{FUNCNAME}. La función del intérprete @code{$@{FUNCNAME[$i]@}} está definida en el archivo @code{$@{BASH_SOURCE[$i]@}} y es llamada desde @code{$@{BASH_SOURCE[$i+1]@}}

source: Incremented by one within each subshell or subshell environment when the shell begins executing in that environment. The initial value is 0.
es: Incrementada en uno con cada subintérprete o entorno de subintérprete cuando se empieza a ejecutar el intérprete en ese entorno. El valor inicial es 0.

source: A readonly array variable (@pxref{Arrays}) whose members hold version information for this instance of Bash. The values assigned to the array members are as follows:
es: Una variable de vector de solo lectura (@pxref{Vectores}) cuyos miembros guardan información de versión para esta instancia de Bash. Los valores asignados a los miembros del vector son los siguientes:

source: The major version number (the @var{release}).
es: El número de versión mayor (la @var{publicación}).

source: The minor version number (the @var{version}).
es: El número de versión menor (la @var{versión}).

source: The patch level.
es: El nivel de parche.

source: The build version.
es: La versión de construcción.

source: The release status (e.g., @var{beta1}).
es: El estado de publicación (p. ej., @var{beta1}).

source: The value of @env{MACHTYPE}.
es: El valor de @env{MACHTYPE}.

source: The version number of the current instance of Bash.
es: El número de versión de la actual instancia de Bash.

source: If set to an integer corresponding to a valid file descriptor, Bash will write the trace output generated when @samp{set -x} is enabled to that file descriptor. This allows tracing output to be separated from diagnostic and error messages. The file descriptor is closed when @code{BASH_XTRACEFD} is unset or assigned a new value. Unsetting @code{BASH_XTRACEFD} or assigning it the empty string causes the trace output to be sent to the standard error. Note that setting @code{BASH_XTRACEFD} to 2 (the standard error file descriptor) and then unsetting it will result in the standard error being closed.
es: Si está asignado a un entero correspondiente a un descriptor de archivo válido, Bash escribirá el rastreo de salida generado cuando la @samp{set -x} está habilitado para ese descriptor de archivo. Esto permite que el rastreo de salida esté separado de mensajes de diagnóstico y error. El descriptor de archivo se cierra cuando se elimina o se asigna un nuevo valor a @code{BASH_XTRACEFD}. Eliminar @code{BASH_XTRACEFD} o asignarlo a la cadena vacía hace que el rastreo de salida sea asignado al error estándar. Observe que asignar @code{BASH_XTRACEFD} a 2 (el descriptor de archivo del error estándar) y después eliminarlo hará que sea cerrado el error estándar.

source: Set the number of exited child status values for the shell to remember. Bash will not allow this value to be decreased below a @sc{posix}-mandated minimum, and there is a maximum value (currently 8192) that this may not exceed. The minimum value is system-dependent.
es: Establece el número de valores de estados de salida finalizados que el intérprete puede recordar. Bash no permitirá que este valor sea reducido por debajo de un mínimo mandado por @sc{posix}, y hay un valor máximo (actualmente 8192) que no puede ser excedido. El valor mínimo es dependiente del sistema.

source: Used by the @code{select} command to determine the terminal width when printing selection lists. Automatically set if the @code{checkwinsize} option is enabled (@pxref{The Shopt Builtin}), or in an interactive shell upon receipt of a @code{SIGWINCH}.
es: Usada por la instrucción @code{select} para determinar la anchura de la terminal al imprimir listas de selección. Automáticamente asignada si la opción @code{checkwinsize} está activada (@pxref{La Instrucción Integrada Shopt}), o en un intérprete interactivo al recibir una @code{SIGWINCH}.

source: An index into @env{$@{COMP_WORDS@}} of the word containing the current cursor position. This variable is available only in shell functions invoked by the programmable completion facilities (@pxref{Programmable Completion}).
es: Un indice a @env{$@{COMP_WORDS@}} de la palabra que contiene la posición actual del cursor. Esta variable está disponible solo en funciones del intérprete llamadas por las herramientas de compleción programables (@pxref{Compleción Programable}).

source: The current command line. This variable is available only in shell functions and external commands invoked by the programmable completion facilities (@pxref{Programmable Completion}).
es: La línea de orden actual. Esta variable está disponible solo en funciones del intérprete e instrucciones externas llamadas por las herramientas de compleción programables (@pxref{Compleción Programable}).

source: The index of the current cursor position relative to the beginning of the current command. If the current cursor position is at the end of the current command, the value of this variable is equal to @code{$@{#COMP_LINE@}}. This variable is available only in shell functions and external commands invoked by the programmable completion facilities (@pxref{Programmable Completion}).
es: El índice de la posición actual del cursor relativa al comienzo de la instrucción actual. Si la posición actual del cursor está al final de la instrucción actual, el valor de esta variable es igual a @code{$@{#COMP_LINE@}}. Esta variable está disponible solo en funciones del intérprete e instrucciones externas llamadas por las herramientas de compleción programables (@pxref{Compleción Programable}).

source: Set to an integer value corresponding to the type of completion attempted that caused a completion function to be called: @var{TAB}, for normal completion, @samp{?}, for listing completions after successive tabs, @samp{!}, for listing alternatives on partial word completion, @samp{@@}, to list completions if the word is not unmodified, or @samp{%}, for menu completion. This variable is available only in shell functions and external commands invoked by the programmable completion facilities (@pxref{Programmable Completion}).
es: Asignada a un valor entero correspondiente al tipo de compleción intentado que hizo que una función de compleción fuera llamada: @var{TAB}, para compleción normal; @samp{?}, para listar compleciones después de sucesivas tabulaciones, @samp{!}, para listar alternativas a compleción parcial de palabra, @samp{@@}, para listar compleciones si la palabra no se modifica; o @samp{%}, para compleción de menú. Esta variable está disponible solo en funciones del intérprete e instrucciones externas llamadas por las herramientas de compleción programables (@pxref{Compleción Programable}).

source: The key (or final key of a key sequence) used to invoke the current completion function.
es: La tecla (o tecla final de una secuencia de teclas) usada para llamar a la actual función de compleción.

source: The set of characters that the Readline library treats as word separators when performing word completion. If @code{COMP_WORDBREAKS} is unset, it loses its special properties, even if it is subsequently reset.
es: El conjunto de caracteres que la biblioteca Readline trata como separadores de palabra al realizar la compleción de palabra. Si @code{COMP_WORDBREAKS} está sin asignar, pierde sus propiedades especiales, incluso si es restablecida posteriormente.

source: An array variable consisting of the individual words in the current command line. The line is split into words as Readline would split it, using @code{COMP_WORDBREAKS} as described above. This variable is available only in shell functions invoked by the programmable completion facilities (@pxref{Programmable Completion}).
es: Una variable de vector que consta de las palabras individuales en la actual línea de órdenes. La línea se divide en palabras como Readline la dividiría, usando @code{COMP_WORDBREAKS} como se describe anteriormente. Esta variable está disponible solo en funciones del intérprete llamadas por las herramientas de compleción programables (@pxref{Compleción Programable}).

source: An array variable from which Bash reads the possible completions generated by a shell function invoked by the programmable completion facility (@pxref{Programmable Completion}). Each array element contains one possible completion.
es: Una variable de vector de la que Bash lee las posibles compleciones generadas por una función del intérprete llamada por la herramienta de compleción programable (@pxref{Compleción Programable}). Cada elemento del vector contiene una posible compleción.

source: An array variable created to hold the file descriptors for output from and input to an unnamed coprocess (@pxref{Coprocesses}).
es: Una variable de vector creada para alojar los descriptores de archivo para salida de y entrada para un coproceso sin nombre (@pxref{Coprocesos}).

source: An array variable containing the current contents of the directory stack. Directories appear in the stack in the order they are displayed by the @code{dirs} builtin. Assigning to members of this array variable may be used to modify directories already in the stack, but the @code{pushd} and @code{popd} builtins must be used to add and remove directories. Assignment to this variable will not change the current directory. If @env{DIRSTACK} is unset, it loses its special properties, even if it is subsequently reset.
es: Una variable de vector que contiene los contenidos actuales de la pila de directorios. Los directorios aparecen en la pila en el orden en que son mostrados por la instrucción integrada @code{dirs}. Asignar a miembros de esta variable de vector puede usarse para modificar directorios ya en la pila, pero las instrucciones integradas @code{pushd} y @code{popd} deben ser usadas para añadir y eliminar directorios. La asignación a esta variable no cambiará el directorio actual. Si @env{DIRSTACK} está sin asignar, pierde sus propiedades especiales, incluso si es restablecida posteriormente.

source: If Bash finds this variable in the environment when the shell starts with value @samp{t}, it assumes that the shell is running in an Emacs shell buffer and disables line editing.
es: Si Bash encuentra esta variable en el entorno cuando el intérprete se inicia con el valor @samp{t}, asume que el intérprete está corriendo en un búfer de intérprete de Emacs y deshabilita la edición de línea.

source: Similar to @code{BASH_ENV}; used when the shell is invoked in @sc{posix} Mode (@pxref{Bash POSIX Mode}).
es: Similar a @code{BASH_ENV}; usada cuando el intérprete es llamado en Modo @sc{posix} (@pxref{Modo POSIX de Bash}).

source: Each time this parameter is referenced, it expands to the number of seconds since the Unix Epoch as a floating point value with micro-second granularity (see the documentation for the C library function @var{time} for the definition of Epoch). Assignments to @env{EPOCHREALTIME} are ignored. If @env{EPOCHREALTIME} is unset, it loses its special properties, even if it is subsequently reset.
es: Cada vez que se hace referencia a este parámetro se expande al número de segundos desde la Época Unix como un valor de coma flotante con granularidad de microsegundos (consulte la documentación de la función de la librer@'ia C @var{time} para la definición de Época). Las asignaciones a @env{EPOCHREALTIME} son ignoradas. Si @env{EPOCHREALTIME} es eliminada, pierde sus propiedades espciales, incluso si es restablecida posteriormente.

source: Each time this parameter is referenced, it expands to the number of seconds since the Unix Epoch (see the documentation for the C library function @var{time} for the definition of Epoch). Assignments to @env{EPOCHSECONDS} are ignored. If @env{EPOCHSECONDS} is unset, it loses its special properties, even if it is subsequently reset.
es: Cada vez que se hace referencia a este parámetro, se expande al número de segundos desde el Tiempo Unix (consulte la definición de Época en la documentación de la función @var{time} de la librer@'ia C). Las asignaciones a @env{EPOCHSECONDS} son ignoradas. Si @env{EPOCHSECONDS} no está asignada, pierde sus propiedades especiales, incluso si es restablecida posteriormente.

source: The numeric effective user id of the current user. This variable is readonly.
es: El id numérico efectivo de usuario del actual usuario. Esta variable es de solo lectura.

source: A colon-separated list of shell patterns (@pxref{Pattern Matching}) defining the list of filenames to be ignored by command search using @code{PATH}. Files whose full pathnames match one of these patterns are not considered executable files for the purposes of completion and command execution via @code{PATH} lookup. This does not affect the behavior of the @code{[}, @code{test}, and @code{[[} commands. Full pathnames in the command hash table are not subject to @code{EXECIGNORE}. Use this variable to ignore shared library files that have the executable bit set, but are not executable files. The pattern matching honors the setting of the @code{extglob} shell option.
es: Una lista de patrones separada por dos puntos (@pxref{Coincidencia de Patrones}) que define la lista de nombres de archivo que serán ignorados por la búsqueda de instrucciones usando @code{PATH}. Los archivos cuyos nombres de ruta completos coinciden con uno de estos patrones no se consideran archivos ejecutables para los propósitos de compleción y ejecución mediante búsqueda de @var{PATH}. Esto no afecta el comportamiento de las instrucciones @code{[}, @code{test} y @code{[[}. Los nombres de ruta completos en la tabla hash de instrucciones no están sujetos a @code{EXECIGNORE}. Use esta variable para ignorar los archivos de librería compartidos que tiene asignado el bit de ejecución, pero no son archivos ejecutables. La coincidencia de patrones hace honor al ajuste de la opción del intérprete @code{extglob}.

source: The editor used as a default by the @option{-e} option to the @code{fc} builtin command.
es: El editor usado como predeterminado por la opción @option{-e} de la instrucción integrada @code{fc}.

source: A colon-separated list of suffixes to ignore when performing filename completion. A filename whose suffix matches one of the entries in @env{FIGNORE} is excluded from the list of matched filenames. A sample value is @samp{.o:~}
es: Una lista separada de sufijos que ignorar al realizar la compleción de nombre de archivo. Un nombre de archivo cuyo sufijo coincide con una de las entradas en @env{FIGIGNORE} es excluido de la lista de nombres de archivo completados. Un valor de muestra es @samp{.o:~}.
