Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: The value of this variable is used as the prompt for the @code{select} command. If this variable is not set, the @code{select} command prompts with @samp{#? }
es: El valor de esta variable se usa como el prompt para la instrucción @code{select}. Si no está asignada esta variable, la instrucción @code{select} usa el prompt @samp{#? }.

source: The value of this parameter is expanded like @var{PS1} and the expanded value is the prompt printed before the command line is echoed when the @option{-x} option is set (@pxref{The Set Builtin}). The first character of the expanded value is replicated multiple times, as necessary, to indicate multiple levels of indirection. The default is @samp{+ }.
es: El valor de este parámetro se expande como @var{PS1} y el valor expandido es el prompt imprimido antes de que la línea de instrucción sea repetida cuando la opción @option{-x} esté habilitada (@pxref{La Instrucción Integrada Set}). El primer carácter del valor expandido se repete múltiples veces, según sea necesario, para indicar múltiples niveles de indirección. El predeterminado es @samp{+}.

source: The current working directory as set by the @code{cd} builtin.
es: El directorio de trabajo actual según se establece por la instrucción integrada @code{cd}.

source: Each time this parameter is referenced, a random integer between 0 and 32767 is generated. Assigning a value to this variable seeds the random number generator.
es: Cada vez que se referencia a este parámetro, es generado un entero aleatorio entre 0 y 32767. Asignar un valor a esta variable crea la semilla del generador de números aleatorio.

source: The contents of the Readline line buffer, for use with @samp{bind -x} (@pxref{Bash Builtins}).
es: Los contenidos del búfer de línea de Readline, para uso con @samp{bind -x} (@pxref{Instrucciones Integradas de Bash}).

source: The position of the insertion point in the Readline line buffer, for use with @samp{bind -x} (@pxref{Bash Builtins}).
es: La posición del punto de inserción en el búfer de línea de Readline, para uso con @samp{bind -x} (@pxref{Instrucciones Integradas de Bash}).

source: The default variable for the @code{read} builtin.
es: La variable predeterminada para la instrucción integrada @code{read}.

source: This variable expands to the number of seconds since the shell was started. Assignment to this variable resets the count to the value assigned, and the expanded value becomes the value assigned plus the number of seconds since the assignment.
es: Esta variable se expande al número de segundos desde que se inició el intérprete. Asignar a esta variable restablece la cuenta al valor asignado, y el valor expandido se convierte en el valor asignado más el número de segundos desde la asignación.

source: The full pathname to the shell is kept in this environment variable. If it is not set when the shell starts, Bash assigns to it the full pathname of the current user's login shell.
es: El nombre de ruta completo para el intérprete se mantiene en esta variable de entorno. Si no está asignada cuando el intérprete se inicia, Bash la asignará al nombre de ruta completo del actual intérprete de acceso del usuario.

source: A colon-separated list of enabled shell options. Each word in the list is a valid argument for the @option{-o} option to the @code{set} builtin command (@pxref{The Set Builtin}). The options appearing in @env{SHELLOPTS} are those reported as @samp{on} by @samp{set -o}. If this variable is in the environment when Bash starts up, each shell option in the list will be enabled before reading any startup files. This variable is readonly.
es: Una lista de opciones del intérprete habilitadas separada por dos puntos. Cada palabra en la lista es un argumento válido para la opción @option{-o} de la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}). Las opciones que aparecen en @env{SHELLOPTS} son aquellas descritas con @samp{on} por @samp{set -o}. Si esta variable está en el entorno cuando Bash se inicia, cada opción del intérprete en la lista será activada antes de leer los archivos de inicio. Esta variable es de solo lectura.

source: Incremented by one each time a new instance of Bash is started. This is intended to be a count of how deeply your Bash shells are nested.
es: Incrementada en uno cada vez que se inicia una nueva instancia de Bash. Esto está pensado para ser un contador de la profundidad en que sus intérpretes de Bash están anidados.

source: The value of this parameter is used as a format string specifying how the timing information for pipelines prefixed with the @code{time} reserved word should be displayed. The @samp{%} character introduces an escape sequence that is expanded to a time value or other information. The escape sequences and their meanings are as follows; the braces denote optional portions.
es: El valor de este parámetro se usa como una cadena de formato que especifica cómo debería mostrarse la información temporal para tuberías prefijadas con la palabra reservada @code{time}. El carácter @samp{%} introduce una secuencia de escape que se expande a un valor temporal u otra información. Las secuencias de escape y sus significados son los siguientes; las llaves denotan partes opcionales.

source: A literal @samp{%}.
es: Un @samp{%} literal.

source: The elapsed time in seconds.
es: El tiempo transcurrido en segundos.

source: The number of CPU seconds spent in user mode.
es: El número de segundos de UCP pasados en modo usuario.

source: The number of CPU seconds spent in system mode.
es: El número de segundos de UCP pasados en modo sistema.

source: The CPU percentage, computed as (%U + %S) / %R.
es: El porcentaje de UCP, computado como (%U + %S) / %R.

source: The optional @var{p} is a digit specifying the precision, the number of fractional digits after a decimal point. A value of 0 causes no decimal point or fraction to be output. At most three places after the decimal point may be specified; values of @var{p} greater than 3 are changed to 3. If @var{p} is not specified, the value 3 is used.
es: La @var{p} opcional es un dígito que especifica la precisión, el número de dígitos fraccionales después de la coma decimal. Un valor de 0 hace que no se muestre ninguna coma decimal o fracción. Como mucho pueden especificarse tres lugares tras la coma decimal; valores de @var{p} mayores que 3 son cambiados a 3. Si no se especifica @var{p}, se usa el valor 3.

source: The optional @code{l} specifies a longer format, including minutes, of the form @var{MM}m@var{SS}.@var{FF}s. The value of @var{p} determines whether or not the fraction is included.
es: El @code{l} opcional especifica un formato más largo, incluyendo minutos, de la forma @var{MM}m@var{SS}.@var{FF}s. El valor de @var{p} determina si la fracción es incluida o no.

source: If this variable is not set, Bash acts as if it had the value
es: Si esta variable no está asignada, Bash actúa como si tuviera el valor

source: If the value is null, no timing information is displayed. A trailing newline is added when the format string is displayed.
es: Si el valor es nulo, no se muestra información de tiempo. Se añade una nueva línea final cuando se muestra la cadena de formato.

source: If set to a value greater than zero, @code{TMOUT} is treated as the default timeout for the @code{read} builtin (@pxref{Bash Builtins}). The @code{select} command (@pxref{Conditional Constructs}) terminates if input does not arrive after @code{TMOUT} seconds when input is coming from a terminal.
es: Si está asignada a un valor mayor que cero, @code{TMOUT} se trata como el tiempo límite predeterminado para la instrucción integrada @code{read} (@pxref{Instrucciones Integradas de Bash}). La instrucción @code{select} (@pxref{Construcciones Condicionales}) termina si la entrada no llega después de @code{TMOUT} segundos cuando la entrada viene de una terminal.

source: In an interactive shell, the value is interpreted as the number of seconds to wait for a line of input after issuing the primary prompt. Bash terminates after waiting for that number of seconds if a complete line of input does not arrive.
es: En un intérprete interactivo, el valor se interpreta como el número de segundos que esperar a una línea de entrada después de generar el prompt primario. Bash termina después de esperar ese número de segundos si no llega una línea de entrada completa.

source: If set, Bash uses its value as the name of a directory in which Bash creates temporary files for the shell's use.
es: Si está asignada, Bash usa su valor como el nombre de un directorio en el que Bash crea archivos temporales para que use el intérprete.

source: The numeric real user id of the current user. This variable is readonly.
es: El id numérico real de usuario del usuario actual. Esta variable es de solo lectura.

source: This chapter describes features unique to Bash.
es: Este capítulo describe funcionalidades únicas de Bash.

source: Invoking Bash
es: Llamando a Bash

source: Command line options that you can give to Bash.
es: Opciones de línea de órdenes que puede darle a Bash.

source: Bash Startup Files
es: Archivos de Inicio de Bash

source: When and how Bash executes scripts.
es: Cuándo y dónde Bash ejecuta guiones.

source: Interactive Shells
es: Intérpretes Interactivos

source: What an interactive shell is.
es: Qué es un intérprete interactivo.

source: Bash Conditional Expressions
es: Expresiones Condicionales de Bash

source: Primitives used in composing expressions for the @code{test} builtin.
es: Primitivos usados para componer expresiones para la instrucción integrada @code{test}.

source: Shell Arithmetic
es: Aritmética del Intérprete

source: Arithmetic on shell variables.
es: Aritmética en variables del intérprete.

source: Substituting one command for another.
es: Sustituyendo una instrucción con otra.

source: Arrays
es: Vectores

source: Array Variables.
es: Variables de Vectores.

source: The Directory Stack
es: La Pila de Directorios

source: History of visited directories.
es: Historia de directorios visitados.

source: Controlling the Prompt
es: Controlando el Prompt

source: Customizing the various prompt strings.
es: Personalizando las distintas cadenas de prompt.

source: The Restricted Shell
es: El Intérprete Restringido

source: A more controlled mode of shell execution.
es: Un modo más controlado de ejecución del intérprete.

source: Bash POSIX Mode
es: Modo POSIX de Bash

source: Making Bash behave more closely to what the POSIX standard specifies.
es: Hacer que Bash se comporte más cerca de cómo especifica el estándar POSIX.

source: bash [long-opt] [-ir] [-abefhkmnptuvxdBCDHP] [-o @var{option}] [-O @var{shopt_option}] [@var{argument} @dots{}] bash [long-opt] [-abefhkmnptuvxdBCDHP] [-o @var{option}] [-O @var{shopt_option}] -c @var{string} [@var{argument} @dots{}] bash [long-opt] -s [-abefhkmnptuvxdBCDHP] [-o @var{option}] [-O @var{shopt_option}] [@var{argument} @dots{}]
es: bash [opción-larga] [-ir] [-abefhkmnptuvxdBCDHP] [-o @var{opción}] [-O @var{opción_shopt}] [@var{argumento} @dots{}] bash [opción-larga] [-abefhkmnptuvxdBCDHP] [-o @var{opción}] [-O @var{opción_shopt}] -c @var{string} [@var{argumento} @dots{}] bash [opción-larga] -s [-abefhkmnptuvxdBCDHP] [-o @var{opción}] [-O @var{opción_shopt}] [@var{argumento} @dots{}]

source: All of the single-character options used with the @code{set} builtin (@pxref{The Set Builtin}) can be used as options when the shell is invoked. In addition, there are several multi-character options that you can use. These options must appear on the command line before the single-character options to be recognized.
es: Todas las opciones de un carácter usadas por la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}) pueden ser usadas como opciones cuando se llama al intérprete. Además, hay varias opciones de múltiples caracteres que puede usar. Estas opciones tienen que aparecer en la línea de órdenes antes de las opciones de un carácter para ser reconocidas.

source: Arrange for the debugger profile to be executed before the shell starts. Turns on extended debugging mode (see @ref{The Shopt Builtin} for a description of the @code{extdebug} option to the @code{shopt} builtin).
es: Se encarga de que el perfil del depurador se ejecute antes de que se inicie el intérprete. Activa el modo de depuración extendido (vea @ref{La Instrucción Integrada Shopt} para una descripción de la opción @code{extdebug} para la instrucción integrada @code{shopt}).

source: A list of all double-quoted strings preceded by @samp{$} is printed on the standard output in the @sc{gnu} @code{gettext} PO (portable object) file format. Equivalent to @option{-D} except for the output format.
es: Se imprime una lista de todas las cadenas entre comillas dobles en la salida estándar en el formato de archivo PO («portable object» en inglés, objeto portable) de @sc{gnu} @code{gettext}. Equivalente a @option{-D} excepto por el formato de salida.

source: Equivalent to @option{-D}.
es: Equivalente a @option{-D}.

source: Display a usage message on standard output and exit successfully.
es: Muestra un mensaje de uso en la salida estándar y finaliza exitosamente.

source: --init-file @var{filename}
es: --init-file @var{nombre-de-archivo}

source: --rcfile @var{filename}
es: --rcfile @var{nombre-de-archivo}

source: Execute commands from @var{filename} (instead of @file{~/.bashrc}) in an interactive shell.
es: Ejecuta instrucciones de @var{nombre-de-archivo} (en vez de @file{~/.bashrc}) en un intérprete interactivo.

source: Equivalent to @option{-l}.
es: Equivalente a @option{-l}.

source: Do not use the @sc{gnu} Readline library (@pxref{Command Line Editing}) to read command lines when the shell is interactive.
es: No usa la biblioteca @sc{gnu} Readline (@pxref{Edición en Línea de Órdenes}) para leer líneas de órdenes cuando el intérprete está inactivo.

source: Don't load the system-wide startup file @file{/etc/profile} or any of the personal initialization files @file{~/.bash_profile}, @file{~/.bash_login}, or @file{~/.profile} when Bash is invoked as a login shell.
es: No carga el archivo de inicio de alcance global @file{/etc/profile} o cualquiera de los archivos de inicialización personales @file{~/.bash_profile}, @file{~/.bash_login} o @file{~/.profile} cuando Bash es llamado como un intérprete de acceso.

source: Don't read the @file{~/.bashrc} initialization file in an interactive shell. This is on by default if the shell is invoked as @code{sh}.
es: No lee el archivo de inicialización @file{~/.bashrc} en un intérprete interactivo. Esto está activado por defecto si se llama al intérprete como @code{sh}.

source: Change the behavior of Bash where the default operation differs from the @sc{posix} standard to match the standard. This is intended to make Bash behave as a strict superset of that standard. @xref{Bash POSIX Mode}, for a description of the Bash @sc{posix} mode.
es: Cambia el comportamiento de Bash donde la operación por defecto difiera del estándar @sc{posix} para cumplir el estándar. Esto está pensado para hacer que Bash se comporte como un componente preciso de ese estándar. @xref{Modo POSIX de Bash}, para una descripción del modo @sc{posix} de Bash.

source: Make the shell a restricted shell (@pxref{The Restricted Shell}).
es: Vuelve el intérprete un intérprete restringido (@pxref{El Intérprete Restringido}).

source: Equivalent to @option{-v}. Print shell input lines as they're read.
es: Equivalente a @option{-v}. Imprime las líneas de entrada del intérprete según son leídas.

source: Show version information for this instance of Bash on the standard output and exit successfully.
es: Muestra la información de la versión para esta instancia de Bash en la salida estándar y finaliza exitosamente.

source: There are several single-character options that may be supplied at invocation which are not available with the @code{set} builtin.
es: Hay varias opciones de un solo carácter que pueden ser proporcionadas durante la llamada que no están disponibles con la instrucción integrada @code{set}.

source: Read and execute commands from the first non-option argument @var{command_string}, then exit. If there are arguments after the @var{command_string}, the first argument is assigned to @code{$0} and any remaining arguments are assigned to the positional parameters. The assignment to @code{$0} sets the name of the shell, which is used in warning and error messages.
es: Lee y ejecuta instrucciones del primer argumento no opción @var{cadena_de_instrucción}, y finaliza. Si hay argumentos después de @var{cadena_de_instrucción}, se asigna el primer argumento a @code{$0} y se asignan los argumentos restantes a los parámetros posicionales. La asignación a @code{$0} establece el nombre del intérprete, que se usa en advertencias y mensajes de error.

source: Force the shell to run interactively. Interactive shells are described in @ref{Interactive Shells}.
es: Obliga al intérprete a ejecutarse interactivamente. Los intérpretes interactivos se describen en @ref{Intérpretes Interactivos}.

source: Make this shell act as if it had been directly invoked by login. When the shell is interactive, this is equivalent to starting a login shell with @samp{exec -l bash}. When the shell is not interactive, the login shell startup files will be executed. @samp{exec bash -l} or @samp{exec bash --login} will replace the current shell with a Bash login shell. @xref{Bash Startup Files}, for a description of the special behavior of a login shell.
es: Hace que este intérprete actúe como si se hubiera llamado directamente mediante acceso. Cuando el intérprete es interactivo, esto es equivalente a iniciar un intérprete de acceso con @samp{exec -l bash}. Cuando el intérprete no es interativo, serán ejecutados los archivos de inicio del intérprete de acceso. @samp{exec bash -l} o @samp{exec bash --login} reemplazarán el intérprete actual con un intérprete de acceso de Bash. @xref{Archivos de Inicio de Bash}, para una descripción del comportamiento especial de un intérprete de acceso.

source: If this option is present, or if no arguments remain after option processing, then commands are read from the standard input. This option allows the positional parameters to be set when invoking an interactive shell or when reading input through a pipe.
es: Si está presente esta opción, o si no quedan argumentos tras el procesado de opciones, las instrucciones son leídas de la entrada estándar. Esta opción permite que sean establecidos los parámetros posicionales al llamar a un intérprete interactivo o al leer entrada a través de una tuber@'ia.

source: A list of all double-quoted strings preceded by @samp{$} is printed on the standard output. These are the strings that are subject to language translation when the current locale is not @code{C} or @code{POSIX} (@pxref{Locale Translation}). This implies the @option{-n} option; no commands will be executed.
es: Se imprime una lista de todas las cadenas entre comillas dobles a la entrada estándar. Estas son las cadenas que están sujetas a la traducción de idioma cuando la configuración regional actual no es @code{C} o @code{POSIX} (@pxref{Traducción de Localización}). Esto implica la opción @option{-n}; no se ejecutarán instrucciones.

source: [-+]O [@var{shopt_option}]
es: [-+]O [@var{opción_shopt}]

source: @var{shopt_option} is one of the shell options accepted by the @code{shopt} builtin (@pxref{The Shopt Builtin}). If @var{shopt_option} is present, @option{-O} sets the value of that option; @option{+O} unsets it. If @var{shopt_option} is not supplied, the names and values of the shell options accepted by @code{shopt} are printed on the standard output. If the invocation option is @option{+O}, the output is displayed in a format that may be reused as input.
es: @var{opción_shopt} es una de las opciones del intérprete aceptadas por la instrucción integrada @code{shopt} (@pxref{La Instrucción Integrada Shopt}). Si está presente @var{opción_shopt}, @option{-O} habilita el valor de esa opción; @option{+O} lo deshabilita. Si no se proporciona @var{opción_shopt}, se imprimen los nombres y valores de las opciones del intérprete aceptadas por @code{shopt} en la salida estándar. Si la opción de llamada es @option{+O}, la salida se muestra en un formato que puede ser reusado como entrada.

source: A @code{--} signals the end of options and disables further option processing. Any arguments after the @code{--} are treated as filenames and arguments.
es: Un @code{--} señala el fin de opciones y deshabilita el posterior procesado de opciones. Los argumentos después del @code{--} son tratados como nombres de archivos y argumentos.

source: login shell
es: intérprete de acceso

source: A @emph{login} shell is one whose first character of argument zero is @samp{-}, or one invoked with the @option{--login} option.
es: Un intérprete de @emph{acceso} es uno cuyo primer carácter del argumento cero es @samp{-}, o uno llamado con la opción @option{--login}.

source: interactive shell
es: intérprete interactivo

source: An @emph{interactive} shell is one started without non-option arguments, unless @option{-s} is specified, without specifying the @option{-c} option, and whose input and output are both connected to terminals (as determined by @code{isatty(3)}), or one started with the @option{-i} option. @xref{Interactive Shells}, for more information.
es: Un intérprete @emph{interactivo} es uno iniciado sin argumentos que no son opciones, a no ser que se especifique @option{-s}, sin especificar la opción @option{-c} y cuyas entrada y salida están ambas conectadas a terminales (como determina @code{isatty(3)}), o uno iniciado con la opción @option{-i}. @xref{Intérpretes Interactivos}, para más información.

source: If arguments remain after option processing, and neither the @option{-c} nor the @option{-s} option has been supplied, the first argument is assumed to be the name of a file containing shell commands (@pxref{Shell Scripts}). When Bash is invoked in this fashion, @code{$0} is set to the name of the file, and the positional parameters are set to the remaining arguments. Bash reads and executes commands from this file, then exits. Bash's exit status is the exit status of the last command executed in the script. If no commands are executed, the exit status is 0.
es: Si quedan argumentos después del procesamiento de opciones y ni la opción @option{-c} ni la @option{-s} han sido proporcionadas, se asume que el primer argumento es el nombre de un archivo que contiene instrucciones del intérprete (@pxref{Guiones del Intérprete}). Cuando Bash es llamado de esta forma, @code{$0} es asignado al nombre del archivo, y los parámetros posicionales son establecidos a los argumentos restantes. Bash lee y ejecuta instrucciones de este archivo, después se cierra. El estado de salida de Bash es el estado de salida de la última instrucción ejecutada en el guion. Si no se ejecutan instrucciones, el estado de salida es 0.

source: startup files
es: archivos de inicio

source: This section describes how Bash executes its startup files. If any of the files exist but cannot be read, Bash reports an error. Tildes are expanded in filenames as described above under Tilde Expansion (@pxref{Tilde Expansion}).
es: Esta sección describe cómo ejecuta Bash sus archivos de inicio. Si cualquiera de los archivos existe pero no puede ser leído, Bash notifica un error. Las virgulillas se expanden en nombres de archivos como se describió anteriormente en Expansión de Virgulilla (@pxref{Expansión de Virgulilla}).

source: Interactive shells are described in @ref{Interactive Shells}.
es: Los intérpretes interactivos se describen en @ref{Intérpretes Interactivos}.
