Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: The exit status of a pipeline is the exit status of the last command in the pipeline, unless the @code{pipefail} option is enabled (@pxref{The Set Builtin}). If @code{pipefail} is enabled, the pipeline's return status is the value of the last (rightmost) command to exit with a non-zero status, or zero if all commands exit successfully. If the reserved word @samp{!} precedes the pipeline, the exit status is the logical negation of the exit status as described above. The shell waits for all commands in the pipeline to terminate before returning a value.
es: El estado de salida de una tuber@'ia es el estado de salida de la última instrucción en la tuber@'ia, a no ser que esté activada la opción @code{pipefail} (@pxref{La Instrucción Integrada Set}). Si @code{pipefail} está habilitada, el estado de retorno de la tuber@'ia es el valor de la última (la más a la derecha) instrucción que finalice con un estado distinto a cero, o cero si todas las instrucciones finalizan con éxito. Si la palabra reservada @samp{!} precede a la tuber@'ia, el estado de salida es la negación lógica del estado de salida descrito anteriormente. El intérprete espera a que finalicen todas las instrucciones en la tuber@'ia antes de devolver un valor.

source: Lists of Commands
es: Listas de Instrucciones

source: commands, lists
es: instrucciones, listas

source: A @code{list} is a sequence of one or more pipelines separated by one of the operators @samp{;}, @samp{&}, @samp{&&}, or @samp{||}, and optionally terminated by one of @samp{;}, @samp{&}, or a @code{newline}.
es: Una @code{lista} es una secuencia de una o más tuberías separadas por uno de los operadores @samp{;}, @samp{&}, @samp{&&} o @samp{||}, y opcionalmente terminada por @samp{;}, @samp{&}, or a @code{nueva línea}.

source: Of these list operators, @samp{&&} and @samp{||} have equal precedence, followed by @samp{;} and @samp{&}, which have equal precedence.
es: De esta lista de operadores, @samp{&&} y @samp{||} tienen igual precedencia, seguidos de @samp{;} y @samp{&}, que tienen igual precedencia.

source: A sequence of one or more newlines may appear in a @code{list} to delimit commands, equivalent to a semicolon.
es: Una secuencia de una o más nuevas líneas puede aparecer en una @code{lista} para delimitar instrucciones, equivalente a un punto y coma.

source: If a command is terminated by the control operator @samp{&}, the shell executes the command asynchronously in a subshell. This is known as executing the command in the @var{background}, and these are referred to as @var{asynchronous} commands. The shell does not wait for the command to finish, and the return status is 0 (true). When job control is not active (@pxref{Job Control}), the standard input for asynchronous commands, in the absence of any explicit redirections, is redirected from @code{/dev/null}.
es: Si se termina una instrucción con el operador de control @samp{&}, el intérprete ejecuta la instrucción asíncronamente en un subintérprete. Esto se conoce como ejecutar la instrucción en @var{segundo plano}, y estas se conocen como instrucciones @var{as@'incronas}. El intérprete no espera a que termine la instrucción, y el estado de retorno es 0 (verdadero). Cuando el control de tareas no está activo (@pxref{Control de Tareas}), la entrada estándar para instrucciones asíncronas, en ausencia de cualquier redirección explícita, es redirigida desde @code{/dev/null}.

source: Commands separated by a @samp{;} are executed sequentially; the shell waits for each command to terminate in turn. The return status is the exit status of the last command executed.
es: Las instrucciones separadas por un @samp{;} son ejecutadas secuencialmente; el intérprete espera a que cada instrucción termine en orden. El estado de retorno es el estado de salida de la última instrucción ejecutada.

source: @sc{and} and @sc{or} lists are sequences of one or more pipelines separated by the control operators @samp{&&} and @samp{||}, respectively. @sc{and} and @sc{or} lists are executed with left associativity.
es: Las listas @sc{and} y @sc{or} son secuencias de una o más tuberías separadas por los operadores de control @samp{&&} y @samp{||}, respectivamente. Las listas @sc{and} y @sc{or} son ejecutadas con asociatividad izquierda.

source: An @sc{and} list has the form
es: Una lista @sc{and} tiene la forma

source: @var{command1} && @var{command2}
es: @var{instrucción1} && @var{instrucción2}

source: @var{command2} is executed if, and only if, @var{command1} returns an exit status of zero (success).
es: @var{instrucción2} es ejecutada únicamente si @var{instrucción1} devuelve un estado de salida de cero (éxito).

source: An @sc{or} list has the form
es: Una lista @sc{or} tiene la forma

source: @var{command1} || @var{command2}
es: @var{instrucción1} || @var{instrucción2}

source: @var{command2} is executed if, and only if, @var{command1} returns a non-zero exit status.
es: @var{instrucción2} es ejecutada únicamente si @var{instrucción1} devuelve un estado de salida distinto de cero.

source: The return status of @sc{and} and @sc{or} lists is the exit status of the last command executed in the list.
es: El estado de retorno de las listas @sc{and} y @sc{or} es el estado de salida de la última instrucción ejecutada en la lista.

source: commands, compound
es: instrucciones, compuestas

source: Looping Constructs
es: Construcciones de Bucle

source: Shell commands for iterative action.
es: Instrucciones del intérprete para acción iterativa.

source: Conditional Constructs
es: Construcciones Condicionales

source: Shell commands for conditional execution.
es: Instrucciones del intérprete para ejecución condicional.

source: Command Grouping
es: Instrucciones Agrupativas

source: Ways to group commands.
es: Formas de agrupar instrucciones.

source: Compound commands are the shell programming language constructs. Each construct begins with a reserved word or control operator and is terminated by a corresponding reserved word or operator. Any redirections (@pxref{Redirections}) associated with a compound command apply to all commands within that compound command unless explicitly overridden.
es: Las instrucciones compuestas son las construcciones del lenguaje de programación del intérprete. Cada construcción empieza con una palabra reservada u operador de control y termina con una palabra reservada u operador correspondiente. Cualquier redirección (@pxref{Redirecciones}) asociada a una instrucción compuesta se aplica a todas las instrucciones dentro de esa instrucción compuesta a no ser que sea reemplazada explícitamente.

source: In most cases a list of commands in a compound command's description may be separated from the rest of the command by one or more newlines, and may be followed by a newline in place of a semicolon.
es: En la mayoría de los casos, una lista de instrucciones en una descripción de instrucción compuesta puede ser separada del resto de las instrucción por una o más nuevas líneas, y puede ser seguida por una nueva línea en lugar de un punto y coma.

source: Bash provides looping constructs, conditional commands, and mechanisms to group commands and execute them as a unit.
es: Bash proporciona construcciones de bucle, instrucciones condicionales y mecanismos para agrupar instrucciones y ejecutarlas como una unidad.

source: commands, looping
es: instrucciones, bucle

source: Bash supports the following looping constructs.
es: Bash acepta las siguientes construcciones de bucle.

source: Note that wherever a @samp{;} appears in the description of a command's syntax, it may be replaced with one or more newlines.
es: Tenga en cuenta que cada vez que aparezca un @samp{;} en la descripción de la sintaxis de una instrucción, puede ser reemplazado por una o más nuevas líneas.

source: The syntax of the @code{until} command is:
es: La sintaxis de la instrucción @code{until} es:

source: until @var{test-commands}; do @var{consequent-commands}; done
es: until @var{instrucciones-test}; do @var{instrucciones-consiguientes}; done

source: Execute @var{consequent-commands} as long as @var{test-commands} has an exit status which is not zero. The return status is the exit status of the last command executed in @var{consequent-commands}, or zero if none was executed.
es: Ejecuta @var{instrucciones-consiguientes} mientras que @var{instrucciones-test} tenga un estado de salida que no sea cero. El estado de retorno es el estado de salida de la última instrucción ejecutada en @var{instrucciones-consiguientes}, o cero si ninguna fue ejecutada.

source: The syntax of the @code{while} command is:
es: La sintaxis de la instrucción @code{while} es:

source: while @var{test-commands}; do @var{consequent-commands}; done
es: while @var{instrucciones-test}; do @var{instrucciones-consiguientes}; done

source: Execute @var{consequent-commands} as long as @var{test-commands} has an exit status of zero. The return status is the exit status of the last command executed in @var{consequent-commands}, or zero if none was executed.
es: Ejecuta @var{instrucciones-consiguientes} mientras que @var{instrucciones-test} tenga un estado de salida de cero. El estado de retorno es el estado de salida de la última instrucción ejecutada en @var{instrucciones-consiguientes}, o cero si ninguna fue ejecutada.

source: The syntax of the @code{for} command is:
es: La sintaxis de la instrucción @code{for} es:

source: for @var{name} [ [in [@var{words} @dots{}] ] ; ] do @var{commands}; done
es: for @var{nombre} [ [in [@var{palabras} @dots{}] ] ; ] do @var{instrucciones}; done

source: Expand @var{words} (@pxref{Shell Expansions}), and execute @var{commands} once for each member in the resultant list, with @var{name} bound to the current member. If @samp{in @var{words}} is not present, the @code{for} command executes the @var{commands} once for each positional parameter that is set, as if @samp{in "$@@"} had been specified (@pxref{Special Parameters}).
es: Expande @var{palabras} (@pxref{Expansiones del Intérprete}) y ejecuta @var{instrucciones} una vez por cada elemento en la lista resultante, con @var{nombre} vinculado al miembro actual. Si @samp{in @var{palabras}} no está presente, la instrucción @code{for} ejecuta las @var{instrucciones} una vez por cada parámetro posicional que esté establecido, como si @samp{in "$@@"} hubiera sido especificado (@pxref{Parámetros Especiales}).

source: The return status is the exit status of the last command that executes. If there are no items in the expansion of @var{words}, no commands are executed, and the return status is zero.
es: El estado de retorno es el estado de salida de la última instrucción que ejecuta. Si no hay elementos en la expansión de @var{palabras}, no se ejecutan instrucciones y el estado de retorno es cero.

source: An alternate form of the @code{for} command is also supported:
es: También se acepta una forma alternativa de la instrucción @code{for}:

source: for (( @var{expr1} ; @var{expr2} ; @var{expr3} )) ; do @var{commands} ; done
es: for (( @var{expr1} ; @var{expr2} ; @var{expr3} )) ; do @var{instrucciones} ; done

source: First, the arithmetic expression @var{expr1} is evaluated according to the rules described below (@pxref{Shell Arithmetic}). The arithmetic expression @var{expr2} is then evaluated repeatedly until it evaluates to zero. Each time @var{expr2} evaluates to a non-zero value, @var{commands} are executed and the arithmetic expression @var{expr3} is evaluated. If any expression is omitted, it behaves as if it evaluates to 1. The return value is the exit status of the last command in @var{commands} that is executed, or false if any of the expressions is invalid.
es: Primero, la expresión aritmética @var{expr1} se evalúa de acuerdo a las reglas descritas adelante (@pxref{Aritmética del Intérprete}). La expresión aritmética @var{expr2} es entonces evaluada repetidamente hasta que evalúe a cero. Cada vez que @var{expr2} evalúe a un valor distinto de cero, se ejecutan las @var{instrucciones} y se evalúa la expresión aritmética @var{expr3}. Si se omite cualquier expresión, se comporta como si evaluara a 1. El valor de retorno es el estado de salida de la última instrucción que es ejecutada en @var{instrucciones}, o falso si cualquiera de las expresiones es inválida.

source: The @code{break} and @code{continue} builtins (@pxref{Bourne Shell Builtins}) may be used to control loop execution.
es: Las instrucciones integradas @code{break} y @code{continue} (@pxref{Instrucciones Integradas del Bourne Shell}) se pueden usar para controlar la ejecución del bucle.

source: commands, conditional
es: instrucciones, condicional

source: The syntax of the @code{if} command is:
es: La sintaxis de la instrucción @code{if} es:

source: if @var{test-commands}; then @var{consequent-commands}; [elif @var{more-test-commands}; then @var{more-consequents};] [else @var{alternate-consequents};] fi
es: if @var{instrucciones-test}; then @var{instrucciones-consiguientes}; [elif @var{más-instrucciones-test}; then @var{más-consiguientes};] [else @var{consiguientes-alternativas};] fi

source: The @var{test-commands} list is executed, and if its return status is zero, the @var{consequent-commands} list is executed. If @var{test-commands} returns a non-zero status, each @code{elif} list is executed in turn, and if its exit status is zero, the corresponding @var{more-consequents} is executed and the command completes. If @samp{else @var{alternate-consequents}} is present, and the final command in the final @code{if} or @code{elif} clause has a non-zero exit status, then @var{alternate-consequents} is executed. The return status is the exit status of the last command executed, or zero if no condition tested true.
es: La lista de @var{instrucciones-test} es ejecutada, y si su estado de retorno es cero, la lista de @var{instrucciones-consiguientes} es ejecutada. Si @var{instrucciones-test} devuelve un estado de retorno distinto de cero, cada lista @code{elif} es ejecutada en orden, y si su estado es cero, el @var{más-consiguientes} correspondiente es ejecutado y la instrucción se completa. Si @samp{else @var{consiguientes-alternativas}} está presente, y la instrucción final en la última cláusula @code{if} o @code{elif} tiene un estado de salida distinto de cero, entonces @var{consiguientes-alternativas} es ejecutado. El estado de retorno es el estado de salida de la última instrucción ejecutada, o cero si ninguna condición se evaluó a verdadero.

source: The syntax of the @code{case} command is:
es: La sintaxis de la instrucción @code{case} es:

source: case @var{word} in [ [(] @var{pattern} [| @var{pattern}]@dots{}) @var{command-list} ;;]@dots{} esac
es: case @var{palabra} in [ [(] @var{patrón} [| @var{patrón}]@dots{}) @var{lista-de-instrucciones} ;;]@dots{} esac

source: @code{case} will selectively execute the @var{command-list} corresponding to the first @var{pattern} that matches @var{word}. The match is performed according to the rules described below in @ref{Pattern Matching}. If the @code{nocasematch} shell option (see the description of @code{shopt} in @ref{The Shopt Builtin}) is enabled, the match is performed without regard to the case of alphabetic characters. The @samp{|} is used to separate multiple patterns, and the @samp{)} operator terminates a pattern list. A list of patterns and an associated command-list is known as a @var{clause}.
es: @code{case} ejecutará selectivamente la @var{lista-de-instrucciones} correspondiente al primer @var{patrón} que coincide con @var{palabra}. La coincidencia se realiza según las reglas descritas más adelante en @ref{Coincidencia de Patrones}. Si la opción del intérprete @code{nocasematch} (vea la descripción de @code{shopt} en @ref{La Instrucción Integrada Shopt}) está habilitada, la coincidencia se realiza sin tener en cuenta las mayúsculas y minúsculas de caracteres alfabéticos. El @samp{|} es usado para separar múltiples patrones, y el operador @samp{)} finaliza una lista de patrón. Se llama @var{cláusula} a la lista de patrones y a su lista de instrucciones asociada.

source: Each clause must be terminated with @samp{;;}, @samp{;&}, or @samp{;;&}. The @var{word} undergoes tilde expansion, parameter expansion, command substitution, arithmetic expansion, and quote removal (@pxref{Shell Parameter Expansion}) before matching is attempted. Each @var{pattern} undergoes tilde expansion, parameter expansion, command substitution, and arithmetic expansion.
es: Cada cláusula debe terminar en @samp{;;}, @samp{;&} o @samp{;;&}. La @var{palabra} pasa por la expansión de virgulilla, expansión de parámetro, sustitución de instrucción, expansión aritmética y eliminación de comillas (@pxref{Expansión de Parámetros del Intérprete}) antes de que se intente la coincidencia. Cada @var{patrón} pasa por la expansión de virgulilla, sustitución de instrucción y expansión aritmética.

source: There may be an arbitrary number of @code{case} clauses, each terminated by a @samp{;;}, @samp{;&}, or @samp{;;&}. The first pattern that matches determines the command-list that is executed. It's a common idiom to use @samp{*} as the final pattern to define the default case, since that pattern will always match.
es: Puede haber un número arbitrario de cláusulas @code{case}, cada una terminada en @samp{;;}, @samp{;&} o @samp{;;&}. El primer patrón que coincide determina la lista de instrucciones que es ejecutada. Es una expresión normal usar @samp{*} como el patrón final para definir el caso predeterminado, ya que ese patrón siempre coincidirá.

source: Here is an example using @code{case} in a script that could be used to describe one interesting feature of an animal:
es: Aquí hay un ejemplo que usa @code{case} en un guion que podría ser usado para describir un rasgo interesante de un animal:

source: echo -n "Enter the name of an animal: " read ANIMAL echo -n "The $ANIMAL has " case $ANIMAL in horse | dog | cat) echo -n "four";; man | kangaroo ) echo -n "two";; *) echo -n "an unknown number of";; esac echo " legs."
es: echo -n "Introduzca el nombre de un animal: " read ANIMAL echo -n "El $ANIMAL tiene " case $ANIMAL in caballo | perro | gato) echo -n "cuatro";; hombre | canguro ) echo -n "dos";; *) echo -n "un número desconocido de";; esac echo " patas."

source: If the @samp{;;} operator is used, no subsequent matches are attempted after the first pattern match. Using @samp{;&} in place of @samp{;;} causes execution to continue with the @var{command-list} associated with the next clause, if any. Using @samp{;;&} in place of @samp{;;} causes the shell to test the patterns in the next clause, if any, and execute any associated @var{command-list} on a successful match.
es: Si se usa el operador @samp{;;}, no se intentan más coincidencias después de la primera coincidencia de patrón. Usar @samp{;&} en lugar de @samp{;;} hace que la ejecución continúe con la @var{lista-de-instrucciones} asociada con la próxima cláusula, si existe. Usar @samp{;;&} en lugar de @samp{;;} hace que el intérprete pruebe los patrones en la próxima cláusula, si existen, y ejecuta cualquier @var{lista-de-instrucciones} asociada cuando hay una coincidencia con éxito.

source: The return status is zero if no @var{pattern} is matched. Otherwise, the return status is the exit status of the @var{command-list} executed.
es: El estado de retorno es cero si ningún @var{patrón} coincide. En caso contrario, el estado de retorno es el estado de salida de la @var{lista-de-instrucciones} ejecutada.

source: The @code{select} construct allows the easy generation of menus. It has almost the same syntax as the @code{for} command:
es: La construcción @code{select} permite la sencilla generación de menús. Tiene casi la misma sintaxis que la instrucción @code{for}:

source: select @var{name} [in @var{words} @dots{}]; do @var{commands}; done
es: select @var{nombre} [in @var{palabras} @dots{}]; do @var{instrucciones}; done

source: The list of words following @code{in} is expanded, generating a list of items. The set of expanded words is printed on the standard error output stream, each preceded by a number. If the @samp{in @var{words}} is omitted, the positional parameters are printed, as if @samp{in "$@@"} had been specified. The @env{PS3} prompt is then displayed and a line is read from the standard input. If the line consists of a number corresponding to one of the displayed words, then the value of @var{name} is set to that word. If the line is empty, the words and prompt are displayed again. If @code{EOF} is read, the @code{select} command completes. Any other value read causes @var{name} to be set to null. The line read is saved in the variable @env{REPLY}.
es: La lista de palabras detrás de @code{in} es expandida, generando una lista de elementos. El conjunto de palabras expandidas es imprimido en el flujo de la salida de error estándar, cada una precedida por un número. Si se omite el @samp{in @var{palabras}}, se imprimen los parámetros posicionales, como si @samp{in "$@@"} hubiera sido especificado. El prompt @env{PS3} es entonces mostrado y es leída una línea de la entrada estándar. Si la línea consta de un número correspondiente a una de las palabras mostradas, el valor de @var{nombre} es establecido a esa palabra. Si la línea está vacía, las palabras y el prompt se muestran de nuevo. Si es leído @code{EOF}, la instrucción @code{select} se completa. Cualquier otro valor leído hace que @var{nombre} se establezca a nulo. La línea leída es guardada en la variable @env{REPLY}.

source: The @var{commands} are executed after each selection until a @code{break} command is executed, at which point the @code{select} command completes.
es: Las @var{instrucciones} se ejecutan después de cada selección hasta que se ejecute una instrucción @code{break}, en cuyo momento la instrucción @code{select} se completa.

source: Here is an example that allows the user to pick a filename from the current directory, and displays the name and index of the file selected.
es: He aquí un ejemplo que permite al usuario escoger un nombre de archivo del directorio actual y muestra el nombre y el índice del archivo seleccionado.

source: select fname in *; do echo you picked $fname \($REPLY\) break; done
es: select narchivo in *; do echo escogiste $narchivo \($REPLY\) break; done

source: (( @var{expression} ))
es: (( @var{expresión} ))

source: The arithmetic @var{expression} is evaluated according to the rules described below (@pxref{Shell Arithmetic}). If the value of the expression is non-zero, the return status is 0; otherwise the return status is 1. This is exactly equivalent to
es: La @var{expresión} aritmética se evalúa de acuerdo a las reglas descritas adelante (@pxref{Aritmética del Intérprete}). Si el valor de la expresión es distinto de cero, el estado de retorno es 0; de lo contrario, el valor de retorno es 1. Esto es exactamente equivalente a

source: let "@var{expression}"
es: let "@var{expresión}"

source: @xref{Bash Builtins}, for a full description of the @code{let} builtin.
es: @xref{Instrucciones Integradas de Bash}, para una descripción completa de la instrucción integrada @code{let}.

source: [[ @var{expression} ]]
es: [[ @var{expresión} ]]
