Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: If a command is hashed, @option{-p} and @option{-P} print the hashed value, which is not necessarily the file that appears first in @code{$PATH}.
es: Si se crea el resumen criptográfico de una instrucción, @option{-p} y @option{-P} imprimen el valor del resumen criptográfico creado, que no es necesariamente el archivo que aparece primero en @code{$PATH}.

source: If the @option{-a} option is used, @code{type} returns all of the places that contain an executable named @var{file}. This includes aliases and functions, if and only if the @option{-p} option is not also used.
es: Si se usa la opción @option{-a}, @code{type} devuelve todos los lugares que contienen un ejecutable llamado @var{file}. Esto incluye aliases y funciones, solo si la opción @option{-p} no se usa también.

source: If the @option{-f} option is used, @code{type} does not attempt to find shell functions, as with the @code{command} builtin.
es: Si se usa la opción @option{-f}, @code{type} no intenta buscar instrucciones del intérprete, como con la instrucción integrada @code{command}.

source: The return status is zero if all of the @var{names} are found, non-zero if any are not found.
es: El estado de retorno es cero si se encuentran todos los @var{nombres}, distinto a cero si alguno no es encontrado.

source: typeset [-afFgrxilnrtux] [-p] [@var{name}[=@var{value}] @dots{}]
es: typeset [-afFgrxilnrtux] [-p] [@var{nombre}[=@var{valor}] @dots{}]

source: The @code{typeset} command is supplied for compatibility with the Korn shell. It is a synonym for the @code{declare} builtin command.
es: La instrucción @code{typeset} se proporciona por compatibilidad con el intérprete Korn. Es un sinónimo de la instrucción integrada @code{declare}.

source: ulimit [-HSabcdefiklmnpqrstuvxPT] [@var{limit}]
es: ulimit [-HSabcdefiklmnpqrstuvxPT] [@var{límite}]

source: @code{ulimit} provides control over the resources available to processes started by the shell, on systems that allow such control. If an option is given, it is interpreted as follows:
es: @code{ulimit} proporciona control sobre los recursos disponibles para los procesos iniciados por el intérprete, en sistemas que permiten tal control. Si se pasa una opción, se interpreta de la siguiente forma:

source: Change and report the soft limit associated with a resource.
es: Cambia e informa el límite suave asociado con un recurso.

source: Change and report the hard limit associated with a resource.
es: Cambia e informa sobre el límite duro asociado con un recurso.

source: All current limits are reported.
es: Se informa de todos los límites actuales.

source: The maximum socket buffer size.
es: El tamaño máximo de búfer de socket.

source: The maximum size of core files created.
es: El tamaño máximo de archivos de núcleo creados.

source: The maximum size of a process's data segment.
es: El tamaño máximo de un segmento de datos de proceso.

source: The maximum scheduling priority ("nice").
es: La prioridad máxima de planificación ("nice").

source: The maximum size of files written by the shell and its children.
es: El tamaño máximo de archivos escritos por el intérprete y sus hijos.

source: The maximum number of pending signals.
es: El tamaño máximo de señales pendientes.

source: The maximum number of kqueues that may be allocated.
es: El número máximo de kqueues que pueden ser asignadas.

source: The maximum size that may be locked into memory.
es: El máximo tamaño que puede ser bloqueado en memoria.

source: The maximum resident set size (many systems do not honor this limit).
es: El máximo tamaño residente establecido (muchos sistemas no respetan este límite).

source: The maximum number of open file descriptors (most systems do not allow this value to be set).
es: El máximo número de descriptores de archivo abiertos (la mayoría de sistemas no permiten que este valor sea establecido)

source: The pipe buffer size.
es: El tamaño del búfer de la tubería.

source: The maximum number of bytes in POSIX message queues.
es: El máximo número de bytes en colas de mensaje POSIX.

source: The maximum real-time scheduling priority.
es: La máxima prioridad de planificación en tiempo real.

source: The maximum stack size.
es: El tamaño máximo de pila.

source: The maximum amount of cpu time in seconds.
es: La cantidad máxima de tiempo de cpu en segundos.

source: The maximum number of processes available to a single user.
es: El máximo número de procesos disponibles para un único usuario.

source: The maximum amount of virtual memory available to the shell, and, on some systems, to its children.
es: La máxima cantidad de memoria virtual disponible para el intérprete, y, en algunos sistemas, para sus hijos.

source: The maximum number of file locks.
es: El máximo número de bloqueos de archivo.

source: The maximum number of pseudoterminals.
es: El máximo número de pseudoterminales.

source: The maximum number of threads.
es: El máximo número de procesos.

source: If @var{limit} is given, and the @option{-a} option is not used, @var{limit} is the new value of the specified resource. The special @var{limit} values @code{hard}, @code{soft}, and @code{unlimited} stand for the current hard limit, the current soft limit, and no limit, respectively. A hard limit cannot be increased by a non-root user once it is set; a soft limit may be increased up to the value of the hard limit. Otherwise, the current value of the soft limit for the specified resource is printed, unless the @option{-H} option is supplied. When setting new limits, if neither @option{-H} nor @option{-S} is supplied, both the hard and soft limits are set. If no option is given, then @option{-f} is assumed. Values are in 1024-byte increments, except for @option{-t}, which is in seconds; @option{-p}, which is in units of 512-byte blocks; @option{-P}, @option{-T}, @option{-b}, @option{-k}, @option{-n} and @option{-u}, which are unscaled values; and, when in @sc{posix} Mode (@pxref{Bash POSIX Mode}), @option{-c} and @option{-f}, which are in 512-byte increments.
es: Si se proporciona @var{límite}, y la opción @option{-a} no es usada, @var{límite} es el nuevo valor del recurso especificado. Los valores @var{límite} especiales @code{hard}, @code{soft} y @code{unlimited} representan el límite duro actual, el límite blando actual y sin límite, respectivamente. Un límite duro no puede ser aumentado por un usuario distinto a root una vez establecido; un límite blando puede ser aumentado hasta el valor del límite duro. De lo contrario, el valor actual del límite blando para el recurso especificado es imprimido, a no ser que se proporcione la opción @option{-H}. Cuando se establecen nuevos límites, si no se proporciona ni @option{-H} ni @option{-S}, tanto el límite duro como el blando son establecidos. Si no se pasan opciones, entonces se asume @option{-f}. Los valores son en incrementos de 1024 bytes, excepto para @option{-t}, que es en segundos; @option{-p}, que es en unidades de bloques de 512 bytes; @option{-P}, @option{-T}, @option{-b}, @option{-k}, @option{-n} y @option{-u}, que son valores no escalados; y, durante modo @sc{posix} (@pxref{Modo POSIX de Bash}), @option{-c} y @option{-f}, que son en incrementos de 512 bytes.

source: The return status is zero unless an invalid option or argument is supplied, or an error occurs while setting a new limit.
es: El estado de retorno es cero a no ser que se proporcione un argumento u opción inválida, u ocurra un error al establecer un nuevo límite.

source: unalias [-a] [@var{name} @dots{} ]
es: unalias [-a] [@var{nombre} @dots{} ]

source: Remove each @var{name} from the list of aliases. If @option{-a} is supplied, all aliases are removed. Aliases are described in @ref{Aliases}.
es: Elimina cada @var{nombre} de la lista de aliases. Si se proporciona @option{-a}, todos lo aliases son eliminados. Los aliases son descritos en @ref{Aliases}.

source: The Set Builtin
es: La Instrucción Integrada Set

source: Change the values of shell attributes and positional parameters.
es: Cambia los valores de atributos del intérprete y de parámetros posicionales.

source: The Shopt Builtin
es: La Instrucción Integrada Shopt

source: Modify shell optional behavior.
es: Modifica el comportamiento opcional del intérprete.

source: This builtin is so complicated that it deserves its own section. @code{set} allows you to change the values of shell options and set the positional parameters, or to display the names and values of shell variables.
es: Esta instrucción integrada es tan complicada que se merece su propia sección. @code{set} te permite cambiar los valores de las opciones del intérprete y establecer los parámetros posicionales, o mostrar los nombres y valores de las variables del intérprete.

source: set [--abefhkmnptuvxBCEHPT] [-o @var{option-name}] [@var{argument} @dots{}] set [+abefhkmnptuvxBCEHPT] [+o @var{option-name}] [@var{argument} @dots{}]
es: set [--abefhkmnptuvxBCEHPT] [-o @var{nombre-de-opción}] [@var{argumento} @dots{}] set [+abefhkmnptuvxBCEHPT] [+o @var{nombre-de-opción}] [@var{argumento} @dots{}]

source: If no options or arguments are supplied, @code{set} displays the names and values of all shell variables and functions, sorted according to the current locale, in a format that may be reused as input for setting or resetting the currently-set variables. Read-only variables cannot be reset. In @sc{posix} mode, only shell variables are listed.
es: Si no se proporcionan opciones o argumentos, @code{set} muestra los nombres y valores de todas las variables y funciones del intérprete, ordenadas según la actual configuración regional, en un formato que puede ser reutilizado como entrada para establecer o eliminar las variables actualmente establecidas. Las variables de solo lectura no pueden ser eliminadas. En modo @sc{posix}, solo son listadas las variables del intérprete.

source: When options are supplied, they set or unset shell attributes. Options, if specified, have the following meanings:
es: Cuando se proporcionan opciones, establecen o eliminan los atributos del intérprete. Las opciones, si se especifican, tienen los siguientes significados:

source: Each variable or function that is created or modified is given the export attribute and marked for export to the environment of subsequent commands.
es: A cada variable o función que es creada o modificada se le da el atributo de exportación y es marcada para exportar al entorno de las posteriores instrucciones.

source: Cause the status of terminated background jobs to be reported immediately, rather than before printing the next primary prompt.
es: Hace que se informe inmediatamente del estado de las tareas en segundo plano terminadas, en vez de imprimir antes del siguiente prompt primario.

source: Exit immediately if a pipeline (@pxref{Pipelines}), which may consist of a single simple command (@pxref{Simple Commands}), a list (@pxref{Lists}), or a compound command (@pxref{Compound Commands}) returns a non-zero status. The shell does not exit if the command that fails is part of the command list immediately following a @code{while} or @code{until} keyword, part of the test in an @code{if} statement, part of any command executed in a @code{&&} or @code{||} list except the command following the final @code{&&} or @code{||}, any command in a pipeline but the last, or if the command's return status is being inverted with @code{!}. If a compound command other than a subshell returns a non-zero status because a command failed while @option{-e} was being ignored, the shell does not exit. A trap on @code{ERR}, if set, is executed before the shell exits.
es: Sale del intérprete inmediatamente si una tubería (@pxref{Tuberías}), que puede consistir en una única instrucción simple (@pxref{Instrucciones Simples}), una lista (@pxref{Listas}) o una instrucción compuesta (@pxref{Instrucciones Compuestas}) devuelve un estado distinto de cero. El intérprete no se cierra si la instrucción que falla es parte de la lista de instrucciones que sigue inmediatamente una palabra clave @code{while} o @code{until}, parte de una comprobación en un oración @code{if}, parte de cualquier instrucción ejecutada en una lista @code{&&} o @code{||} excepto la instrucción que sigue al último @code{&&} o @code{||}, cualquier instrucción en una tubería excepto la última, o si el estado de retorno es invertido con @code{!}. Si una instrucción compuesta distinta de un subintérprete retorna un estado distinto a cero porque una instrucción falló mientras se ignoraba @option{-e}, no se cierra el intérprete. Se ejecuta una trap en @code{ERR}, si está establecida, antes de que el intérprete salga.

source: This option applies to the shell environment and each subshell environment separately (@pxref{Command Execution Environment}), and may cause subshells to exit before executing all the commands in the subshell.
es: Esta opción se aplica al entorno del intérprete y a cada entorno de subintérprete de forma separada (@pxref{Entorno de Ejecución de Instrucciones}), y puede provocar que los subintérpretes se cierren antes de ejecutar todas las instrucciones en el subintérprete.

source: If a compound command or shell function executes in a context where @option{-e} is being ignored, none of the commands executed within the compound command or function body will be affected by the @option{-e} setting, even if @option{-e} is set and a command returns a failure status. If a compound command or shell function sets @option{-e} while executing in a context where @option{-e} is ignored, that setting will not have any effect until the compound command or the command containing the function call completes.
es: Si una instrucción compuesta o una función del intérprete se ejecuta en un contexto en el que @option{-e} esté siendo ignorado, ninguna de las instrucciones ejecutadas dentro de la instrucción compuesta o cuerpo de la función se verá afectada por el ajuste @option{-e}, incluso si @option{-e} está establecido y una instrucción devuelva un estado de fallo. Si una instrucción compuesta o función del intérprete establece @option{-e} es ignorado, ese ajuste no tendrá ningún efecto hasta que la instrucción compuesta o la instrucción que contiene la llamada a la función se complete.

source: Disable filename expansion (globbing).
es: Deshabilita la expansión de nombre de archivo (globbing).

source: Locate and remember (hash) commands as they are looked up for execution. This option is enabled by default.
es: Ubica y recuerda instrucciones (resumen criptográfico) mientras son consultadas para su ejecución. Esta opción está habilitada por defecto.

source: All arguments in the form of assignment statements are placed in the environment for a command, not just those that precede the command name.
es: Todos los argumentos en forma de sentencias de asignación son ubicados en el entorno para una instrucción, no solo aquellos que preceden al nombre de la instrucción.

source: Job control is enabled (@pxref{Job Control}). All processes run in a separate process group. When a background job completes, the shell prints a line containing its exit status.
es: Es habilitado el control de tareas (@pxref{Control de Tareas}). Todos los procesos se ejecutan en un grupo de procesos separado. Cuando se completa una tarea en segundo plano, el intérprete imprime una línea que contiene su estado de salida.

source: Read commands but do not execute them. This may be used to check a script for syntax errors. This option is ignored by interactive shells.
es: Lee instrucciones pero no las ejecuta. Esto puede ser utilizado para comprobar un guion en busca de errores de sintaxis. Esta opción es ignorada por los intérpretes interactivos.

source: -o @var{option-name}
es: -o @var{nombre-de-opción}

source: Set the option corresponding to @var{option-name}:
es: Establece la opción correspondiente a @var{nombre-de-opción}:

source: Same as @code{-a}.
es: Equivalente a @code{-a}.

source: Same as @code{-B}.
es: Equivalente a @code{-B}.

source: Use an @code{emacs}-style line editing interface (@pxref{Command Line Editing}). This also affects the editing interface used for @code{read -e}.
es: Usa una interfaz de edición de línea (@pxref{Edición en Línea de Órdenes}) estilo @code{emacs}. Esto también afecta a la interfaz de edición usada para @code{read -e}.

source: Same as @code{-e}.
es: Equivalente a @code{-e}.

source: errtrace
es: errexit

source: Same as @code{-E}.
es: Equivalente a @code{-E}.

source: Same as @code{-T}.
es: Equivalente a @code{-T}.

source: Same as @code{-h}.
es: Equivalente a @code{-h}.

source: Same as @code{-H}.
es: Equivalente a @code{-H}.

source: Enable command history, as described in @ref{Bash History Facilities}. This option is on by default in interactive shells.
es: Habilita el historial de instrucciones, como se describe en @ref{Servicios del Historial de Bash}. Esta opción está activada por defecto en intérpretes interactivos.

source: An interactive shell will not exit upon reading EOF.
es: No se saldrá de un intérprete interactivo al leer EOF.

source: Same as @code{-k}.
es: Equivalente a @code{-k}.

source: Same as @code{-m}.
es: Equivalente a @code{-m}.

source: Same as @code{-C}.
es: Equivalente a @code{-C}.

source: Same as @code{-n}.
es: Equivalente a @code{-n}.

source: Same as @code{-f}.
es: Equivalente a @code{-f}.

source: Currently ignored.
es: Actualmente ignorado.

source: Same as @code{-b}.
es: Equivalente a @code{-b}.

source: Same as @code{-u}.
es: Equivalente a @code{-u}.

source: Same as @code{-t}.
es: Equivalente a @code{-t}.

source: Same as @code{-P}.
es: Equivalente a @code{-P}.

source: If set, the return value of a pipeline is the value of the last (rightmost) command to exit with a non-zero status, or zero if all commands in the pipeline exit successfully. This option is disabled by default.
es: Si se habilita, el valor de retorno de una tubería es el valor de la última (la más a la derecha) instrucción que finalice con un estado distinto de cero, o cero si todas las instrucciones en la tubería finalizan con éxito. Esta opción está deshabilitada por defecto.

source: Change the behavior of Bash where the default operation differs from the @sc{posix} standard to match the standard (@pxref{Bash POSIX Mode}). This is intended to make Bash behave as a strict superset of that standard.
es: Cambia el comportamiento de Bash donde la operación por defecto difiere del estándar @sc{posix} para cumplir el estándar (@pxref{Modo POSIX de Bash}). Esto está pensado para hacer que Bash se comporte como un componente preciso de ese estándar.

source: Same as @code{-p}.
es: Equivalente a @code{-p}.

source: Same as @code{-v}.
es: Equivalente a @code{-v}.

source: Use a @code{vi}-style line editing interface. This also affects the editing interface used for @code{read -e}.
es: Usa la interfaz de edición de línea estilo @code{vi}. Esto también afecta a la interfaz de edición usada por @code{read -e}.

source: Same as @code{-x}.
es: Equivalente a @code{-x}.

source: Turn on privileged mode. In this mode, the @env{$BASH_ENV} and @env{$ENV} files are not processed, shell functions are not inherited from the environment, and the @env{SHELLOPTS}, @env{BASHOPTS}, @env{CDPATH} and @env{GLOBIGNORE} variables, if they appear in the environment, are ignored. If the shell is started with the effective user (group) id not equal to the real user (group) id, and the @option{-p} option is not supplied, these actions are taken and the effective user id is set to the real user id. If the @option{-p} option is supplied at startup, the effective user id is not reset. Turning this option off causes the effective user and group ids to be set to the real user and group ids.
es: Activa el modo privilegiado. En este modo los archivos @env{$BASH_ENV} y @env{$env} no son procesados, las funciones no son heredadas del entorno y las variables @env{SHELLOPTS}, @env{BASHOPTS}, @env{CDPATH} y @env{GLOBIGNORE}, si aparecen en el entorno, son ignoradas. Si el intérprete se inicia con el identificador efectivo del usuario (grupo) diferente del identificador del usuario (grupo) real y no se proporciona la opción @option{-p}, se llevan estas acciones, y el id efectivo del usuario se establece al id real del usuario. Si la opción @option{-p} se proporciona durante el inicio, no se restablece el id de usuario efectivo. Desactivar esta opción hace que los identificadores del usuario y el grupo efectivos sean establecidos a los identificadores del usuario y el grupo reales.

source: Exit after reading and executing one command.
es: Sale después de leer y ejecutar una instrucción.

source: Treat unset variables and parameters other than the special parameters @samp{@@} or @samp{*} as an error when performing parameter expansion. An error message will be written to the standard error, and a non-interactive shell will exit.
es: Trata las variables y parámetros sin establecer que sean distintos a @samp{@@} o @samp{*} como un error cuando se realiza la expansión de parámetros. Se escribirá un mensaje de error a la salida de error estándar, y un intérprete no interactivo se cerrará.

source: Print shell input lines as they are read.
es: Imprime las líneas de entrada del intérprete según son leídas.

source: Print a trace of simple commands, @code{for} commands, @code{case} commands, @code{select} commands, and arithmetic @code{for} commands and their arguments or associated word lists after they are expanded and before they are executed. The value of the @env{PS4} variable is expanded and the resultant value is printed before the command and its expanded arguments.
es: Imprime un rastro de instrucciones simples, instrucciones @code{for}, instrucciones @code{case}, instrucciones @code{select} y instrucciones aritméticas @code{for} y sus argumentos o listas de palabras asociadas después de que sean expandidos y antes de que sean ejecutados. El valor de la variable @env{PS4} es expandido, y el valor resultante es imprimido antes de la instrucción y sus argumentos expandidos.

source: The shell will perform brace expansion (@pxref{Brace Expansion}). This option is on by default.
es: El intérprete realizará la expansión de llaves (@pxref{Expansión de Llaves}). Está opción está activada por defecto.

source: Prevent output redirection using @samp{>}, @samp{>&}, and @samp{<>} from overwriting existing files.
es: Evita que la redirección de salida usando @samp{>}, @samp{>&} y @samp{<>} sobreescriba archivos existentes.

source: If set, any trap on @code{ERR} is inherited by shell functions, command substitutions, and commands executed in a subshell environment. The @code{ERR} trap is normally not inherited in such cases.
es: Si está establecida, cualquier trap en @code{ERR} es heredada por funciones del intérprete, sustituciones de intrucciones e intrucciones ejecutadas en un entorno de subintérprete. La trap @code{ERR} no se hereda normalmente en tales casos.

source: Enable @samp{!} style history substitution (@pxref{History Interaction}). This option is on by default for interactive shells.
es: Habilita la sustitución de historial estilo @samp{!} (@pxref{Interacción con el Historial}). Está opción está activada por defecto en intérpretes interactivos.

source: If set, do not resolve symbolic links when performing commands such as @code{cd} which change the current directory. The physical directory is used instead. By default, Bash follows the logical chain of directories when performing commands which change the current directory.
es: Si está habilitada, no resuelve enlaces simbólicos al realizar instrucciones como @code{cd} que cambian el directorio actual. Se usa el directorio físico en su lugar. Por defecto, Bash sigue la cadena lógica de directorios cuando realiza instrucciones que cambian el directorio actual.
