Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Unless otherwise noted, each builtin command documented as accepting options preceded by @samp{-} accepts @samp{--} to signify the end of the options. The @code{:}, @code{true}, @code{false}, and @code{test}/@code{[} builtins do not accept options and do not treat @samp{--} specially. The @code{exit}, @code{logout}, @code{return}, @code{break}, @code{continue}, @code{let}, and @code{shift} builtins accept and process arguments beginning with @samp{-} without requiring @samp{--}. Other builtins that accept arguments but are not specified as accepting options interpret arguments beginning with @samp{-} as invalid options and require @samp{--} to prevent this interpretation.
es: A no ser que se indique lo contrario, cada instrucción integrada documentada como que acepta opciones precedidas por @samp{-} acepta @samp{--} para indicar el fin de las opciones. Las instrucciones integradas @code{:}, @code{true}, @code{false} y @code{test} / @code{[} no aceptan opciones y no tratan @samp{--} de forma especial. Las instrucciones integradas @code{exit}, @code{logout}, @code{return}, @code{break}, @code{continue}, @code{let} y @code{shift} aceptan y procesan argumentos que empiezan con @samp{-} sin requerir @samp{--}. Otras instrucciones integradas que aceptan argumentos pero no especifican que aceptan opciones, interpretan argumentos que empiezan con @samp{-} como opciones inválidas y requieren @samp{--} para evitar esta interpretación.

source: The following shell builtin commands are inherited from the Bourne Shell. These commands are implemented as specified by the @sc{posix} standard.
es: Las siguientes instrucciones integradas del intérprete son heredadas del Bourne Shell. Estas órdenes se implementan como está especificado en el estándar @sc{posix}.

source: : @r{(a colon)}
es: : @r{(dos puntos)}

source: : [@var{arguments}]
es: : [@var{argumentos}]

source: Do nothing beyond expanding @var{arguments} and performing redirections. The return status is zero.
es: No hace nada más allá de expandir @var{argumentos} y realizar redirecciones. El estado de retorno es cero.

source: . @r{(a period)}
es: . @r{(un punto)}

source: . @var{filename} [@var{arguments}]
es: . @var{nombre-de-archivo} [@var{argumentos}]

source: Read and execute commands from the @var{filename} argument in the current shell context. If @var{filename} does not contain a slash, the @env{PATH} variable is used to find @var{filename}. When Bash is not in @sc{posix} mode, the current directory is searched if @var{filename} is not found in @env{$PATH}. If any @var{arguments} are supplied, they become the positional parameters when @var{filename} is executed. Otherwise the positional parameters are unchanged. If the @option{-T} option is enabled, @code{source} inherits any trap on @code{DEBUG}; if it is not, any @code{DEBUG} trap string is saved and restored around the call to @code{source}, and @code{source} unsets the @code{DEBUG} trap while it executes. If @option{-T} is not set, and the sourced file changes the @code{DEBUG} trap, the new value is retained when @code{source} completes. The return status is the exit status of the last command executed, or zero if no commands are executed. If @var{filename} is not found, or cannot be read, the return status is non-zero. This builtin is equivalent to @code{source}.
es: Lee y ejecuta instrucciones del argumento @var{nombre-de-archivo} en el actual contexto del intérprete. Si @var{nombre-de-archivo} no contiene una barra, la variable @env{PATH} se usa para encontrar @var{nombre-de-archivo}. Cuando Bash no está en modo @sc{posix}, se explora el directorio actual si @var{nombrearchivo} no se encuentra en @env{PATH}. Si se pasan @var{argumentos}, se convierten en los argumentos posicionales cuando se ejecuta @var{nombre-de-archivo}. De modo contrario, los argumentos posicionales no se cambian. Si la opción @option{-T} está habilitada, @code{source} hereda cualquier trap en @code{DEBUG}; si no, cualquier cadena de @code{DEBUG} trap se guarda y se restaura alrededor de la llamada a @code{source}, y @code{source} elimina la trap @code{DEBUG} mientras se ejecuta. Si @option{-T} no está establecido, y el archivo leído cambia el trap @code{DEBUG}, el nuevo valor se almacena cuando @code{source} termina. El estado de retorno es el estado de salida de la última instrucción ejecutada, o cero si no se ejecuta ninguna orden. Si no se encuentra @var{nombre-de-archivo}, o no se puede leer, el estado de retorno es diferente de cero. Esta instrucción integrada es equivalente a @code{source}.

source: Exit from a @code{for}, @code{while}, @code{until}, or @code{select} loop. If @var{n} is supplied, the @var{n}th enclosing loop is exited. @var{n} must be greater than or equal to 1. The return status is zero unless @var{n} is not greater than or equal to 1.
es: Sale de un bucle @code{for}, @code{while}, @code{until} o @code{select}. Si se proporciona @var{n}, se sale del nivel @var{n} de anidación del bucle. @var{n} debe ser mayor o igual a 1. El estado de salida es cero a no ser que @var{n} no sea mayor o igual a 1.

source: cd [-L|[-P [-e]] [-@@] [@var{directory}]
es: cd [-L|[-P [-e]] [-@@] [@var{directorio}]

source: Change the current working directory to @var{directory}. If @var{directory} is not supplied, the value of the @env{HOME} shell variable is used. Any additional arguments following @var{directory} are ignored. If the shell variable @env{CDPATH} exists, it is used as a search path: each directory name in @env{CDPATH} is searched for @var{directory}, with alternative directory names in @env{CDPATH} separated by a colon (@samp{:}). If @var{directory} begins with a slash, @env{CDPATH} is not used.
es: Cambia el actual directorio de trabajo a @var{directorio}. Si no se proporciona @var{directorio}, se usa el valor de la variable del intérprete @env{HOME}. Cualquier argumento adicional que siga a @var{directorio} es ignorado. Si la variable de intérprete @env{CDPATH} existe, es usada como ruta de búsqueda: en cada nombre de directorio de @env{CDPATH} se busca @var{directorio}, con los nombres alternativos de directorios en @env{CDPATH} separados por dos puntos (@samp{:}). Si @var{directorio} empieza por una barra, @env{CDPATH} no se usa.

source: The @option{-P} option means to not follow symbolic links: symbolic links are resolved while @code{cd} is traversing @var{directory} and before processing an instance of @samp{..} in @var{directory}.
es: La opción @option{-P} significa que no sigue los enlaces simbólicos: los enlaces simbólicos son resueltos mientras @code{cd} está recorriendo @var{directorio} y antes de procesar una instancia de @samp{..} en @var{directorio}.

source: By default, or when the @option{-L} option is supplied, symbolic links in @var{directory} are resolved after @code{cd} processes an instance of @samp{..} in @var{directory}.
es: Por defecto, o cuando se proporciona la opción @option{-L}, los enlaces simbólicos en @var{directorio} son resueltos después de que @code{cd} procesa una instancia de @samp{..} en @var{directorio}.

source: If @samp{..} appears in @var{directory}, it is processed by removing the immediately preceding pathname component, back to a slash or the beginning of @var{directory}.
es: Si @samp{..} aparece en @var{directorio}, se procesa eliminando el componente de nombre de ruta que le precede inmediatamente, de vuelta a una barra o al inicio de @var{directorio}.

source: If the @option{-e} option is supplied with @option{-P} and the current working directory cannot be successfully determined after a successful directory change, @code{cd} will return an unsuccessful status.
es: Si la opción @option{-e} es proporcionada junto a @option{-P} y el directorio de trabajo actual no se puede determinar con éxito después de un exitoso cambio de directorio, @code{cd} revolverá un estado de retorno no exitoso.

source: On systems that support it, the @option{-@@} option presents the extended attributes associated with a file as a directory.
es: En sistemas que lo soportan, la opción @option{-@@} presenta los atributos extendidos asociados a un archivo como directorio.

source: If @var{directory} is @samp{-}, it is converted to @env{$OLDPWD} before the directory change is attempted.
es: Si @var{directorio} es @samp{-}, este se convierte en @env{$OLDPWD} antes de que se intente el cambio de directorio.

source: If a non-empty directory name from @env{CDPATH} is used, or if @samp{-} is the first argument, and the directory change is successful, the absolute pathname of the new working directory is written to the standard output.
es: Si se usa un nombre de directorio de @env{CDPATH} no vacío o si @samp{-} es el primer argumento y el cambio de directorio es exitoso, el nombre de ruta absoluto del nuevo directorio de trabajo se escribe a la salida estándar.

source: The return status is zero if the directory is successfully changed, non-zero otherwise.
es: El código de retorno es cero si el directorio es cambiado exitosamente, distinto de cero de no ser así.

source: Resume the next iteration of an enclosing @code{for}, @code{while}, @code{until}, or @code{select} loop. If @var{n} is supplied, the execution of the @var{n}th enclosing loop is resumed. @var{n} must be greater than or equal to 1. The return status is zero unless @var{n} is not greater than or equal to 1.
es: Reanuda la siguiente iteración de un bucle @code{for}, @code{while}, @code{until} o @code{select} que lo contiene. Si se proporciona @var{n}, reanuda la ejecución del bucle de nivel de anidamiento @var{n} que lo contiene. @var{n} debe ser mayor o igual a 1. El código de retorno es cero a no ser que @var{n} no sea mayor o igual a 1.

source: The arguments are concatenated together into a single command, which is then read and executed, and its exit status returned as the exit status of @code{eval}. If there are no arguments or only empty arguments, the return status is zero.
es: Los argumentos son concatenados juntos en una única instrucción, que entonces es leída y ejecutada, y su estado de salida devuelto como el estado de salida de @code{eval}. Si no hay argumentos o solo argumentos vacíos, el estado de retorno es cero.

source: exec [-cl] [-a @var{name}] [@var{command} [@var{arguments}]]
es: exec [-cl] [-a @var{nombre}] [@var{instrucción} [@var{argumentos}]]

source: If @var{command} is supplied, it replaces the shell without creating a new process. If the @option{-l} option is supplied, the shell places a dash at the beginning of the zeroth argument passed to @var{command}. This is what the @code{login} program does. The @option{-c} option causes @var{command} to be executed with an empty environment. If @option{-a} is supplied, the shell passes @var{name} as the zeroth argument to @var{command}. If @var{command} cannot be executed for some reason, a non-interactive shell exits, unless the @code{execfail} shell option is enabled. In that case, it returns failure. An interactive shell returns failure if the file cannot be executed. A subshell exits unconditionally if @code{exec} fails. If no @var{command} is specified, redirections may be used to affect the current shell environment. If there are no redirection errors, the return status is zero; otherwise the return status is non-zero.
es: Si se proporciona @var{instrucció}, reemplaza el intérprete sin crear un nuevo proceso. Si se proporciona la opción @option{-l}, el intérprete pone una barra al comienzo del argumento número cero pasado a @var{instrucción}. Esto es lo que hace el programa @code{login}. La opción @option{-c} hace que @var{instrucción} sea ejecutada con un entorno vac@'io. Si se proporciona @option{-a}, el intérprete pasa @var{nombre} como el argumento número cero a @var{instrucción}. Si por alguna razón no se puede ejecutar @var{instrucción}, se cierra un intérprete no interactivo, a no ser que esté habilitada la opción del intérprete @code{execfail}. En ese caso devuelve fallo. Un intérprete interactivo devuelve fallo si el archivo no puede ser ejecutado. Un subintérprete finaliza de forma incondicional si @code{exec} falla. Si no se especifica ninguna @var{instrucción}, se pueden usar redirecciones para afectar al entorno actual del intérprete. Si no hay errores de redirección, el estado de retorno es cero; de lo contrario, el estado de retorno es distinto a cero.

source: Exit the shell, returning a status of @var{n} to the shell's parent. If @var{n} is omitted, the exit status is that of the last command executed. Any trap on @code{EXIT} is executed before the shell terminates.
es: Sale del intérprete, devolviendo un estado de @var{n} al padre del intérprete. Si se omite @var{n}, el estado de salida es el mismo de la última orden ejecutada. Cualquier trap en @code{EXIT} se ejecuta antes de que el intérprete termine.

source: export [-fn] [-p] [@var{name}[=@var{value}]]
es: export [-fn] [-p] [@var{nombre}[=@var{valor}]]

source: Mark each @var{name} to be passed to child processes in the environment. If the @option{-f} option is supplied, the @var{name}s refer to shell functions; otherwise the names refer to shell variables. The @option{-n} option means to no longer mark each @var{name} for export. If no @var{names} are supplied, or if the @option{-p} option is given, a list of names of all exported variables is displayed. The @option{-p} option displays output in a form that may be reused as input. If a variable name is followed by =@var{value}, the value of the variable is set to @var{value}.
es: Marca cada @var{nombre} para que sea pasado a los procesos hijos en el entorno. Si se proporciona la opción @option{-f}, los @var{nombre}s se refieren a funciones del intérprete; de lo contrario, los nombres se refieren a variables del intérprete. La opción @option{-n} equivale a dejar de marcar cada @var{nombre} para exportación. Si no se proporcionan @var{nombres}, o si se pasa la opción @option{-p}, se muestra una lista de nombres de todas las variables exportadas. La opción @option{-p} muestra la salida en una forma que puede ser reusada como entrada. Si a un nombre de variable sigue =@var{valor}, el valor de la variable se establece a @var{valor}.

source: The return status is zero unless an invalid option is supplied, one of the names is not a valid shell variable name, or @option{-f} is supplied with a name that is not a shell function.
es: El estado de retorno es cero a no ser que se proporcione una opción inválida, uno de los nombres no sea un nombre de variable de intérprete válido o se proporcione @option{-f} con un nombre que no sea una función del intérprete.

source: getopts @var{optstring} @var{name} [@var{args}]
es: getopts @var{cadenaopc} @var{nombre} [@var{args}]

source: @code{getopts} is used by shell scripts to parse positional parameters. @var{optstring} contains the option characters to be recognized; if a character is followed by a colon, the option is expected to have an argument, which should be separated from it by whitespace. The colon (@samp{:}) and question mark (@samp{?}) may not be used as option characters. Each time it is invoked, @code{getopts} places the next option in the shell variable @var{name}, initializing @var{name} if it does not exist, and the index of the next argument to be processed into the variable @env{OPTIND}. @env{OPTIND} is initialized to 1 each time the shell or a shell script is invoked. When an option requires an argument, @code{getopts} places that argument into the variable @env{OPTARG}. The shell does not reset @env{OPTIND} automatically; it must be manually reset between multiple calls to @code{getopts} within the same shell invocation if a new set of parameters is to be used.
es: @code{getopts} se usa por los guiones del intérprete para analizar parámetros posicionales. @var{cadenaopc} contiene los caracteres de opción que serán reconocidos; si a un carácter le siguen dos puntos, se espera que la opción tenga un argumento, que debería estar separado de ese por un espacio. Los dos puntos (@samp{:}) y el símbolo de interrogación (@samp{?}) no pueden ser usados como caracteres de opción. Cada vez que se invoca, @code{getopts} ubica la siguiente opción en la variable de intérprete @var{nombre}, inicializando @var{nombre} si no existe, y el índice del siguiente argumento a ser procesado en la variable @env{OPTIND}. @env{OPTIND} es inicializado a 1 cada vez que el intérprete o un guion de intérprete es invocado. Cuando una opción requiere un parámetro, @code{getopts} ubica ese argumento en la variable @env{OPTARG}. El intérprete no elimina @env{OPTIND} automáticamente; tiene que ser eliminado manualmente entre múltiples llamadas a @code{getopts} dentro de la misma invocación del intérprete si se pretende usar un nuevo conjunto de parámetros.

source: When the end of options is encountered, @code{getopts} exits with a return value greater than zero. @env{OPTIND} is set to the index of the first non-option argument, and @var{name} is set to @samp{?}.
es: Cuando se encuentra el fin de las opciones, @code{getopts} sale con un valor de retorno mayor que cero. Se establece @env{OPTIND} al índice del primer argumento que no sea una opción y @var{nombre} se establece a @samp{?}.

source: @code{getopts} normally parses the positional parameters, but if more arguments are given in @var{args}, @code{getopts} parses those instead.
es: @code{getopts} normalmente analiza los parámetros posicionales, pero si se pasan más argumentos en @var{args}, @code{getopts} analiza esos en su lugar.

source: @code{getopts} can report errors in two ways. If the first character of @var{optstring} is a colon, @var{silent} error reporting is used. In normal operation, diagnostic messages are printed when invalid options or missing option arguments are encountered. If the variable @env{OPTERR} is set to 0, no error messages will be displayed, even if the first character of @code{optstring} is not a colon.
es: @code{getopts} puede informar de errores de dos formas. Si el primer carácter de @var{cadenaopc} es dos puntos, se usa el aviso de errores @var{silencioso}. En funcionamiento normal, los mensajes de diagnóstico se imprimen cuando se encuentran opciones inválidas o argumentos de opción que faltan. Si se establece la variable @env{OPTERR} a 0, no se mostrarán mensajes de error, incluso si el primer carácter de @code{cadenaopc} no es dos puntos.

source: If an invalid option is seen, @code{getopts} places @samp{?} into @var{name} and, if not silent, prints an error message and unsets @env{OPTARG}. If @code{getopts} is silent, the option character found is placed in @env{OPTARG} and no diagnostic message is printed.
es: Si se detecta una opción inválida, @code{getopts} guarda @samp{?} en @var{nombre} y, si no es silencioso, imprime un mensaje de error y elimina @env{OPTARG}. Si @code{getopts} es silencioso, el carácter de opción encontrado se guarda en @env{OPTARG} y no se muestra ningún mensaje de diagnóstico.

source: If a required argument is not found, and @code{getopts} is not silent, a question mark (@samp{?}) is placed in @var{name}, @code{OPTARG} is unset, and a diagnostic message is printed. If @code{getopts} is silent, then a colon (@samp{:}) is placed in @var{name} and @env{OPTARG} is set to the option character found.
es: Si no se encuentra un argumento requerido, y @code{getopts} no es silencioso, se guarda un símbolo de interrogación (@samp{?}) en @var{nombre}, @code{OPTARG} se elimina, y se imprime un mensaje de diagnóstico. Si @code{getopts} es silencioso, se guardan dos puntos (@samp{:}) en @var{nombre} y @env{OPTARG} se establece al carácter de opción encontrado.

source: hash [-r] [-p @var{filename}] [-dt] [@var{name}]
es: hash [-r] [-p @var{nombre-de-archivo}] [-dt] [@var{nombre}]

source: Each time @code{hash} is invoked, it remembers the full pathnames of the commands specified as @var{name} arguments, so they need not be searched for on subsequent invocations. The commands are found by searching through the directories listed in @env{$PATH}. Any previously-remembered pathname is discarded. The @option{-p} option inhibits the path search, and @var{filename} is used as the location of @var{name}. The @option{-r} option causes the shell to forget all remembered locations. The @option{-d} option causes the shell to forget the remembered location of each @var{name}. If the @option{-t} option is supplied, the full pathname to which each @var{name} corresponds is printed. If multiple @var{name} arguments are supplied with @option{-t}, the @var{name} is printed before the hashed full pathname. The @option{-l} option causes output to be displayed in a format that may be reused as input. If no arguments are given, or if only @option{-l} is supplied, information about remembered commands is printed. The return status is zero unless a @var{name} is not found or an invalid option is supplied.
es: Cada vez que se invoca @code{hash}, recuerda los nombres de ruta completos de las órdenes especificadas como argumentos @var{nombre}, de forma que no deben ser buscados en las próximas invocaciones. Las instrucciones se encuentran buscando a través de los directorios listados en @env{$PATH}. Cualquier nombre de ruta recordado previamente es descartado. La opción @option{-p} inhibe la búsqueda por ruta, y @var{nombre-de-archivo} se usa como la ubicación de @var{nombre}. La opción @option{-r} hace que el intérprete se olvide de todas las ubicaciones recordadas. La opción @option{-d} hace que el intérprete se olvide de la ubicación recordada de cada @var{nombre}. Si se proporciona la opción @option{-t}, se imprime el nombre de ruta completo al que corresponde cada @var{nombre}. Si se proporcionan múltiples argumentos @var{nombre} con @option{-t}, el @var{nombre} se imprime antes del nombre ruta completo hecho hash. La opción @option{-l} hace que la salida se muestre en un formato que puede ser reutilizado como entrada. Si no se pasan argumentos, o si solo se proporciona @option{-l}, se imprime información sobre instrucciones recordadas. El estado de retorno es cero a no ser que @var{nombre} no se encuentre o se proporcione una opción inválida.

source: Print the absolute pathname of the current working directory. If the @option{-P} option is supplied, the pathname printed will not contain symbolic links. If the @option{-L} option is supplied, the pathname printed may contain symbolic links. The return status is zero unless an error is encountered while determining the name of the current directory or an invalid option is supplied.
es: Imprime el nombre de ruta absoluto del actual directorio de trabajo. Si se proporciona la opción @option{-P}, el nombre de ruta imprimido no contendrá enlaces simbólicos. Si se proporciona la opción @option{-L}, el nombre de ruta impreso puede contener enlaces simbólicos. El estado de retorno es cero a no ser que se produzca un error mientras se determina el nombre del directorio actual o se proporcione una opción inválida.

source: readonly [-aAf] [-p] [@var{name}[=@var{value}]] @dots{}
es: readonly [-aAf] [-p] [@var{nombre}[=@var{valor}]] @dots{}
