Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Variables present in the shell's initial environment are automatically exported to child processes. The Bourne shell does not normally do this unless the variables are explicitly marked using the @code{export} command.
es: Las variables presentes en el entorno inicial del intérprete son exportadas automáticamente a procesos hijos. El Bourne shell no hace esto normalmente a no ser que las variables sean explícitamente usando la instrucción @code{export}.

source: Bash supports the @samp{+=} assignment operator, which appends to the value of the variable named on the left hand side.
es: Bash soporta el operador de asignación @samp{+=}, que añade al valor de la variable nombrada en el lado izquierdo.

source: Bash includes the @sc{posix} pattern removal @samp{%}, @samp{#}, @samp{%%} and @samp{##} expansions to remove leading or trailing substrings from variable values (@pxref{Shell Parameter Expansion}).
es: Bash incluye las expansiones de eliminación de patrones @sc{posix} @samp{%}, @samp{#}, @samp{%%} y @samp{##} para eliminar subcadenas iniciales o finales de valores de variables (@pxref{Expansión de Parámetros del Intérprete}).

source: The expansion @code{$@{#xx@}}, which returns the length of @code{$@{xx@}}, is supported (@pxref{Shell Parameter Expansion}).
es: La expansión @code{$@{#xx@}}, que devuelve la longitud de @code{$@{xx@}}, está soportada (@pxref{Expansión de Parámetros del Intérprete}).

source: The expansion @code{$@{var:}@var{offset}@code{[:}@var{length}@code{]@}}, which expands to the substring of @code{var}'s value of length @var{length}, beginning at @var{offset}, is present (@pxref{Shell Parameter Expansion}).
es: La expansión @code{$@{var:}@var{desplazamiento}@code{[:}@var{longitud}@code{]@}}, que se expande a la subcadena del valor de @code{var} de longitud @var{longitud}, empezando en @var{desplazamiento}, está presente (@pxref{Expansión de Parámetros del Intérprete}).

source: The expansion @code{$@{var/[/]}@var{pattern}@code{[/}@var{replacement}@code{]@}}, which matches @var{pattern} and replaces it with @var{replacement} in the value of @code{var}, is available (@pxref{Shell Parameter Expansion}).
es: La expansión @code{$@{var/[/]}@var{patrón}@code{[/}@var{reemplazo}@code{]@}}, que coincide con @var{patrón} y lo reemplaza por @var{reemplazo} en el valor de @code{var}, está disponible (@pxref{Expansión de Parámetros del Intérprete}).

source: The expansion @code{$@{!@var{prefix}*@}} expansion, which expands to the names of all shell variables whose names begin with @var{prefix}, is available (@pxref{Shell Parameter Expansion}).
es: La expansión @code{$@{!@var{prefijo}*@}}, que se expande a los nombres de todas las variables del intérprete cuyos nombres comienzan por @var{prefijo}, está disponible (@pxref{Expansión de Parámetros del Intérprete}).

source: Bash has @var{indirect} variable expansion using @code{$@{!word@}} (@pxref{Shell Parameter Expansion}).
es: Bash tiene expansión de variable @var{indirecta} usando @code{$@{!palabra@}} (@pxref{Expansión de Parámetros del Intérprete}).

source: Bash can expand positional parameters beyond @code{$9} using @code{$@{@var{num}@}}.
es: Bash puede expandir parámetros posicionales más allá de @code{$9} usando @code{$@{@var{num}@}}.

source: The @sc{posix} @code{$()} form of command substitution is implemented (@pxref{Command Substitution}), and preferred to the Bourne shell's @code{``} (which is also implemented for backwards compatibility).
es: Se implementa la forma @sc{posix} @code{$()} de sustitución de instrucciones (@pxref{Sustitución de Instrucciones}), y preferida al @code{``} del Bourne shell (que también se implementa para compatibilidad hacia atrás).

source: Bash has process substitution (@pxref{Process Substitution}).
es: Bash tiene sustitución de procesos (@pxref{Sustitución de Procesos}).

source: Bash automatically assigns variables that provide information about the current user (@env{UID}, @env{EUID}, and @env{GROUPS}), the current host (@env{HOSTTYPE}, @env{OSTYPE}, @env{MACHTYPE}, and @env{HOSTNAME}), and the instance of Bash that is running (@env{BASH}, @env{BASH_VERSION}, and @env{BASH_VERSINFO}). @xref{Bash Variables}, for details.
es: Bash automáticamente asigna variables que proporcionan información sobre el usuario actual (@env{UID}, @env{EUID} y @env{GROUPS}), el anfitrión actual (@env{HOSTTYPE}, @env{OSTYPE}, @env{MACHTYPE} y @env{HOSTNAME}), y la instancia de Bash que se está ejecutando (@env{BASH}, @env{BASH_VERSION}, and @env{BASH_VERSINFO}). @xref{Variables de Bash}, para detalles.

source: The @env{IFS} variable is used to split only the results of expansion, not all words (@pxref{Word Splitting}). This closes a longstanding shell security hole.
es: La variable @env{IFS} es usada para dividir solo los resultados de expansión, no todas las palabras (@pxref{División de Palabras}). Esto cierra un antiguo agujero de seguridad del intérprete.

source: The filename expansion bracket expression code uses @samp{!} and @samp{^} to negate the set of characters between the brackets. The Bourne shell uses only @samp{!}.
es: El código de la expansión de nombre de archivo usa @samp{!} y @samp{^} para negar el conjunto de caracteres entre las llaves. El Bourne shell usa solo @samp{!}.

source: Bash implements the full set of @sc{posix} filename expansion operators, including @var{character classes}, @var{equivalence classes}, and @var{collating symbols} (@pxref{Filename Expansion}).
es: Bash implementa el conjunto completo de operadores @sc{posix} de expansión de nombre de archivo, incluyendo @var{clases de caracteres}, @var{clases de equivalencia} y @var{símbolos de ordenación} (@pxref{Expansión de Nombre de Archivo}).

source: Bash implements extended pattern matching features when the @code{extglob} shell option is enabled (@pxref{Pattern Matching}).
es: Bash implementa funcionalidades extendidas de coincidencia de patrones cuando está habilitada la opción del intérprete @code{extglob} (@pxref{Coincidencia de Patrones}).

source: It is possible to have a variable and a function with the same name; @code{sh} does not separate the two name spaces.
es: Es posible tener una variable y una función con el mismo nombre; @code{sh} no separa los dos espacios de nombre.

source: Bash functions are permitted to have local variables using the @code{local} builtin, and thus useful recursive functions may be written (@pxref{Bash Builtins}).
es: Se permite a las funciones de Bash tener variables locales usando la instrucción integrada @code{local}, y así se pueden escribir funciones recursivas útiles (@pxref{Instrucciones Integradas de Bash}).

source: Variable assignments preceding commands affect only that command, even builtins and functions (@pxref{Environment}). In @code{sh}, all variable assignments preceding commands are global unless the command is executed from the file system.
es: Las asignaciones de variables que preceden a instrucciones afectan solo a esa instrucción, incluso instrucciones intérgradas y funciones (@pxref{Entorno}). En @code{sh}, todas las asignaciones de variables que preceden a instrucciones son globales a no ser que la instrucción se ejecute desde el sistema de archivos.

source: Bash performs filename expansion on filenames specified as operands to input and output redirection operators (@pxref{Redirections}).
es: Bash realiza expansión de nombre de archivo en nombres de archivos especificados como operandos para operadores de redirección de entrada y salida (@pxref{Redirecciones}).

source: Bash contains the @samp{<>} redirection operator, allowing a file to be opened for both reading and writing, and the @samp{&>} redirection operator, for directing standard output and standard error to the same file (@pxref{Redirections}).
es: Bash contiene el operador de redirección @samp{<>}, permitiendo a un archivo ser abierto tanto para lectura como escritura, y el operador de redirección @samp{&>}, para dirigir salida estándar y error estándar al mismo archivo (@pxref{Redirecciones}).

source: Bash includes the @samp{<<<} redirection operator, allowing a string to be used as the standard input to a command.
es: Bash incluye el operador de redirección @samp{<<<}, permitiendo que una cadena sea usada como la entrada estándar en una instrucción.

source: Bash implements the @samp{[n]<&@var{word}} and @samp{[n]>&@var{word}} redirection operators, which move one file descriptor to another.
es: Bash implementa los operadores de redirección @samp{[n]<&@var{palabra}} y @samp{[n]>&@var{palabra}}, que mueven un descriptor de archivo a otro.

source: Bash treats a number of filenames specially when they are used in redirection operators (@pxref{Redirections}).
es: Bash trata varios nombres de archivo de forma especial cuando son usados en operadores de redirección (@pxref{Redirecciones}).

source: Bash can open network connections to arbitrary machines and services with the redirection operators (@pxref{Redirections}).
es: Bash puede abrir conexiones de red a máquinas y servicios arbitrarios con los operadores de redirección (@pxref{Redirecciones}).

source: The @code{noclobber} option is available to avoid overwriting existing files with output redirection (@pxref{The Set Builtin}). The @samp{>|} redirection operator may be used to override @code{noclobber}.
es: La opción @code{noclobber} está disponible para evitar sobrescribir archivos existentes con la redirección de salida (@pxref{La Instrucción Integrada Set}). El operador de redirección @samp{>|} puede ser usado para sobrescribir @code{noclobber}.

source: The Bash @code{cd} and @code{pwd} builtins (@pxref{Bourne Shell Builtins}) each take @option{-L} and @option{-P} options to switch between logical and physical modes.
es: Las instrucciones integradas de Bash @code{cd} y @code{pwd} (@pxref{Instrucciones Integradas del Bourne Shell}) toman las opciones @option{-L} y @option{-P} para alternar entre los modos lógico y físico.

source: Bash allows a function to override a builtin with the same name, and provides access to that builtin's functionality within the function via the @code{builtin} and @code{command} builtins (@pxref{Bash Builtins}).
es: Bash permite a una función sobrescribir una instrucción integrada con el mismo nombre y proporciona acceso a la funcionalidad de esa instrucción integrada dentro de la función a través de las instrucciones integradas @code{builtin} y @code{command} (@pxref{Instrucciones Integradas de Bash}).

source: The @code{command} builtin allows selective disabling of functions when command lookup is performed (@pxref{Bash Builtins}).
es: La instrucción integrada @code{command} permite deshabilitar selectivamente funciones cuando se realiza la búsqueda de instrucciones (@pxref{Instrucciones Integradas de Bash}).

source: Individual builtins may be enabled or disabled using the @code{enable} builtin (@pxref{Bash Builtins}).
es: Se pueden habilitar o deshabilitar instrucciones integradas individuales usando la instrucción integrada @code{enable} (@pxref{Instrucciones Integradas de Bash}).

source: The Bash @code{exec} builtin takes additional options that allow users to control the contents of the environment passed to the executed command, and what the zeroth argument to the command is to be (@pxref{Bourne Shell Builtins}).
es: La instrucción integrada de Bash @code{exec} toma opciones adicionales que permiten a los usuarios controlar los contenidos pasados a la instrucción ejecutada, y cuál va a ser el argumento número 0 (@pxref{Instrucciones Integradas del Bourne Shell}).

source: Shell functions may be exported to children via the environment using @code{export -f} (@pxref{Shell Functions}).
es: Las funciones del intérprete pueden ser exportadas a hijos a través del entorno usando @code{export -f} (@pxref{Funciones del Intérprete}).

source: The Bash @code{export}, @code{readonly}, and @code{declare} builtins can take a @option{-f} option to act on shell functions, a @option{-p} option to display variables with various attributes set in a format that can be used as shell input, a @option{-n} option to remove various variable attributes, and @samp{name=value} arguments to set variable attributes and values simultaneously.
es: Las instrucciones integradas de Bash @code{export}, @code{readonly} y @code{declare} pueden tomar una opción @option{-f} para actuar en funciones del intérprete, una opción @option{-p} para mostrar variables con varios atributos asignados en un formato que puede ser reusado como entrada del intérprete, una opción @option{-n} para eliminar varios atributos de variable y argumentos @samp{nombre=valor} para establecer atributos y valores de variable simultáneamente.

source: The Bash @code{hash} builtin allows a name to be associated with an arbitrary filename, even when that filename cannot be found by searching the @env{$PATH}, using @samp{hash -p} (@pxref{Bourne Shell Builtins}).
es: La instrucción integrada @code{hash} de Bash permite que un nombre sea asociado con un nombre de archivo arbitrario, incluso cuando ese nombre de archivo no pueda ser encontrado buscando el @env{$PATH}, usando @samp{hash -p} (@pxref{Instrucciones Integradas del Bourne Shell}).

source: Bash includes a @code{help} builtin for quick reference to shell facilities (@pxref{Bash Builtins}).
es: Bash incluye una instrucción integrada @code{help} como referencia rápida a facilidades del intérprete (@pxref{Instrucciones Integradas de Bash}).

source: The @code{printf} builtin is available to display formatted output (@pxref{Bash Builtins}).
es: La instrucción integrada @code{printf} está disponible para mostrar salida con formato (@pxref{Instrucciones Integradas de Bash}).

source: The Bash @code{read} builtin (@pxref{Bash Builtins}) will read a line ending in @samp{\} with the @option{-r} option, and will use the @env{REPLY} variable as a default if no non-option arguments are supplied. The Bash @code{read} builtin also accepts a prompt string with the @option{-p} option and will use Readline to obtain the line when given the @option{-e} option. The @code{read} builtin also has additional options to control input: the @option{-s} option will turn off echoing of input characters as they are read, the @option{-t} option will allow @code{read} to time out if input does not arrive within a specified number of seconds, the @option{-n} option will allow reading only a specified number of characters rather than a full line, and the @option{-d} option will read until a particular character rather than newline.
es: La instrucción integrada de Bash @code{read} (@pxref{Instrucciones Integradas de Bash}) leerá una línea acabada en @samp{\} con la opción @option{-r}, y usará la variable @env{REPLY} como predeterminada si no se proporciona ningún argumento que no sea una opción. La instrucción integrada de Bash @code{read} también acepta una cadena de prompt con la opción @option{-p} y usará Readline para obtener la línea cuando se pase la opción @option{-e}. La instrucción integrada @code{read} también tiene opciones adicionales para controlar la entrada: la opción @option{-s} desactivará la impresión de caracteres cuando son leídos, la opción @option{-t} permitirá a @code{read} quedarse sin tiempo si la entrada no llega dentro de un número de segundos especificado, la opción @option{-n} permitirá leer solo un número especificado de caracteres en vez de una línea completa y la opción @option{-d} leerá hasta un carácter particular en vez de hasta nueva línea.

source: The @code{return} builtin may be used to abort execution of scripts executed with the @code{.} or @code{source} builtins (@pxref{Bourne Shell Builtins}).
es: La instrucción integrada @code{return} puede ser usada para abortar la ejecución de guiones ejecutados con las instrucciones integradas @code{.} o @code{source} (@pxref{Instrucciones Integradas del Bourne Shell}).

source: Bash includes the @code{shopt} builtin, for finer control of shell optional capabilities (@pxref{The Shopt Builtin}), and allows these options to be set and unset at shell invocation (@pxref{Invoking Bash}).
es: Bash incluye la instrucción integrada @code{shopt}, para mejor control de las capacidades opcionales de Bash (@pxref{La Instrucción Integrada Shopt}), y permite habilitar y deshabilitar estas opciones durante la llamada del intérprete (@pxref{Llamando a Bash}).

source: Bash has much more optional behavior controllable with the @code{set} builtin (@pxref{The Set Builtin}).
es: Bash tiene un comportamiento mucho más opcional controlable con la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}).

source: The @samp{-x} (@option{xtrace}) option displays commands other than simple commands when performing an execution trace (@pxref{The Set Builtin}).
es: La opción @samp{-x} (@option{xtrace}) muestra instrucciones aparte de instrucciones simples al realizar un rastreo de ejecución (@pxref{La Instrucción Integrada Set}).

source: The @code{test} builtin (@pxref{Bourne Shell Builtins}) is slightly different, as it implements the @sc{posix} algorithm, which specifies the behavior based on the number of arguments.
es: La instrucción integrada @code{test} (@pxref{Instrucciones Integradas de Bash}) es ligeramente diferente, a como implementa el algoritmo @sc{posix}, que especifica el comportamiento basado en el número de argumentos.

source: Bash includes the @code{caller} builtin, which displays the context of any active subroutine call (a shell function or a script executed with the @code{.} or @code{source} builtins). This supports the bash debugger.
es: Bash incluye la instrucción integrada @code{caller}, que muestra el contexto de cualquier llamada de subrutina activa (una función del intérprete o un guion ejecutado con las instrucciones integradas @code{.} o @code{source}). Esto soporta el depurador de Bash.

source: The @code{trap} builtin (@pxref{Bourne Shell Builtins}) allows a @code{DEBUG} pseudo-signal specification, similar to @code{EXIT}. Commands specified with a @code{DEBUG} trap are executed before every simple command, @code{for} command, @code{case} command, @code{select} command, every arithmetic @code{for} command, and before the first command executes in a shell function. The @code{DEBUG} trap is not inherited by shell functions unless the function has been given the @code{trace} attribute or the @code{functrace} option has been enabled using the @code{shopt} builtin. The @code{extdebug} shell option has additional effects on the @code{DEBUG} trap.
es: La instrucción integrada @code{trap} (@pxref{Instrucciones Integradas del Bourne Shell}) permite una especificación de pseudoseñal @code{DEBUG}, similar a @code{EXIT}. Las instrucciones especificadas con una trap @code{DEBUG} se ejecutan antes de cada instrucción simple, instrucción @code{for}, instrucción @code{case}, instrucción @code{select}, cada instrucción aritmética @code{for}, y antes de que la primera instrucción se ejecute en una función del intérprete. La trap @code{DEBUG} no es heredada por funciones del intérprete a no ser que se haya dado a la función el atributo @code{trace} o la opción @code{functrace} haya sido habilitada usando la instrucción integrada @code{shopt}. La opción del intérprete @code{extdebug} tiene efectos adicionales en la trap @code{DEBUG}.

source: The @code{trap} builtin (@pxref{Bourne Shell Builtins}) allows an @code{ERR} pseudo-signal specification, similar to @code{EXIT} and @code{DEBUG}. Commands specified with an @code{ERR} trap are executed after a simple command fails, with a few exceptions. The @code{ERR} trap is not inherited by shell functions unless the @code{-o errtrace} option to the @code{set} builtin is enabled.
es: La instrucción integrada @code{trap} (@pxref{Instrucciones Integradas del Bourne Shell}) permite una especificación de pseudoseñal @code{ERR}, similar a @code{EXIT} y @code{DEBUG}. Las instrucciones especificadas con una trap @code{ERR} se ejecutan después de que falle una instrucción simple, con unas pocas excepciones. La trap @code{ERR} no es heredada por funciones del intérprete a no ser que esté habilitada la opción @code{-o errtrace} para la instrucción integrada @code{set}.

source: The @code{trap} builtin (@pxref{Bourne Shell Builtins}) allows a @code{RETURN} pseudo-signal specification, similar to @code{EXIT} and @code{DEBUG}. Commands specified with an @code{RETURN} trap are executed before execution resumes after a shell function or a shell script executed with @code{.} or @code{source} returns. The @code{RETURN} trap is not inherited by shell functions unless the function has been given the @code{trace} attribute or the @code{functrace} option has been enabled using the @code{shopt} builtin.
es: La instrucción integrada @code{trap} (@pxref{Instrucciones Integradas del Bourne Shell}) permite una especificación de pseudoseñal @code{RETURN}, similar a @code{EXIT} y @code{DEBUG}. Las instrucciones especificadas con una trap @code{RETURN} son ejecutadas antes de que la ejecución se reanude después de que una función del intérprete o un guion del intérprete se ejecute con retornos @code{.} o @code{source}. La trap @code{RETURN} no se hereda por funciones del intérprete a no ser que se haya dado a la función el atributo @code{trace} o la opción @code{functrace} haya sido habilitada usando la instrucción integrada @code{shopt}.

source: The Bash @code{type} builtin is more extensive and gives more information about the names it finds (@pxref{Bash Builtins}).
es: La instrucción integrada @code{type} de Bash es más extensa y da más información sobre los nombres que encuentra (@pxref{Instrucciones Integradas de Bash}).

source: The Bash @code{umask} builtin permits a @option{-p} option to cause the output to be displayed in the form of a @code{umask} command that may be reused as input (@pxref{Bourne Shell Builtins}).
es: La instrucción integrada @code{umask} de Bash permite que una opción @option{-p} haga que la salida sea mostrada en la forma de la instrucción @code{umask} que pueda ser reusada como entrada (@pxref{Instrucciones Integradas del Bourne Shell}).

source: Bash implements a @code{csh}-like directory stack, and provides the @code{pushd}, @code{popd}, and @code{dirs} builtins to manipulate it (@pxref{The Directory Stack}). Bash also makes the directory stack visible as the value of the @env{DIRSTACK} shell variable.
es: Bash implementa una pila de directorios del estilo @code{csh} y proporciona las instrucciones @code{pushd}, @code{popd} y @code{dirs} para manipularla (@pxref{La Pila de Directorios}). Bash hace también visible la pila de directorios como el valor de la variable del intérprete @env{DIRSTACK}.

source: Bash interprets special backslash-escaped characters in the prompt strings when interactive (@pxref{Controlling the Prompt}).
es: Bash interpreta caracteres especiales escapados con barras invertidas en las cadenas del prompt cuando es interactivo (@pxref{Controlando el Prompt}).

source: The Bash restricted mode is more useful (@pxref{The Restricted Shell}); the SVR4.2 shell restricted mode is too limited.
es: El modo restringido de Bash es más útil (@pxref{El Intérprete Restringido}); el modo restringido del intérprete SVR4.2 es demasiado restringido.

source: The @code{disown} builtin can remove a job from the internal shell job table (@pxref{Job Control Builtins}) or suppress the sending of @code{SIGHUP} to a job when the shell exits as the result of a @code{SIGHUP}.
es: La instrucción integrada @code{disown} puede eliminar una tarea de la tabla interna de tareas del intérprete (@pxref{Instrucciones Integradas de Control de Tareas}) o suprimir el envío de @code{SIGHUP} a una tarea cuando finaliza el intérprete como el resultado de una @code{SIGHUB}.
