Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Display current Readline (@pxref{Command Line Editing}) key and function bindings, bind a key sequence to a Readline function or macro, or set a Readline variable. Each non-option argument is a command as it would appear in a Readline initialization file (@pxref{Readline Init File}), but each binding or command must be passed as a separate argument; e.g., @samp{"\C-x\C-r":re-read-init-file}.
es: Muestra las asociaciones actuales de teclas y funciones Readline (@pxref{Edición en Línea de Órdenes}), asocia una secuencia de teclas a una función o macro de Readline o establece una variable de Readline. Cada argumento que no es una opción es una instrucción tal como aparecería en un archivo de inicialización de Readline (@pxref{Archivo de Inicialización de Readline}), pero cada asociación o instrucción tiene que ser pasada como un argumento independiente; p. ej., @samp{"\C-x\C-r":re-read-init-file}.

source: Options, if supplied, have the following meanings:
es: La opciones, si se proporcionan, tienen los siguientes significados:

source: -m @var{keymap}
es: -m @var{mapa-de-teclas}

source: Use @var{keymap} as the keymap to be affected by the subsequent bindings. Acceptable @var{keymap} names are @code{emacs}, @code{emacs-standard}, @code{emacs-meta}, @code{emacs-ctlx}, @code{vi}, @code{vi-move}, @code{vi-command}, and @code{vi-insert}. @code{vi} is equivalent to @code{vi-command} (@code{vi-move} is also a synonym); @code{emacs} is equivalent to @code{emacs-standard}.
es: Usa @var{mapa-de-teclas} como el mapa de teclas afectado por las siguientes asociaciones. Son nombres aceptables de @var{mapa-de-teclas} @code{emacs}, @code{emacs-standard}, @code{emacs-meta}, @code{emacs-ctlx}, @code{vi}, @code{vi-move}, @code{vi-command} y @code{vi-insert}. @code{vi} es equivalente a @code{vi-command} (@code{vi-move} es también un sinónimo); @code{emacs} es equivalente a @code{emacs-standard}.

source: List the names of all Readline functions.
es: Lista los nombres de todas las funciones de Readline.

source: Display Readline function names and bindings in such a way that they can be used as input or in a Readline initialization file.
es: Muestra los nombres de las funciones y asociaciones de Readline de manera que puedan ser usadas como entrada o en una archivo de inicialización de Readline.

source: List current Readline function names and bindings.
es: Lista los nombres de funciones y las asociaciones de Readline.

source: Display Readline variable names and values in such a way that they can be used as input or in a Readline initialization file.
es: Muestra los nombres de variable y valores de Readline de una manera que puedan ser usados como entrada o en un archivo de inicialización de Readline.

source: List current Readline variable names and values.
es: Lista los nombres de variable y los valores actuales de Readline.

source: Display Readline key sequences bound to macros and the strings they output in such a way that they can be used as input or in a Readline initialization file.
es: Muestra la secuencia de caracteres de Readline asociada a macros y las cadenas que producen de manera que pueda ser usada como entrada o en un archivo de inicialización Readline.

source: Display Readline key sequences bound to macros and the strings they output.
es: Muestra las secuencias de teclas de Readline asociadas a macros y las cadenas que producen.

source: -f @var{filename}
es: -f @var{nombre-de-archivo}

source: Read key bindings from @var{filename}.
es: Lee asociaciones de teclas de @var{nombre-de-archivo}

source: -q @var{function}
es: -q @var{función}

source: Query about which keys invoke the named @var{function}.
es: Consulta sobre las teclas que llaman a la @var{función} nombrada.

source: -u @var{function}
es: -u @var{función}

source: Unbind all keys bound to the named @var{function}.
es: Desasocia todas las teclas asociadas a la @var{función} nombrada.

source: -r @var{keyseq}
es: -r @var{secuencia-de-teclas}

source: Remove any current binding for @var{keyseq}.
es: Elimina cualquier asociación actual para @var{secuencia-de-teclas}

source: -x @var{keyseq:shell-command}
es: -x @var{secuencia-de-teclas:instrucción-intérprete}

source: Cause @var{shell-command} to be executed whenever @var{keyseq} is entered. When @var{shell-command} is executed, the shell sets the @code{READLINE_LINE} variable to the contents of the Readline line buffer and the @code{READLINE_POINT} variable to the current location of the insertion point. If the executed command changes the value of @code{READLINE_LINE} or @code{READLINE_POINT}, those new values will be reflected in the editing state.
es: Hace que se ejecute @var{instrucción-intérprete} cada vez que se introduzca @var{secuencia-de-teclas}. Cuando se ejecuta @var{instrucción-intérprete}, el intérprete establece la variable @code{READLINE_LINE} al contenido del búfer y la variable @code{READLINE_POINT} a la ubicación actual del punto de inserción. Si la instrucción ejecutada cambia el valor de @code{READLINE_LINE} o @code{READLINE_POINT}, se reflejarán esos nuevos valores en el estado de edición.

source: List all key sequences bound to shell commands and the associated commands in a format that can be reused as input.
es: Lista todas las secuencias de teclas asociadas a instrucciones del intérprete y las instrucciones asociadas en un formato que puede ser reutilizado como entrada.

source: The return status is zero unless an invalid option is supplied or an error occurs.
es: El estado de retorno es cero a no ser que se proporcione una opción inválida u ocurra un error.

source: builtin [@var{shell-builtin} [@var{args}]]
es: builtin [@var{instrucción-integrada} [@var{paráms}]]

source: Run a shell builtin, passing it @var{args}, and return its exit status. This is useful when defining a shell function with the same name as a shell builtin, retaining the functionality of the builtin within the function. The return status is non-zero if @var{shell-builtin} is not a shell builtin command.
es: Ejecuta una instrucción integrada, pasándole @var{paráms}, y devuelve su estado de salida. Esto es útil cuando se define una función del intérprete con el mismo nombre que una función integrada del intérprete, conservando la funcionalidad de la instrucción integrada dentro de la función. El estado de retorno es distinto de cero si @var{instrucción-integrada} no es una instrucción integrada del intérprete.

source: Returns the context of any active subroutine call (a shell function or a script executed with the @code{.} or @code{source} builtins).
es: Devuelve el contexto de cualquier llamada a una subrutina activa (una instrucción del intérprete o un guion ejecutado con las instrucciones integradas @code{.} o @code{source}).

source: Without @var{expr}, @code{caller} displays the line number and source filename of the current subroutine call. If a non-negative integer is supplied as @var{expr}, @code{caller} displays the line number, subroutine name, and source file corresponding to that position in the current execution call stack. This extra information may be used, for example, to print a stack trace. The current frame is frame 0.
es: Sin @var{expr}, @code{caller} muestra el número de línea y el nombre de archivo fuente de la actual llamada de subrutina. Si se proporciona un entero negativo como @var{expr}, @code{caller} muestra el número de línea, el nombre de subrutina y el archivo fuente correspondiente a esa posición en la actual pila de llamadas de ejecución. Esta información extra puede ser usada, por ejemplo, para imprimir un volcado de pila. El marco actual es el marco 0.

source: The return value is 0 unless the shell is not executing a subroutine call or @var{expr} does not correspond to a valid position in the call stack.
es: El valor de retorno es 0 a no ser que el intérprete no esté ejecutando una llamada de subrutina o @var{expr} no corresponda a una posición válida en la pila de llamadas.

source: command [-pVv] @var{command} [@var{arguments} @dots{}]
es: command [-pVv] @var{instrucción} [@var{argumentos} @dots{}]

source: Runs @var{command} with @var{arguments} ignoring any shell function named @var{command}. Only shell builtin commands or commands found by searching the @env{PATH} are executed. If there is a shell function named @code{ls}, running @samp{command ls} within the function will execute the external command @code{ls} instead of calling the function recursively. The @option{-p} option means to use a default value for @env{PATH} that is guaranteed to find all of the standard utilities. The return status in this case is 127 if @var{command} cannot be found or an error occurred, and the exit status of @var{command} otherwise.
es: Ejecuta @var{instrucción} con @var{argumentos} ignorando cualquier instrucción del intérprete llamada @var{instrucción}. Solo se ejecutan las instrucciones integradas del intérprete o las instrucciones encontradas al inspeccionar el @env{PATH}. Si hay una instrucción del intérprete llamada @code{ls}, ejecutar @samp{command ls} dentro de la función ejecutará la instrucción externa @code{ls} en vez de llamar a la función recursivamente. La opción @option{-p} equivale a usar un valor por defecto para @env{PATH} que garantiza encontrar todas las utilidades estándares. El estado de retorno en este caso es 127 si no se puede encontrar @var{instrucción} u ocurrió un error, y el estado de salida de @var{instrucción} en caso contrario.

source: If either the @option{-V} or @option{-v} option is supplied, a description of @var{command} is printed. The @option{-v} option causes a single word indicating the command or file name used to invoke @var{command} to be displayed; the @option{-V} option produces a more verbose description. In this case, the return status is zero if @var{command} is found, and non-zero if not.
es: Si se proporciona la opción @option{-V} o la @option{-v}, se imprime una descripción de @var{instrucción}. La opción @option{-v} hace que se muestre una única palabra indicando el nombre de la instrucción o archivo utilizado para llamar a @var{instrucción}; la opción @option{-V} produce una descripción más extensa. En este caso, el estado de retorno es cero si @var{instrucción} es encontrada, y distinto a cero en si no.

source: declare [-aAfFgilnrtux] [-p] [@var{name}[=@var{value}] @dots{}]
es: declare [-aAfFgilnrtux] [-p] [@var{nombre}[=@var{valor}] @dots{}]

source: Declare variables and give them attributes. If no @var{name}s are given, then display the values of variables instead.
es: Declara variables y les da atributos. Si no se pasan @var{nombre}s, entonces muestra los valores de las variables en su lugar.

source: The @option{-p} option will display the attributes and values of each @var{name}. When @option{-p} is used with @var{name} arguments, additional options, other than @option{-f} and @option{-F}, are ignored.
es: La opción @option{-p} mostrará los atributos y valores de cada @var{nombre}. Cuando se usa la opción @option{-p} con argumentos @var{nombre}, se ignoran opciones adicionales, excepto @option{-f} y @option{-F}.

source: When @option{-p} is supplied without @var{name} arguments, @code{declare} will display the attributes and values of all variables having the attributes specified by the additional options. If no other options are supplied with @option{-p}, @code{declare} will display the attributes and values of all shell variables. The @option{-f} option will restrict the display to shell functions.
es: Cuando se proporciona @option{-p} sin argumentos @var{nombre}, @code{declare} mostrará los atributos y valores de todas las variables con los atributos especificados por las opciones adicionales. Si no se proporcionan otras opciones con @option{-p}, @code{declare} mostrará los atributos y valores de todas las variables del intérprete. La opción @option{-f} restringirá la salida a funciones del intérprete.

source: The @option{-F} option inhibits the display of function definitions; only the function name and attributes are printed. If the @code{extdebug} shell option is enabled using @code{shopt} (@pxref{The Shopt Builtin}), the source file name and line number where each @var{name} is defined are displayed as well. @option{-F} implies @option{-f}.
es: La opción @option{-F} inhibe la salida de las definiciones de funciones; solo se imprimen el nombre de función y los atributos. Si se habilita la opción del intérprete @code{extdebug} usando @code{shopt} (@pxref{La Instrucción Integrada Shopt}), se muestra también el archivo fuente y el número de línea donde cada @var{nombre} está definido. @option{-F} supone @option{-f}.

source: The @option{-g} option forces variables to be created or modified at the global scope, even when @code{declare} is executed in a shell function. It is ignored in all other cases.
es: La opción @option{-g} obliga a que las variables sean creadas o modificadas en el alcance global, incluso cuando @code{declare} es ejecutado en una función del intérprete. Es ignorada en todos los demás casos.

source: The following options can be used to restrict output to variables with the specified attributes or to give variables attributes:
es: Las siguientes opciones pueden ser usadas para restringir la salida a variables con los atributos especificados o para dar a las variables atributos:

source: Each @var{name} is an indexed array variable (@pxref{Arrays}).
es: Cada @var{nombre} es una variable de vector indexado (@pxref{Vectores}).

source: Each @var{name} is an associative array variable (@pxref{Arrays}).
es: Cada @var{nombre} es una variable de vector asociativo (@pxref{Vectores}).

source: Use function names only.
es: Usa solo nombres de función.

source: The variable is to be treated as an integer; arithmetic evaluation (@pxref{Shell Arithmetic}) is performed when the variable is assigned a value.
es: La variable será tratada como un entero; la evaluación aritmética (@pxref{Aritmética del Intérprete}) se realiza cuando se asigna un valor a la variable.

source: When the variable is assigned a value, all upper-case characters are converted to lower-case. The upper-case attribute is disabled.
es: Cuando se le asigna un valor a la variable, todos los caracteres en mayúscula son convertidos a minúscula. El atributo upper-case es deshabilitado.

source: Give each @var{name} the @var{nameref} attribute, making it a name reference to another variable. That other variable is defined by the value of @var{name}. All references, assignments, and attribute modifications to @var{name}, except for those using or changing the @option{-n} attribute itself, are performed on the variable referenced by @var{name}'s value. The nameref attribute cannot be applied to array variables.
es: Da a cada @var{nombre} el atributo @var{nameref}, convirtiéndolo en una referencia de nombre a otra variable. Esa otra variable está definida por el valor de @var{nombre}. Todas las referencias, asignaciones y modificaciones de atributo a @var{nombre}, excepto para aquellas que usan o cambian el mismo atributo @option{-n}, son realizadas en la variable referenciada por el valor @var{nombre}. El atributo nameref no puede ser aplicado a variables de vector.

source: Make @var{name}s readonly. These names cannot then be assigned values by subsequent assignment statements or unset.
es: Hace que @var{nombre}s sean de solo lectura. Después no se pueden asignar valores a estos nombres usando sentencias de asignación o eliminación.

source: Give each @var{name} the @code{trace} attribute. Traced functions inherit the @code{DEBUG} and @code{RETURN} traps from the calling shell. The trace attribute has no special meaning for variables.
es: Da a cada @var{nombre} el atributo @code{trace}. Las funciones rastreadas heredan las traps @code{DEBUG} y @code{RETURN} del intérprete ejecutor. El atributo trace no tiene ningún significado especial para variables.

source: When the variable is assigned a value, all lower-case characters are converted to upper-case. The lower-case attribute is disabled.
es: Cuando se asigna un valor a una variable, todos los caracteres en minúscula son convertidos a mayúscula. El atributo lower-case es deshabilitado.

source: Mark each @var{name} for export to subsequent commands via the environment.
es: Marca cada @var{nombre} para exportar a posteriores instrucciones mediante el entorno.

source: Using @samp{+} instead of @samp{-} turns off the attribute instead, with the exceptions that @samp{+a} and @samp{+A} may not be used to destroy array variables and @samp{+r} will not remove the readonly attribute. When used in a function, @code{declare} makes each @var{name} local, as with the @code{local} command, unless the @option{-g} option is used. If a variable name is followed by =@var{value}, the value of the variable is set to @var{value}.
es: Usar @samp{+} en vez de @samp{-} desactiva el atributo, con las excepciones de que @samp{+a} y @samp{+A} no pueden ser usados para destruir variables de vector y @samp{+r} no eliminará el atributo readonly. Cuando se usa en una función, @code{declare} hace cada @var{nombre} local, como con la instrucción @code{local}, a no ser que se use la opción @option{-g}. Si un nombre de variable es seguido de =@var{valor}, se establece el valor de la variable a @var{valor}.

source: When using @option{-a} or @option{-A} and the compound assignment syntax to create array variables, additional attributes do not take effect until subsequent assignments.
es: Cuando se usa @option{-a} o @option{-A} y la sintaxis de asignación compuesta para crear variables de vector, los atributos adicionales no tienen efecto hasta siguientes asignaciones.

source: The return status is zero unless an invalid option is encountered, an attempt is made to define a function using @samp{-f foo=bar}, an attempt is made to assign a value to a readonly variable, an attempt is made to assign a value to an array variable without using the compound assignment syntax (@pxref{Arrays}), one of the @var{names} is not a valid shell variable name, an attempt is made to turn off readonly status for a readonly variable, an attempt is made to turn off array status for an array variable, or an attempt is made to display a non-existent function with @option{-f}.
es: El estado de retorno es cero a no ser que se encuentre una opción inválida, se realice un intento para definir una función usando @samp{-f foo=bar}, se realice un intento de asignar un valor a una variable de solo lectura, se realice un intento de asignar un valor a una variable de vector sin usar la sintaxis de asignaciones compuestas (@pxref{Vectores}), uno de los @var{nombres} no sea un nombre de variable de intérprete válido, se realice un intento de desactivar el estado de solo lectura de una variable de solo lectura, se realice un intento de desactivar el estado de vector de una variable de vector o se realice un intento para mostrar una función inexistente con @option{-f}.

source: Output the @var{arg}s, separated by spaces, terminated with a newline. The return status is 0 unless a write error occurs. If @option{-n} is specified, the trailing newline is suppressed. If the @option{-e} option is given, interpretation of the following backslash-escaped characters is enabled. The @option{-E} option disables the interpretation of these escape characters, even on systems where they are interpreted by default. The @code{xpg_echo} shell option may be used to dynamically determine whether or not @code{echo} expands these escape characters by default. @code{echo} does not interpret @option{--} to mean the end of options.
es: Muestra los @var{arg}s, separados por espacios, terminado en una nueva línea. El estado de retorno es 0 a no ser que ocurra un error de escritura. Si se especifica @option{-n}, la nueva línea adicional se suprime. Si se pasa la opción @option{-e}, se habilita la interpretación de los siguientes caracteres escapados por barras invertidas. La opción @option{-E} deshabilita la interpretación de estos caracteres de escape, incluso en sistemas en los que son interpretados por defecto. La opción del intérprete @code{xpg_echo} puede ser usada para determinar dinámicamente si @code{echo} expande estos caracteres de escape por defecto o no. @code{echo} no interpreta @option{--} para indicar el final de las opciones.

source: @code{echo} interprets the following escape sequences:
es: @code{echo} interpreta las siguientes secuencias de escape:

source: suppress further output
es: suprime salida adicional

source: new line
es: nueva línea

source: the eight-bit character whose value is the octal value @var{nnn} (zero to three octal digits)
es: el carácter de ocho bits cuyo valor es el valor octal @var{nnn} (de cero a tres dígitos octales).

source: enable [-a] [-dnps] [-f @var{filename}] [@var{name} @dots{}]
es: enable [-a] [-dnps] [-f @var{nombre-de-archivo}] [@var{nombre} @dots{}]

source: Enable and disable builtin shell commands. Disabling a builtin allows a disk command which has the same name as a shell builtin to be executed without specifying a full pathname, even though the shell normally searches for builtins before disk commands. If @option{-n} is used, the @var{name}s become disabled. Otherwise @var{name}s are enabled. For example, to use the @code{test} binary found via @env{$PATH} instead of the shell builtin version, type @samp{enable -n test}.
es: Habilita y deshabilita instrucciones integradas del intérprete. Deshabilitar una instrucción integrada permite que una instrucción del disco que tiene el mismo nombre que una instrucción integrada del intérprete sea ejecutada sin especificar un nombre de ruta completo, a pesar de que el intérprete normalmente busca instrucciones integradas antes que instrucciones del disco. Si se usa @option{-n}, se deshabilitan los @var{nombre}s. De lo contrario, son habilitados @var{nombre}s. Por ejemplo, para usar el binario @code{test} encontrado a través de @env{$PATH} en vez de la versión integrada del intérprete, escribe @samp{enable -n test}.

source: If the @option{-p} option is supplied, or no @var{name} arguments appear, a list of shell builtins is printed. With no other arguments, the list consists of all enabled shell builtins. The @option{-a} option means to list each builtin with an indication of whether or not it is enabled.
es: Si se proporciona la opción @option{-p}, o no aparecen argumentos @var{nombre}, se imprime una lista de instrucciones del intérprete. Sin ningún otro argumento, la lista consta de todas las instrucciones habilitadas del intérprete. La opción @option{-a} equivale a listar cada instrucción integrada con una señal de si está o no habilitada.

source: The @option{-f} option means to load the new builtin command @var{name} from shared object @var{filename}, on systems that support dynamic loading. The @option{-d} option will delete a builtin loaded with @option{-f}.
es: La opción @option{-f} equivale a cargar la nueva instrucción integrada @var{nombre} del objeto compartido @var{nombre-de-archivo}, en sistemas que soportan carga dinámica. La opción @option{-d} borrará una instrucción integrada cargada con @option{-f}.

source: If there are no options, a list of the shell builtins is displayed. The @option{-s} option restricts @code{enable} to the @sc{posix} special builtins. If @option{-s} is used with @option{-f}, the new builtin becomes a special builtin (@pxref{Special Builtins}).
es: Si no hay opciones, se muestra una lista de todas las instrucciones integradas. La opción @option{-s} limita @code{enable} a las instrucciones integradas especiales @sc{posix}. Si @option{-s} se usa con @option{-f}, la nueva instrucción integrada se convierte en una instrucción integrada especial (@pxref{Instrucciones Integradas Especiales}).
