Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: An array variable containing the names of all shell functions currently in the execution call stack. The element with index 0 is the name of any currently-executing shell function. The bottom-most element (the one with the highest index) is @code{"main"}. This variable exists only when a shell function is executing. Assignments to @env{FUNCNAME} have no effect. If @env{FUNCNAME} is unset, it loses its special properties, even if it is subsequently reset.
es: Una variable de vector que contiene los nombres de todas las funciones del intérprete actualmente en la pila de ejecución de llamadas. El elemento con índice 0 es el nombre de cualquier función del intérprete en ejecución actualmente. El elemento más al fondo (aquel con el índice más alto) es @code{"main"}. Esta variable solo existe cuando una función del intérprete se está ejecutando. Las asignaciones a @env{FUNCNAME} no tienen efecto. Si @env{FUNCNAME} está sin asignar, pierde sus propiedades especiales, incluso si es restablecida posteriormente.

source: This variable can be used with @code{BASH_LINENO} and @code{BASH_SOURCE}. Each element of @code{FUNCNAME} has corresponding elements in @code{BASH_LINENO} and @code{BASH_SOURCE} to describe the call stack. For instance, @code{$@{FUNCNAME[$i]@}} was called from the file @code{$@{BASH_SOURCE[$i+1]@}} at line number @code{$@{BASH_LINENO[$i]@}}. The @code{caller} builtin displays the current call stack using this information.
es: Esta variable puede ser usada con @code{BASH_LINENO} y @code{BASH_SOURCE}. Cada elemento de @code{FUNCNAME} tiene elementos correspondientes en @code{BASH_LINENO} y @code{BASH_SOURCE} para describir la pila de llamadas. Por ejemplo, @code{$@{FUNCNAME[$i]@}} fue llamada del archivo @code{$@{BASH_SOURCE[$i+1]@}} en el número de línea @code{$@{BASH_LINENO[$i]@}}. La instrucción integrada @code{caller} muestra la actual pila de llamadas usando esta información.

source: If set to a numeric value greater than 0, defines a maximum function nesting level. Function invocations that exceed this nesting level will cause the current command to abort.
es: Si está asignada a un valor numérico mayor que 0, define un nivel de anidamiento de función máximo. Las llamadas de función que excedan este límite harán que se aborte la instrucción actual.

source: A colon-separated list of patterns defining the set of file names to be ignored by filename expansion. If a file name matched by a filename expansion pattern also matches one of the patterns in @env{GLOBIGNORE}, it is removed from the list of matches. The pattern matching honors the setting of the @code{extglob} shell option.
es: Una lista de patrones separada por dos puntos que define el número de nombres de archivo que deben ser ignorados por la expansión de nombre de archivo. Si un nombre de archivo coincidido por un patrón de expansión de nombre de archivo también coincide con uno de los patrones en @env{GLOBIGNORE}, es eliminado de la lista de coincidencias. Los patrones coincidentes hacen honor al ajuste de la opción del intérprete @code{extglob}.

source: An array variable containing the list of groups of which the current user is a member. Assignments to @env{GROUPS} have no effect. If @env{GROUPS} is unset, it loses its special properties, even if it is subsequently reset.
es: Una variable de vector que contiene la lista de grupos de los cuales el usuario actual es miembro. Las asignaciones a @env{GROUPS} no tienen efecto. Si @env{GROUPS} es eliminada, pierde sus propiedades especiales, incluso si es restablecida posteriormente.

source: Up to three characters which control history expansion, quick substitution, and tokenization (@pxref{History Interaction}). The first character is the @var{history expansion} character, that is, the character which signifies the start of a history expansion, normally @samp{!}. The second character is the character which signifies `quick substitution' when seen as the first character on a line, normally @samp{^}. The optional third character is the character which indicates that the remainder of the line is a comment when found as the first character of a word, usually @samp{#}. The history comment character causes history substitution to be skipped for the remaining words on the line. It does not necessarily cause the shell parser to treat the rest of the line as a comment.
es: Hasta tres caracteres que controlan la expansión de historial, sustitución rápida y simbolización (@pxref{Interacción con el Historial}). El primer carácter es el carácter de @var{expansión de historial}, es decir, el carácter que representa el inicio de una expansión de historial, normalmente @samp{!}. El segundo carácter es el carácter que representa `sustitución rápida cuando es visto como el primer carácter en la línea, normalmente @samp{^}. El tercer carácter opcional es el carácter que indica que el resto de la línea es un comentario cuando se encuentra como el primer carácter de una palabra, normalmente @samp{#}. El carácter de comentario de historial hace que sea saltada la sustitución de historial para el resto de palabras en la línea. No necesariamente hace que el analizador del intérprete trate el resto de la línea como un comentario.

source: The history number, or index in the history list, of the current command. If @env{HISTCMD} is unset, it loses its special properties, even if it is subsequently reset.
es: El número de historial, o índice en la lista de historial, de la instrucción actual. Si @env{HISTCMD} está sin asignar, pierde sus propiedades especiales, incluso si se restablece posteriormente.

source: A colon-separated list of values controlling how commands are saved on the history list. If the list of values includes @samp{ignorespace}, lines which begin with a space character are not saved in the history list. A value of @samp{ignoredups} causes lines which match the previous history entry to not be saved. A value of @samp{ignoreboth} is shorthand for @samp{ignorespace} and @samp{ignoredups}. A value of @samp{erasedups} causes all previous lines matching the current line to be removed from the history list before that line is saved. Any value not in the above list is ignored. If @env{HISTCONTROL} is unset, or does not include a valid value, all lines read by the shell parser are saved on the history list, subject to the value of @env{HISTIGNORE}. The second and subsequent lines of a multi-line compound command are not tested, and are added to the history regardless of the value of @env{HISTCONTROL}.
es: Una lista de valores separada por dos puntos que controla cómo se guardan las instrucciones en la lista de historial. Si la lista de valores incluye @samp{ignorespace}, las líneas que empiezan por un carácter de espacio no se guardan en la lista del historial. Un valor de @samp{ignoredups} hace que las líneas que coinciden con la entrada de historial anterior no sean guardadas. Un valor de @samp{ignoreboth} es una abreviatura de @samp{ignorespace} e @samp{ignoredups}. Un valor de @samp{erasedups} hace que todas las líneas anteriores que coinciden con la línea actual sean eliminadas de la lista del historial antes de que la línea sea guardada. Cualquier valor fuera de la lista anterior se ignora. Si @env{HISTCONTROL} está sin asignar o no incluye un valor válido, todas las líneas leídas por el analizador del intérprete son guardadas en la lista del historial, sujetas al valor de @env{HISTIGNORE}. La segunda y posteriores líneas de una instrucción multilínea compuesta no son probadas y se añaden al historial sin importar el valor de @env{HISTCONTROL}.

source: The name of the file to which the command history is saved. The default value is @file{~/.bash_history}.
es: El nombre del archivo al cual se guarda el historial de instrucciones. El valor predeterminado es @file{~/.bash_history}.

source: The maximum number of lines contained in the history file. When this variable is assigned a value, the history file is truncated, if necessary, to contain no more than that number of lines by removing the oldest entries. The history file is also truncated to this size after writing it when a shell exits. If the value is 0, the history file is truncated to zero size. Non-numeric values and numeric values less than zero inhibit truncation. The shell sets the default value to the value of @env{HISTSIZE} after reading any startup files.
es: El máximo número de líneas contenidas en el archivo de historial. Cuando se asigna a esta variable un valor, el archivo de historial es recortado, si es necesario, para contener no más del número de líneas eliminando las entradas más antiguas. El archivo de historial también es recortado a este tamaño después de escribirlo cuando finaliza un intérprete. Si el valor es 0, el archivo de historial se recorta a tamaño cero. Las valores no numéricos y valores numéricos menores de cero inhiben el recorte. El intérprete asigna el valor predeterminado al valor de @env{HISTSIZE} después de leer los archivos de inicialización.

source: A colon-separated list of patterns used to decide which command lines should be saved on the history list. Each pattern is anchored at the beginning of the line and must match the complete line (no implicit @samp{*} is appended). Each pattern is tested against the line after the checks specified by @env{HISTCONTROL} are applied. In addition to the normal shell pattern matching characters, @samp{&} matches the previous history line. @samp{&} may be escaped using a backslash; the backslash is removed before attempting a match. The second and subsequent lines of a multi-line compound command are not tested, and are added to the history regardless of the value of @env{HISTIGNORE}. The pattern matching honors the setting of the @code{extglob} shell option.
es: Una lista de patrones separada por dos puntos usada para decidir qué líneas de instrucción deberían guardarse en la lista del historial. Cada patrón es anclado al principio de la línea y debe coincidir con la línea completa (no se añade un @samp{*} implícito). Cada patrón se comprueba contra la línea después de que las comprobaciones especificadas por @env{HISTCONTROL} sean aplicadas. Además de los caracteres normales de coincidencia de patrones del intérprete, @samp{&} coincide con la anterior línea de historial. @samp{&} puede ser escapada usando una barra invertida; la barra invertida se elimina antes de intentar una coincidencia. La segunda y las posteriores líneas de una instrucción compuesta multilínea no son comprobadas, y se añaden al historial sin importar el valor de @env{HISTIGNORE}. El patrón que coincide hace honor al ajuste de la opción del intérprete @code{extglob}.

source: @env{HISTIGNORE} subsumes the function of @env{HISTCONTROL}. A pattern of @samp{&} is identical to @code{ignoredups}, and a pattern of @samp{[ ]*} is identical to @code{ignorespace}. Combining these two patterns, separating them with a colon, provides the functionality of @code{ignoreboth}.
es: @env{HISTIGNORE} subsume la función de @env{HISTCONTROL}. Un patrón de @samp{&} es idéntico a @code{ignoredups}, y un patrón de @samp{[ ]*} es idéntico a @code{ignorespace}. Combinar estos dos patrones, separándolos con dos puntos, proporciona la funcionalidad de @code{ignoreboth}.

source: The maximum number of commands to remember on the history list. If the value is 0, commands are not saved in the history list. Numeric values less than zero result in every command being saved on the history list (there is no limit). The shell sets the default value to 500 after reading any startup files.
es: El máximo número de instrucciones que recordar en la lista del historial. Si el valor es 0, las instrucciones no se guardan en la lista del historial. Los valores numéricos menores que cero resultan en cada instrucción guardándose en la lista del historial (no hay límite). El intérprete establece el valor predeterminado a 500 después de leer los archivos de inicio.

source: If this variable is set and not null, its value is used as a format string for @var{strftime} to print the time stamp associated with each history entry displayed by the @code{history} builtin. If this variable is set, time stamps are written to the history file so they may be preserved across shell sessions. This uses the history comment character to distinguish timestamps from other history lines.
es: Si esta variable está asignada y no es nula, su valor se usa como una cadena de formato para @var{strftime} para imprimir la marca temporal asociada con cada entrada de historial mostrada por la instrucción integrada @code{history}. Si está asignada esta variable, las marcas de tiempo se escriben al archivo de historial de forma que puedan ser preservadas entre sesiones del intérprete. Esto usa el carácter de comentario de historial para distinguir marcas de tiempo de otras líneas de historial.

source: Contains the name of a file in the same format as @file{/etc/hosts} that should be read when the shell needs to complete a hostname. The list of possible hostname completions may be changed while the shell is running; the next time hostname completion is attempted after the value is changed, Bash adds the contents of the new file to the existing list. If @env{HOSTFILE} is set, but has no value, or does not name a readable file, Bash attempts to read @file{/etc/hosts} to obtain the list of possible hostname completions. When @env{HOSTFILE} is unset, the hostname list is cleared.
es: Contiene el nombre de un archivo en el mismo formato que @file{/etc/hosts} que debería ser leído cuando el intérprete necesita completar un nombre de anfitrión. La lista de posibles compleciones de nombre de anfitrión puede ser cambiada mientra el intérprete se ejecuta; la siguiente vez que se intente la compleción de nombre de anfitrión después de que se cambie el valor, Bash añade los contenidos del nuevo archivo a la lista existente. Si @env{HOSTFILE} está asignada pero no tiene valor o no nombra un archivo legible, Bash trata de leer @file{/etc/hosts} para obtener la lista de posibles compleciones de nombre de anfitrión. Cuando @env{HOSTFILE} está sin asignar, se limpia la lista de nombre de anfitrión.

source: The name of the current host.
es: El nombre del anfitrión actual.

source: A string describing the machine Bash is running on.
es: Una cadena que describe la máquina en que se está ejecutando Bash.

source: Controls the action of the shell on receipt of an @code{EOF} character as the sole input. If set, the value denotes the number of consecutive @code{EOF} characters that can be read as the first character on an input line before the shell will exit. If the variable exists but does not have a numeric value, or has no value, then the default is 10. If the variable does not exist, then @code{EOF} signifies the end of input to the shell. This is only in effect for interactive shells.
es: Controla la acción del intérprete al recibir un carácter @code{EOF} como la única entrada. Si está asignado, el valor denota el número de caracteres @code{EOF} consecutivos que pueden ser leídos como el primer carácter de una línea de entrada antes de que finalice el intérprete. Si la variable existe pero no tiene un valor numérico, o no tiene valor, entonces el predeterminado es 10. Si la variable no existe, el @code{EOF} significa el final de la entrada para el intérprete. Esto solo está en efecto para intérpretes interactivos.

source: The name of the Readline initialization file, overriding the default of @file{~/.inputrc}.
es: El nombre del archivo de inicialización Readline, que sobrescribe el valor predeterminado de @file{~/.inputrc}.

source: If Bash finds this variable in the environment when the shell starts, it assumes that the shell is running in an Emacs shell buffer and may disable line editing depending on the value of @env{TERM}.
es: Si Bash encuentra esta variable en el entorno cuando el intérprete se inicia, asume que el intérprete está corriendo en un búfer de intérprete de Emacs y puede deshabilitar la edición de línea dependiendo del valor de @env{TERM}.

source: Used to determine the locale category for any category not specifically selected with a variable starting with @code{LC_}.
es: Usada para determinar la categoría de configuración regional para cualquier categoría no especifícamente seleccionada con una variable que empieza por @code{LC_}.

source: This variable overrides the value of @env{LANG} and any other @code{LC_} variable specifying a locale category.
es: Esta variable sobrescribe el valor de @env{LANG} y cualquier otra variable @code{LC_} que especifica una categoría de configuración regional.

source: This variable determines the collation order used when sorting the results of filename expansion, and determines the behavior of range expressions, equivalence classes, and collating sequences within filename expansion and pattern matching (@pxref{Filename Expansion}).
es: Esta variable determina la ordenación usada para ordenar los resultados de la expansión de nombre de archivo, y determina el comportamiento de las expresiones de rango, clases de equivalencia y secuencias de ordenación dentro de la expansión de nombre de archivo y coincidencia de patrones (@pxref{Expansión de Nombre de Archivo}).

source: This variable determines the interpretation of characters and the behavior of character classes within filename expansion and pattern matching (@pxref{Filename Expansion}).
es: Esta variable determina la interpretación de caracteres y el comportamiento de las clases de caracteres dentro de una expansión de nombre de archivo y coincidencia de patrones (@pxref{Expansión de Nombre de Archivo}).

source: This variable determines the locale used to translate double-quoted strings preceded by a @samp{$} (@pxref{Locale Translation}).
es: Esta variable determina la configuración regional usada para traducir cadenas entre comillas dobles precedidas por un @samp{$} (@pxref{Traducción de Localización}).

source: This variable determines the locale category used for number formatting.
es: Esta variable determina la categoría de configuración regional para el formato de números.

source: This variable determines the locale category used for data and time formatting.
es: Esta variable determina la categoría de configuración regional usada para el formato de fecha y tiempo.

source: The line number in the script or shell function currently executing.
es: El número de línea en el guion o función del intérprete actualmente en ejecución.

source: Used by the @code{select} command to determine the column length for printing selection lists. Automatically set if the @code{checkwinsize} option is enabled (@pxref{The Shopt Builtin}), or in an interactive shell upon receipt of a @code{SIGWINCH}.
es: Usada por la instrucción @code{select} para determinar la longitud de columna para imprimir listas de selección. Automáticamente asignada si la opción @code{checkwinsize} está activada (@pxref{La Instrucción Integrada Shopt}), o en un intérprete interactivo al recibir una @code{SIGWINCH}.

source: A string that fully describes the system type on which Bash is executing, in the standard @sc{gnu} @var{cpu-company-system} format.
es: Una cadena que describe completamente el tipo de sistema en que Bash está ejecutándose, en el formato estándar @sc{gnu} @var{ucp-empresa-sistema}.

source: How often (in seconds) that the shell should check for mail in the files specified in the @env{MAILPATH} or @env{MAIL} variables. The default is 60 seconds. When it is time to check for mail, the shell does so before displaying the primary prompt. If this variable is unset, or set to a value that is not a number greater than or equal to zero, the shell disables mail checking.
es: La frecuencia (en segundos) con la que el intérprete debe comprobar el correo en los archivos especificados en las variables @env{MAILPATH} o @env{MAIL}. La predeterminada es 60 segundos. Cuando es hora de comprobar el correo, el intérprete lo hace antes de mostrar el prompt primario. Si esta variable está sin asignar o asignada a un valor que no es un número mayor o igual a cero, el intérprete deshabilita la comprobación de correo.

source: An array variable created to hold the text read by the @code{mapfile} builtin when no variable name is supplied.
es: Una variable de vector creada para contener el texto leído por la instrucción integrada @code{mapfile} cuando no se proporciona nombre de variable.

source: The previous working directory as set by the @code{cd} builtin.
es: El directorio de trabajo anterior según se establece por la instrucción integrada @code{cd}.

source: If set to the value 1, Bash displays error messages generated by the @code{getopts} builtin command.
es: Si asignada al valor 1, Bash muestra mensajes de error generados por la instrucción integrada @code{getopts}.

source: A string describing the operating system Bash is running on.
es: Una cadena que describe el sistema operativo en que Bash se está ejecutando.

source: An array variable (@pxref{Arrays}) containing a list of exit status values from the processes in the most-recently-executed foreground pipeline (which may contain only a single command).
es: Una variable de vector (@pxref{Vectores}) que contiene una lista de los valores de estado de salida de los procesos en la tubería en primer plano más recientemente ejecutada (que podría contener una sola instrucción).

source: If this variable is in the environment when Bash starts, the shell enters @sc{posix} mode (@pxref{Bash POSIX Mode}) before reading the startup files, as if the @option{--posix} invocation option had been supplied. If it is set while the shell is running, Bash enables @sc{posix} mode, as if the command
es: Si esta variable está en el entorno cuando Bash se inicia, el intérprete entra al modo @sc{posix} (@pxref{Modo POSIX de Bash}) antes de leer los archivos de inicio, como si se hubiera proporcionado la opción de llamada @option{--posix}. Si se asigna cuando el intérprete está en ejecución, Bash activa el modo @sc{posix}, como si la instrucción

source: had been executed. When the shell enters @sc{posix} mode, it sets this variable if it was not already set.
es: hubiera sido ejecutada. Cuando el intérprete entra en modo @sc{posix} asigna la variable si no a sido aún asignada.

source: The process @sc{id} of the shell's parent process. This variable is readonly.
es: El @sc{id} de proceso del proceso padre del intérprete. Esta variable es de solo lectura.

source: If set, the value is interpreted as a command to execute before the printing of each primary prompt (@env{$PS1}).
es: Si está asignada, el valor se interpreta como una instrucción que ejecutar antes de imprimir cada prompt primario (@env{$PS1}).

source: If set to a number greater than zero, the value is used as the number of trailing directory components to retain when expanding the @code{\w} and @code{\W} prompt string escapes (@pxref{Controlling the Prompt}). Characters removed are replaced with an ellipsis.
es: Si está asignada a un número mayor que cero, el valor se usa como el número de componentes finales de directorio que retener al expandir las cadenas de escape de prompt @code{\w} y @code{\W} (@pxref{Controlando el Prompt}). Los caracteres eliminados son reemplazados por puntos suspensivos.

source: The value of this parameter is expanded like @var{PS1} and displayed by interactive shells after reading a command and before the command is executed.
es: El valor de este parámetro es expandido como @var{PS1} y mostrado por intérpretes interactivos después de leer una instrucción y antes de que la instrucción sea ejecutada.
