Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Mark each @var{name} as readonly. The values of these names may not be changed by subsequent assignment. If the @option{-f} option is supplied, each @var{name} refers to a shell function. The @option{-a} option means each @var{name} refers to an indexed array variable; the @option{-A} option means each @var{name} refers to an associative array variable. If both options are supplied, @option{-A} takes precedence. If no @var{name} arguments are given, or if the @option{-p} option is supplied, a list of all readonly names is printed. The other options may be used to restrict the output to a subset of the set of readonly names. The @option{-p} option causes output to be displayed in a format that may be reused as input. If a variable name is followed by =@var{value}, the value of the variable is set to @var{value}. The return status is zero unless an invalid option is supplied, one of the @var{name} arguments is not a valid shell variable or function name, or the @option{-f} option is supplied with a name that is not a shell function.
es: Marca cada @var{nombre} como de solo lectura. Los valores de estos nombres no pueden ser cambiados en asignaciones posteriores. Si se proporciona la opción @option{-f}, cada @var{nombre} se refiere a una función del intérprete. La opción @option{-a} significa que cada @var{nombre} se refiere a una variable del tipo vector indexado; la opción @option{-A} significa que cada @var{nombre} se refiere a una variable del tipo vector asociativo. Si se proporcionan ambas opciones, @option{-A} tiene precedencia. Si no se pasan argumentos @var{nombre}, o si se proporciona la opción @option{-p}, se imprime una lista de todos los nombres de solo lectura. Las otras opciones pueden ser usadas para restringir la salida a un subconjunto de los nombres de solo lectura. La opción @option{-p} hace que la salida sea mostrada en un formato que puede ser reutilizado como entrada. Si nombre de variable está seguido de =@var{valor}, el valor de la variable se establece a @var{valor}. El estado de retorno es cero a no ser que se proporcione una opción inválida, uno de los argumentos @var{nombre} no sea un nombre válido de variable de intérprete o de función o la opción @option{-f} se proporcione con un nombre que no sea una función del intérprete.

source: Cause a shell function to stop executing and return the value @var{n} to its caller. If @var{n} is not supplied, the return value is the exit status of the last command executed in the function. If @code{return} is executed by a trap handler, the last command used to determine the status is the last command executed before the trap handler. If @code{return} is executed during a @code{DEBUG} trap, the last command used to determine the status is the last command executed by the trap handler before @code{return} was invoked. @code{return} may also be used to terminate execution of a script being executed with the @code{.} (@code{source}) builtin, returning either @var{n} or the exit status of the last command executed within the script as the exit status of the script. If @var{n} is supplied, the return value is its least significant 8 bits. Any command associated with the @code{RETURN} trap is executed before execution resumes after the function or script. The return status is non-zero if @code{return} is supplied a non-numeric argument or is used outside a function and not during the execution of a script by @code{.} or @code{source}.
es: Hace que una función del intérprete se deje de ejecutar y devuelva el valor @var{n} a su ejecutor. Si no se proporciona @var{n}, el valor de retorno es el estado de salida de la última instrucción ejecutada en la función. Si @code{return} es ejecutado por un manejador trap, la última instrucción usada para determinar el estado es la última instrucción ejecutada antes del manejador trap. Si se ejecuta @code{return} durante una trap del tipo @code{DEBUG}, la última instruccion usada para determinar el estado es la última instrucción ejecutada por el manejador trap antes de que @code{return} fuera invocado. @code{return} puede ser usado también para terminar la ejecución de un guion que está siendo ejecutado con la función integrada @code{.} (@code{source}), devolviendo o @var{n} o el estado de salida de la última instrucción ejecutada dentro del guion como el estado de salida del guion. Si se proporciona @var{n}, el valor de retorno es sus 8 bits menos significativos. Cualquier instrucción asociada a la trap @code{RETURN} es ejecutada antes de que se reanude la ejecución tras la función o el guion. El estado de retorno es distinto a cero si @code{return} es proporcionado como un argumento no número o es usado fuera de una función y no durante la ejecución de un guion por @code{.} o @code{source}.

source: Shift the positional parameters to the left by @var{n}. The positional parameters from @var{n}+1 @dots{} @code{$#} are renamed to @code{$1} @dots{} @code{$#}-@var{n}. Parameters represented by the numbers @code{$#} to @code{$#}-@var{n}+1 are unset. @var{n} must be a non-negative number less than or equal to @code{$#}. If @var{n} is zero or greater than @code{$#}, the positional parameters are not changed. If @var{n} is not supplied, it is assumed to be 1. The return status is zero unless @var{n} is greater than @code{$#} or less than zero, non-zero otherwise.
es: Mueve los argumentos posicionales a la izquierda por @var{n}. Los argumentos posicionales de @var{n}+1 @dots{} @code{$#} son renombrados a @code{$1} @dots{} @code{$#}-@var{n}. Los argumentos representados por los números @code{$#} a @code{$#}-@var{n}+1 son eliminados. @var{n} tiene que ser un número no negativo menor o igual a @code{$#}. Si @var{n} es cero o mayor que @code{$#}, los argumentos posicionales no se cambian. Si no se proporciona @var{n}, se asume que es 1. El código de retorno es cero a no ser que @var{n} sea mayor que @code{$#} o menor que cero, distinto de cero de no ser así.

source: Evaluate a conditional expression @var{expr} and return a status of 0 (true) or 1 (false). Each operator and operand must be a separate argument. Expressions are composed of the primaries described below in @ref{Bash Conditional Expressions}. @code{test} does not accept any options, nor does it accept and ignore an argument of @option{--} as signifying the end of options.
es: Evalúa una expresión condicional @var{expr} y devuelve un estado de 0 (verdadero) o 1 (falso). Cada operador y operando debe ser un argumento separado. Las expresiones están compuestas de las opciones primarias descritas más abajo en @ref{Expresiones Condicionales de Bash}. @code{test} no acepta ninguna opción, tampoco acepta e ignora un argumento de @option{--} como el significado del fin de las opciones.

source: When the @code{[} form is used, the last argument to the command must be a @code{]}.
es: Cuando se usa la forma @code{[}, el último argumento de la instrucción debe ser un @code{]}.

source: Expressions may be combined using the following operators, listed in decreasing order of precedence. The evaluation depends on the number of arguments; see below. Operator precedence is used when there are five or more arguments.
es: Las expresiones pueden ser combinadas usando los siguientes operadores, listados en orden descendente de precedencia. La evaluación depende del número de argumentos; consulta más abajo. La precedencia de operador se usa cuando hay cinco o más argumentos.

source: True if @var{expr} is false.
es: Verdadero si @var{expr} es falso.

source: Returns the value of @var{expr}. This may be used to override the normal precedence of operators.
es: Devuelve el valor de @var{expr}. Esto puede ser usado para sobreescribir la precedencia normal de operadores.

source: True if both @var{expr1} and @var{expr2} are true.
es: Verdadero si tanto @var{expr1} y @var{expr2} son verdadero.

source: True if either @var{expr1} or @var{expr2} is true.
es: Verdadero si @var{expr1} o @var{expr2} es verdadero.

source: The @code{test} and @code{[} builtins evaluate conditional expressions using a set of rules based on the number of arguments.
es: Las instrucciones internas @code{test} y @code{[} evalúan expresiones condicionales usando un conjunto de reglas basado en el número de argumentos.

source: 0 arguments
es: 0 argumentos

source: The expression is false.
es: La expresión es falsa.

source: 1 argument
es: 1 argumento

source: The expression is true if, and only if, the argument is not null.
es: La expresión es verdadera solo si el argumento no es nulo.

source: 2 arguments
es: 2 argumentos

source: If the first argument is @samp{!}, the expression is true if and only if the second argument is null. If the first argument is one of the unary conditional operators (@pxref{Bash Conditional Expressions}), the expression is true if the unary test is true. If the first argument is not a valid unary operator, the expression is false.
es: Si el primer argumento es @samp{!}, la expresión es verdadera solamente si el segundo argumento es nulo. Si el primer argumento es uno de los operadores condicionales unarios (@pxref{Expresiones Condicionales de Bash}), la expresión es verdadera si la comprobación unaria es verdadera. Si el primer argumento no es un operador unario válido, la expresión es falsa.

source: 3 arguments
es: 3 argumentos

source: The following conditions are applied in the order listed.
es: Las siguientes condiciones se aplican en el orden listado.

source: If the second argument is one of the binary conditional operators (@pxref{Bash Conditional Expressions}), the result of the expression is the result of the binary test using the first and third arguments as operands. The @samp{-a} and @samp{-o} operators are considered binary operators when there are three arguments.
es: Si el segundo argumento es alguno de los operadores binarios condicionales (@pxref{Expresiones Condicionales de Bash}), el resultado de la expresión es el resultado de la comprobación binaria que usa el primer argumento y el tercero como operadores. Los operadores @samp{-a} y @samp{-o} son considerados operadores binarios cuando hay tres argumentos.

source: If the first argument is @samp{!}, the value is the negation of the two-argument test using the second and third arguments.
es: Si el primer argumento es @samp{!}, el valor es la negación de la comprobación de dos argumentos usando el segundo argumento y el tercero.

source: If the first argument is exactly @samp{(} and the third argument is exactly @samp{)}, the result is the one-argument test of the second argument.
es: Si el primer argumento es exactamente @samp{(} y el tercer argumento es exactamente @samp{)}, el resultado es la comprobación de un argumento del segundo argumento.

source: Otherwise, the expression is false.
es: De lo contrario, la expresión es falsa.

source: 4 arguments
es: 4 argumentos

source: If the first argument is @samp{!}, the result is the negation of the three-argument expression composed of the remaining arguments. Otherwise, the expression is parsed and evaluated according to precedence using the rules listed above.
es: Si el primer argumento es @samp{!}, el resultado es la negación de la expresión de tres argumentos compuesta de los argumentos restantes. De lo contrario, la expresión es analizada y evaluada según la precedencia usando las reglas listadas anteriormente.

source: 5 or more arguments
es: 5 o más argumentos

source: The expression is parsed and evaluated according to precedence using the rules listed above.
es: La expresión es analizada y evaluada según la precedencia usando las reglas listadas anteriormente.

source: When used with @code{test} or @samp{[}, the @samp{<} and @samp{>} operators sort lexicographically using ASCII ordering.
es: Cuando se usa con @code{test} o @samp{[}, los operadores @samp{<} y @samp{>} ordenan lexicográficamente usando el orden ASCII.

source: Print out the user and system times used by the shell and its children. The return status is zero.
es: Imprime los tiempos de usuario y de sistema usados por el intérprete y sus hijos. El estado de retorno es cero.

source: trap [-lp] [@var{arg}] [@var{sigspec} @dots{}]
es: trap [-lp] [@var{arg}] [@var{id_señal} @dots{}]

source: The commands in @var{arg} are to be read and executed when the shell receives signal @var{sigspec}. If @var{arg} is absent (and there is a single @var{sigspec}) or equal to @samp{-}, each specified signal's disposition is reset to the value it had when the shell was started. If @var{arg} is the null string, then the signal specified by each @var{sigspec} is ignored by the shell and commands it invokes. If @var{arg} is not present and @option{-p} has been supplied, the shell displays the trap commands associated with each @var{sigspec}. If no arguments are supplied, or only @option{-p} is given, @code{trap} prints the list of commands associated with each signal number in a form that may be reused as shell input. The @option{-l} option causes the shell to print a list of signal names and their corresponding numbers. Each @var{sigspec} is either a signal name or a signal number. Signal names are case insensitive and the @code{SIG} prefix is optional.
es: Las instrucciones en @var{arg} están pensadas para ser leídas y ejecutadas cuando el intérprete recibe la señal @var{id_señal}. Si falta @var{parám} (y hay una señal @var{id_señal}) o es igual a @samp{-}, cada disposición de señal especificada es restablecida al valor que tenía cuando el intérprete fue iniciado. Si @var{arg} es la cadena nula, se ignora la señal especificada por cada @var{id_señal} y las instrucciones que ejecuta. Si @var{arg} no está presente y @option{-p} ha sido proporcionado, el intérprete muestra las instrucciones trap asociadas con cada @var{id_señal}. Si no se proporcionan argumentos, o solo se proporciona @option{-p}, @code{trap} imprime la lista de instrucciones asociadas con cada número de señal en una forma que puede ser reusada como entrada para el intérprete. La opción @option{-l} hace que el intérprete imprima una lista de nombres de señales y sus números correspondientes. Cada @var{id_señal} es o bien un nombre de señal o un número de señal. Los nombres de señales no distinguen entre mayúsculas y minúsculas y el prefijo @code{SIG} es opcional.

source: If a @var{sigspec} is @code{0} or @code{EXIT}, @var{arg} is executed when the shell exits. If a @var{sigspec} is @code{DEBUG}, the command @var{arg} is executed before every simple command, @code{for} command, @code{case} command, @code{select} command, every arithmetic @code{for} command, and before the first command executes in a shell function. Refer to the description of the @code{extdebug} option to the @code{shopt} builtin (@pxref{The Shopt Builtin}) for details of its effect on the @code{DEBUG} trap. If a @var{sigspec} is @code{RETURN}, the command @var{arg} is executed each time a shell function or a script executed with the @code{.} or @code{source} builtins finishes executing.
es: Si una @var{id_señal} es @code{0} o @code{EXIT}, @var{arg} se ejecuta cuando el intérprete se cierra. Si un @var{id_señal} es @code{DEBUG}, se ejecuta la instrucción @var{arg} antes de cada instrucción simple, instrucción @code{for}, instrucción @code{case}, instrucción @code{select}, cada instrucción @code{for} aritmética y antes de que se ejecute la primera instrucción en una función del intérprete. Consulte la descripción de la opción @code{extdebug} de la instrucción integrada @code{shopt} (@pxref{La Instrucción Integrada Shopt}) para encontrar detalles de su efecto sobre la trap @code{DEBUG}. Si un @var{id_señal} es @code{RETURN}, la instrucción @var{arg} se ejecuta cada vez que una instrucción del intérprete o un guion ejecutado con las instrucciones integradas @code{.} o @code{source} terminan de ejecutarse.

source: If a @var{sigspec} is @code{ERR}, the command @var{arg} is executed whenever a pipeline (which may consist of a single simple command), a list, or a compound command returns a non-zero exit status, subject to the following conditions. The @code{ERR} trap is not executed if the failed command is part of the command list immediately following an @code{until} or @code{while} keyword, part of the test following the @code{if} or @code{elif} reserved words, part of a command executed in a @code{&&} or @code{||} list except the command following the final @code{&&} or @code{||}, any command in a pipeline but the last, or if the command's return status is being inverted using @code{!}. These are the same conditions obeyed by the @code{errexit} (@option{-e}) option.
es: Si el @var{sigspec} es @code{ERR}, la instrucción @var{arg} se ejecuta cada vez que una tubería (que puede consistir de una única instrucción simple), una lista o una instrucción compuesta devuelve un estado diferente de cero, de acuerdo a las siguientes condiciones. El trap @code{ERR} no es ejecutado si la instrucción fallida es parte de la lista de instrucciones inmediatamente después de una palabra clave @code{until} o @code{while}, parte de la condición que sigue a las palabras reservadas @code{if} o @code{elif}, parte de una instrucción ejecutada en una lista @code{&&} o @code{||} excepto la instrucción que sigue al último @code{&&} o @code{||}, cualquier instrucción en una tubería excepto la última o si el estado de retorno de la instrucción está siendo invertido usando @code{!}. Estas son las mismas condiciones cumplidas por la opción @code{errexit} (@option{-e}).

source: Signals ignored upon entry to the shell cannot be trapped or reset. Trapped signals that are not being ignored are reset to their original values in a subshell or subshell environment when one is created.
es: Las señales ignoradas en la entrada al intérprete no pueden ser atrapadas o eliminadas. Las señales atrapadas que no están siendo ignoradas son restablecidas a sus valores originales en un subintérprete o un entorno de subintérprete cuando se crea una.

source: The return status is zero unless a @var{sigspec} does not specify a valid signal.
es: El estado de retorno es cero a no ser que @var{sigspec} no especifique una señal válida.

source: umask [-p] [-S] [@var{mode}]
es: umask [-p] [-S] [@var{modo}]

source: Set the shell process's file creation mask to @var{mode}. If @var{mode} begins with a digit, it is interpreted as an octal number; if not, it is interpreted as a symbolic mode mask similar to that accepted by the @code{chmod} command. If @var{mode} is omitted, the current value of the mask is printed. If the @option{-S} option is supplied without a @var{mode} argument, the mask is printed in a symbolic format. If the @option{-p} option is supplied, and @var{mode} is omitted, the output is in a form that may be reused as input. The return status is zero if the mode is successfully changed or if no @var{mode} argument is supplied, and non-zero otherwise.
es: Establece el proceso del intérprete de la máscara de creación de archivos a @var{modo}. Si @var{modo} comienza por un dígito, es interpretado como un número octal; si no, es interpretado como una máscara de modo simbólico similar a la aceptada por la instrucción @code{chmod}. Si se omite @var{modo}, se imprime el valor actual de la máscara. Si se proporciona la opción @option{-S} sin un argumento @var{modo}, la máscara se imprime en un formato simbólico. Si se proporciona la opción @option{-p}, y se omite @var{modo}, la salida es de forma que puede reusarse como entrada. El estado de retorno es cero si el modo se cambia exitosamente o si no se proporciona un argumento @var{modo}, y distinto a cero de no ser así.

source: Note that when the mode is interpreted as an octal number, each number of the umask is subtracted from @code{7}. Thus, a umask of @code{022} results in permissions of @code{755}.
es: Ten en cuenta que cuando el modo es interpretado como un número octal, cada número de umask es restado de @code{7}. Así, un umask de @code{022} resulta en permisos de @code{755}.

source: unset [-fnv] [@var{name}]
es: unset [-fnv] [@var{nombre}]

source: Remove each variable or function @var{name}. If the @option{-v} option is given, each @var{name} refers to a shell variable and that variable is removed. If the @option{-f} option is given, the @var{name}s refer to shell functions, and the function definition is removed. If the @option{-n} option is supplied, and @var{name} is a variable with the @var{nameref} attribute, @var{name} will be unset rather than the variable it references. @option{-n} has no effect if the @option{-f} option is supplied. If no options are supplied, each @var{name} refers to a variable; if there is no variable by that name, any function with that name is unset. Readonly variables and functions may not be unset. The return status is zero unless a @var{name} is readonly.
es: Elimina cada variable o función @var{nombre}. Si se pasa la opción @option{-v}, cada @var{nombre} se refiere a una variable del intérprete, y esa variable se elimina. Si se pasa la opción @option{-f}, los @var{nombre}s se refieren a funciones del intérprete, y se elimina la definición de la función. Si se proporciona la opción @option{-n}, y @var{nombre} es una variable con el atributo @var{nameref}, @var{nombre} se eliminará en vez de la variable a la que hace referencia. @option{-n} no tiene efecto si se proporciona la opción @option{-f}. Si no se proporcionan opciones, cada @var{nombre} se refiere a una variable; si no haya variable con ese nombre, cualquier función con ese nombre se elimina. Las variables y funciones de solo lectura no pueden ser eliminadas. El estado de retorno es cero a no ser que @var{nombre} sea de solo lectura.

source: Bash Builtin Commands
es: Instrucciones Integradas de Bash

source: This section describes builtin commands which are unique to or have been extended in Bash. Some of these commands are specified in the @sc{posix} standard.
es: Esta sección describe las instrucciones integradas que son únicas de o han sido extendidas en Bash. Algunas de estas instrucciones son especificadas en el estándar @sc{posix}.

source: alias [-p] [@var{name}[=@var{value}] @dots{}]
es: alias [-p] [@var{nombre}[=@var{valor}] @dots{}]

source: Without arguments or with the @option{-p} option, @code{alias} prints the list of aliases on the standard output in a form that allows them to be reused as input. If arguments are supplied, an alias is defined for each @var{name} whose @var{value} is given. If no @var{value} is given, the name and value of the alias is printed. Aliases are described in @ref{Aliases}.
es: Sin argumentos o con la opción @option{-p}, @code{alias} imprime la lista de aliases en la salida estándar en una forma que permite que sean reutilizados como entrada. Si se proporcionan argumentos, se define un alias por cada @var{nombre} cuyo @var{valor} sea especificado. Si no se pasa un @var{valor}, se imprime el nombre y el valor del alias. Los aliases se describen en @ref{Aliases}

source: bind [-m @var{keymap}] [-lpsvPSVX] bind [-m @var{keymap}] [-q @var{function}] [-u @var{function}] [-r @var{keyseq}] bind [-m @var{keymap}] -f @var{filename} bind [-m @var{keymap}] -x @var{keyseq:shell-command} bind [-m @var{keymap}] @var{keyseq:function-name} bind [-m @var{keymap}] @var{keyseq:readline-command}
es: bind [-m @var{mapa-de-teclas}] [-lpsvPSVX] bind [-m @var{mapa-de-teclas}] [-q @var{función}] [-u @var{función}] [-r @var{secuencia-de-teclas}] bind [-m @var{mapa-de-teclas}] -f @var{nombre-archivo} bind [-m @var{mapa-de-teclas}] -x @var{secuencia-de-teclas:instrucción-de-intérprete} bind [-m @var{mapa-de-teclas}] @var{secuencia-de-teclas:nombre-función} bind [-m @var{mapa-de-teclas}] @var{secuencia-de-teclas:instrucción-readline}
