Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: The return status is zero unless a @var{name} is not a shell builtin or there is an error loading a new builtin from a shared object.
es: El estado de retorno es cero a no ser que @var{nombre} no sea una instrucción integrada del intérprete o haya un error cargando una nueva instrucción integrada de un objeto compartido.

source: help [-dms] [@var{pattern}]
es: help [-dms] [@var{patrón}]

source: Display helpful information about builtin commands. If @var{pattern} is specified, @code{help} gives detailed help on all commands matching @var{pattern}, otherwise a list of the builtins is printed.
es: Muestra información útil sobre instrucciones integradas. Si se especifica @var{patrón}, @code{help} muestra información detallada sobre todas las instrucciones que coincidan con @var{patrón}, sino se imprime una lista de las instrucciones integradas.

source: Display a short description of each @var{pattern}
es: Muestra una descripción corta de cada @var{patrón}

source: Display the description of each @var{pattern} in a manpage-like format
es: Muestra la descripción de cada @var{patrón} en un formato tipo página-man

source: Display only a short usage synopsis for each @var{pattern}
es: Muestra solo un resumen de uso corto por cada @var{patrón}

source: The return status is zero unless no command matches @var{pattern}.
es: El estado de retorno es cero a no ser que ninguna instrucción coincida con @var{patrón}.

source: let @var{expression} [@var{expression} @dots{}]
es: let @var{expression} [@var{expresión} @dots{}]

source: The @code{let} builtin allows arithmetic to be performed on shell variables. Each @var{expression} is evaluated according to the rules given below in @ref{Shell Arithmetic}. If the last @var{expression} evaluates to 0, @code{let} returns 1; otherwise 0 is returned.
es: La instrucción integrada @code{let} permite realizar operaciones aritméticas en variables del intérprete. Cada @var{expresión} se evalúa de acuerdo a las reglas detalladas adelante en @ref{Aritmética del Intérprete}. Si la última @var{expresión} evalúa a 0, @code{let} devuelve 1; de lo contrario, devuelve cero.

source: local [@var{option}] @var{name}[=@var{value}] @dots{}
es: local [@var{opción}] @var{nombre}[=@var{valor}] @dots{}

source: For each argument, a local variable named @var{name} is created, and assigned @var{value}. The @var{option} can be any of the options accepted by @code{declare}. @code{local} can only be used within a function; it makes the variable @var{name} have a visible scope restricted to that function and its children. If @var{name} is @samp{-}, the set of shell options is made local to the function in which @code{local} is invoked: shell options changed using the @code{set} builtin inside the function are restored to their original values when the function returns. The return status is zero unless @code{local} is used outside a function, an invalid @var{name} is supplied, or @var{name} is a readonly variable.
es: Por cada argumento, se crea una variable local llamada @var{nombre}, y se le asigna @var{valor}. La @var{opción} puede ser cualquiera de las opciones aceptadas por @code{declare}. @code{local} solo puede ser usado dentro de una función; hace que la variable @var{nombre} tenga un alcance de visibilidad restringido a esa función y a sus hijos. Si @var{nombre} es @samp{-}, el conjunto de las opciones del intérprete se hace local a la función en la que @code{local} es llamado: las opciones del intérprete cambiadas usando la instrucción integrada @code{set} dentro de la función son restablecidas a sus valores originales cuando la función retorna. El estado de retorno es cero a no ser que @code{local} se use fuera de una función, se proporcione un @var{nombre} inválido o @var{nombre} sea una variable de solo lectura.

source: Exit a login shell, returning a status of @var{n} to the shell's parent.
es: Sale de un intérprete de acceso, devolviendo un estado de @var{n} al padre del intérprete.

source: mapfile [-d @var{delim}] [-n @var{count}] [-O @var{origin}] [-s @var{count}] [-t] [-u @var{fd}] [-C @var{callback}] [-c @var{quantum}] [@var{array}]
es: mapfile [-d @var{delim}] [-n @var{cuenta}] [-O @var{origen}] [-s @var{cuenta}] [-t] [-u @var{da}] [-C @var{retrollamada}] [-c @var{cuantía}] [@var{vector}]

source: Read lines from the standard input into the indexed array variable @var{array}, or from file descriptor @var{fd} if the @option{-u} option is supplied. The variable @code{MAPFILE} is the default @var{array}. Options, if supplied, have the following meanings:
es: Lee líneas de la entrada estándar en la variable de vector indexado @var{vector}, o del descriptor de archivo @var{da} si se proporciona la opción @option{-u}. La variable @code{MAPFILE} es el @var{vector} predeterminado. Si se proporcionan, las opciones tienen el siguiente significado:

source: The first character of @var{delim} is used to terminate each input line, rather than newline. If @var{delim} is the empty string, @code{mapfile} will terminate a line when it reads a NUL character.
es: Se usa el primer carácter de @var{delim} para terminar cada línea de entrada, en vez de nueva línea. Si @var{delim} es la cadena vac@'ia, @code{mapfile} terminará una l@'inea cuando lea un carácter NUL.

source: Copy at most @var{count} lines. If @var{count} is 0, all lines are copied.
es: Copia como máximo @var{cuenta} líneas. Si @var{cuenta} es 0, se copian todas las líneas.

source: Begin assigning to @var{array} at index @var{origin}. The default index is 0.
es: Empieza asignando a @var{vector} en el índice @var{origen}. El índice predeterminado es 0.

source: Discard the first @var{count} lines read.
es: Descarta las primeras @var{cuenta} líneas leídas.

source: Remove a trailing @var{delim} (default newline) from each line read.
es: Elimina un @var{delim} al final (nueva línea predeterminada) de cada línea leída.

source: Read lines from file descriptor @var{fd} instead of the standard input.
es: La líneas son leídas del descriptor de archivo @var{da} en vez de la entrada estándar.

source: Evaluate @var{callback} each time @var{quantum} lines are read. The @option{-c} option specifies @var{quantum}.
es: Evalúa @var{retrollamada} cada vez que @var{cuantía} líneas son leídas. La opción @option{-c} especifica @var{cuantía}.

source: Specify the number of lines read between each call to @var{callback}.
es: Especifica el número de líneas leídas entre cada llamada a @var{retrollamada}.

source: If @option{-C} is specified without @option{-c}, the default quantum is 5000. When @var{callback} is evaluated, it is supplied the index of the next array element to be assigned and the line to be assigned to that element as additional arguments. @var{callback} is evaluated after the line is read but before the array element is assigned.
es: Si @option{-C} se proporciona sin @option{-c}, la cuantía por defecto es 5000. Cuando se evalúa @var{retrollamada}, es proporcionado el índice del siguiente elemento vector a ser asignado y la línea a ser asignada a ese elemento como argumentos adicionales. @var{retrollamada} se evalúa después de que la línea sea leída, pero antes de que el elemento vector sea asignado.

source: If not supplied with an explicit origin, @code{mapfile} will clear @var{array} before assigning to it.
es: Si no se proporciona con un origen explícito, @code{mapfile} liberará el @var{vector} antes de asignar a él.

source: @code{mapfile} returns successfully unless an invalid option or option argument is supplied, @var{array} is invalid or unassignable, or @var{array} is not an indexed array.
es: @code{mapfile} retorna exitosamente a no ser que se proporcione una opción inválida, @var{vector} sea inválido o inasignable o @var{vector} no sea un vector indexado.

source: printf [-v @var{var}] @var{format} [@var{arguments}]
es: printf [-v @var{var}] @var{formato} [@var{argumentos}]

source: Write the formatted @var{arguments} to the standard output under the control of the @var{format}. The @option{-v} option causes the output to be assigned to the variable @var{var} rather than being printed to the standard output.
es: Escribe los @var{argumentos} formateados en la salida estándar bajo el control del @var{format}. La opción @option{-v} hace que la salida sea asignada a la variable @var{var} en vez de ser imprimida a la salida estándar.

source: The @var{format} is a character string which contains three types of objects: plain characters, which are simply copied to standard output, character escape sequences, which are converted and copied to the standard output, and format specifications, each of which causes printing of the next successive @var{argument}. In addition to the standard @code{printf(1)} formats, @code{printf} interprets the following extensions:
es: El @var{format} es una cadena de caracteres que contiene tres tipos de objetos: caracteres sencillos, que son simplemente copiados a la salida estándar; secuencias de caracteres de escape, que son convertidos y copiados a la salida estándar; y especificaciones de formato, cada una de las cuales provoca la impresión del siguiente @var{argumento} sucesivo. Además de los formatos estándares de @code{printf(1)}, @code{printf} interpreta las siguientes extensiones:

source: Causes @code{printf} to expand backslash escape sequences in the corresponding @var{argument} in the same way as @code{echo -e} (@pxref{Bash Builtins}).
es: Hace que @code{printf} expanda las secuencias de barras invertidas de escape en el @var{argumento} correspondiente de la misma forma que @code{echo -e} (@pxref{Instrucciones Integradas de Bash}).

source: Causes @code{printf} to output the corresponding @var{argument} in a format that can be reused as shell input.
es: Hace que @code{printf} muestre el @var{argumento} correspondiente en un formato que puede ser reusado como entrada del intérprete.

source: Causes @code{printf} to output the date-time string resulting from using @var{datefmt} as a format string for @code{strftime}(3). The corresponding @var{argument} is an integer representing the number of seconds since the epoch. Two special argument values may be used: -1 represents the current time, and -2 represents the time the shell was invoked. If no argument is specified, conversion behaves as if -1 had been given. This is an exception to the usual @code{printf} behavior.
es: Hace que @code{printf} muestre la cadena fecha-tiempo resultante de usar @var{datefmt} como una cadena de formato para @code{strftime}(3). El @var{argumento} correspondiente es un entero que representa el número de segundos desde la época. Se pueden usar dos argumentos especiales: -1 representa el tiempo actual, y -2 representa el tiempo en que el intérprete fue invocado. Si no se especifican parámetros, la conversión se comporta como si se le hubiera pasado -1. Esto es una excepción al comportamiento usual de @code{printf}.

source: Arguments to non-string format specifiers are treated as C language constants, except that a leading plus or minus sign is allowed, and if the leading character is a single or double quote, the value is the ASCII value of the following character.
es: Los argumentos para especificadores de formato que no son cadenas son tratados como constantes del lenguaje C, excepto que se permite un signo de mayor o menor como prefijo, y si el carácter prefijado es una comilla simple o doble, el valor es el valor ASCII del siguiente carácter.

source: The @var{format} is reused as necessary to consume all of the @var{arguments}. If the @var{format} requires more @var{arguments} than are supplied, the extra format specifications behave as if a zero value or null string, as appropriate, had been supplied. The return value is zero on success, non-zero on failure.
es: El @var{formato} es reusado según sea necesario para consumir todos los @var{argumentos}. Si el @var{format} requiere más @var{parámetros} que los proporcionados, las especificaciones extra de formato se comportan como si un valor cero u nulo, según la conveniencia, hubiera sido proporcionado. El valor de retorno es cero en caso de éxito, distinto a cero en caso de fallo.

source: read [-ers] [-a @var{aname}] [-d @var{delim}] [-i @var{text}] [-n @var{nchars}] [-N @var{nchars}] [-p @var{prompt}] [-t @var{timeout}] [-u @var{fd}] [@var{name} @dots{}]
es: read [-ers] [-a @var{nombrev}] [-d @var{delim}] [-i @var{texto}] [-n @var{ncaracts}] [-N @var{ncaracts}] [-p @var{prompt}] [-t @var{tiempo-límite}] [-u @var{da}] [@var{nombre} @dots{}]

source: One line is read from the standard input, or from the file descriptor @var{fd} supplied as an argument to the @option{-u} option, split into words as described above in @ref{Word Splitting}, and the first word is assigned to the first @var{name}, the second word to the second @var{name}, and so on. If there are more words than names, the remaining words and their intervening delimiters are assigned to the last @var{name}. If there are fewer words read from the input stream than names, the remaining names are assigned empty values. The characters in the value of the @env{IFS} variable are used to split the line into words using the same rules the shell uses for expansion (described above in @ref{Word Splitting}). The backslash character @samp{\} may be used to remove any special meaning for the next character read and for line continuation. If no names are supplied, the line read is assigned to the variable @env{REPLY}. The exit status is zero, unless end-of-file is encountered, @code{read} times out (in which case the status is greater than 128), a variable assignment error (such as assigning to a readonly variable) occurs, or an invalid file descriptor is supplied as the argument to @option{-u}.
es: Se lee una línea de la entrada estándar, o del descriptor de archivo @var{da} proporcionado como un argumento de la opción @option{-u}, dividida en palabras como se describe anteriormente en @ref{División de Palabras}, y la primera palabra se asigna al primer @var{nombre}, la segunda palabra, al segundo @var{nombre}, etc. Si hay más palabras que nombres, las palabras restantes y sus delimitadores interpuestos se asignan al último @var{nombre}. Si hay menos palabras leídas del flujo de entrada que nombres, son asignados valores vacíos a los nombres sobrantes. Se usan los caracteres en el valor de la variable @env{IFS} para dividir la línea en palabras usando las mismas reglas que usa el intérprete para la expansión (descritas anteriormente en @ref{División de Palabras}). El carácter de barra invertida @samp{\} puede ser usado para eliminar cualquier significado especial para el siguiente carácter leído y para la continuación de línea. Si no se proporcionan nombres, la línea leída se asigna a la variable @env{REPLY}. El estado de salida es cero, a no ser que se encuentre el fin-de-archivo, a @code{read} se le acabe el límite de tiempo (en cuyo caso el estado es mayor que 128), ocurra un error de asignación de variable (tal como asignar a una variable de solo lectura) o se proporcione un descriptor de archivo inválido como argumento de @option{-u}.

source: -a @var{aname}
es: -a @var{nombrev}

source: The words are assigned to sequential indices of the array variable @var{aname}, starting at 0. All elements are removed from @var{aname} before the assignment. Other @var{name} arguments are ignored.
es: Las palabras son asignadas a los índices secuenciales de la variable de vector @var{nombrev}, empezando por 0. Todos los elementos son eliminados de @var{nombrev} antes de la asignación. Otros argumentos @var{nombre} son ignorados.

source: The first character of @var{delim} is used to terminate the input line, rather than newline. If @var{delim} is the empty string, @code{read} will terminate a line when it reads a NUL character.
es: Se usa el primer carácter de @var{delim} para terminar la línea de entrada, en vez de nueva línea. Si @var{delim} es la cadena vac@'ia, @code{read} terminará una l@'inea cuando lea un carácter NUL.

source: Readline (@pxref{Command Line Editing}) is used to obtain the line. Readline uses the current (or default, if line editing was not previously active) editing settings, but uses Readline's default filename completion.
es: Readline (@pxref{Edición en Línea de Órdenes}) se usa para obtener la línea. Readline usa los ajustes de edición actuales (o predeterminados, si la edición de línea no estaba previamente activa), pero usa la compleción de nombre de archivo predeterminada de Readline.

source: -i @var{text}
es: -i @var{texto}

source: If Readline is being used to read the line, @var{text} is placed into the editing buffer before editing begins.
es: Si Readline está siendo usado para leer la línea, @var{texto} es colocado en el búfer de edición entes de que la edición comience.

source: -n @var{nchars}
es: -n @var{ncaracts}

source: @code{read} returns after reading @var{nchars} characters rather than waiting for a complete line of input, but honors a delimiter if fewer than @var{nchars} characters are read before the delimiter.
es: @code{read} retorna después de leer @var{ncaracts} en vez de esperar a una línea de entrada completa, pero atiende al delimitador si son leídos menos de @var{ncaracts} antes del delimitador.

source: -N @var{nchars}
es: -N @var{ncaracts}

source: @code{read} returns after reading exactly @var{nchars} characters rather than waiting for a complete line of input, unless EOF is encountered or @code{read} times out. Delimiter characters encountered in the input are not treated specially and do not cause @code{read} to return until @var{nchars} characters are read. The result is not split on the characters in @code{IFS}; the intent is that the variable is assigned exactly the characters read (with the exception of backslash; see the @option{-r} option below).
es: @code{read} retorna después de leer exactamente @var{ncaracts} caracteres en vez de esperar a una línea completa de entrada, a no ser que se encuentre EOF o @code{read} se quede sin tiempo. Los caracteres de delimitadores encontrados en la entrada no son tratados de forma especial y no hacen que @code{read} retorne hasta que son leídos @var{ncaracts} caracteres. El resultado no es dividido en los caracteres en @code{IFS}; la intención es que sean asignados a la variable exactamente los caracteres leídos (con la excepción de la barra invertida; consulta la opción @option{-r} abajo).

source: Display @var{prompt}, without a trailing newline, before attempting to read any input. The prompt is displayed only if input is coming from a terminal.
es: Muestra @var{prompt}, sin una nueva línea al final, antes de tratar de leer alguna entrada. El prompt se muestra solo si la entrada procede de una terminal.

source: If this option is given, backslash does not act as an escape character. The backslash is considered to be part of the line. In particular, a backslash-newline pair may not then be used as a line continuation.
es: Si se pasa esta opción, la barra invertida no actúa como un carácter de escape. Se considera que la barra invertida es parte de la línea. En concreto, una pareja barra invertida-nueva línea no puede ser usada entonces como una continuación de línea.

source: Silent mode. If input is coming from a terminal, characters are not echoed.
es: Modo silencioso. Si la entrada procede de una terminal, no muestra los caracteres escritos.

source: -t @var{timeout}
es: -t @var{tiempo-límite}

source: Cause @code{read} to time out and return failure if a complete line of input (or a specified number of characters) is not read within @var{timeout} seconds. @var{timeout} may be a decimal number with a fractional portion following the decimal point. This option is only effective if @code{read} is reading input from a terminal, pipe, or other special file; it has no effect when reading from regular files. If @code{read} times out, @code{read} saves any partial input read into the specified variable @var{name}. If @var{timeout} is 0, @code{read} returns immediately, without trying to read and data. The exit status is 0 if input is available on the specified file descriptor, non-zero otherwise. The exit status is greater than 128 if the timeout is exceeded.
es: Hace que @code{read} tenga un límite de tiempo y devuelva fallo si una línea de entrada completa (o un número especificado de caracteres) no es leída en @var{tiempo-límite} segundos. @var{tiempo-límite} puede ser un número decimal con una porción fraccionaria siguiendo la coma decimal. Esta opción solo es efectiva si @code{read} está leyendo entrada de una terminal, tubería u otro archivo especial; no tiene efecto cuando lee de archivos normales. Si a @code{read} se le acaba el tiempo, @code{read} guarda cualquier entrada parcial leída en la @var{nombre} variable especificada. Si @var{tiempo-límite} es 0, @code{read} retorna inmediatamente, sin tratar de leer ningún dato. El estado de salida es 0 si la entrada está disponible en el descriptor de archivo especificado, distinto de cero en caso contrario. El estado de salida es mayor que 128 si se excede el tiempo límite.

source: -u @var{fd}
es: -u @var{da}

source: Read input from file descriptor @var{fd}.
es: Lee entrada del descriptor de archivo @var{da}.

source: readarray [-d @var{delim}] [-n @var{count}] [-O @var{origin}] [-s @var{count}] [-t] [-u @var{fd}] [-C @var{callback}] [-c @var{quantum}] [@var{array}]
es: readarray [-d @var{delim}] [-n @var{cuenta}] [-O @var{origen}] [-s @var{cuenta}] [-t] [-u @var{da}] [-C @var{retrollamada}] [-c @var{cuantía}] [@var{vector}]

source: Read lines from the standard input into the indexed array variable @var{array}, or from file descriptor @var{fd} if the @option{-u} option is supplied.
es: Lee líneas de la entrada estándar en la variable de vector indexada @var{vector}, o del descriptor de archivo @var{da} si se proporciona la opción @option{-u}.

source: A synonym for @code{mapfile}.
es: Un sinónimo de @code{mapfile}.

source: source @var{filename}
es: source @var{nombre-de-archivo}

source: A synonym for @code{.} (@pxref{Bourne Shell Builtins}).
es: Un sinónimo de @code{.} (@pxref{Instrucciones Integradas del Bourne Shell}).

source: type [-afptP] [@var{name} @dots{}]
es: type [-afptP] [@var{nombre} @dots{}]

source: For each @var{name}, indicate how it would be interpreted if used as a command name.
es: Por cada @var{nombre}, indica como sería interpretado si es usado como nombre de instrucción.

source: If the @option{-t} option is used, @code{type} prints a single word which is one of @samp{alias}, @samp{function}, @samp{builtin}, @samp{file} or @samp{keyword}, if @var{name} is an alias, shell function, shell builtin, disk file, or shell reserved word, respectively. If the @var{name} is not found, then nothing is printed, and @code{type} returns a failure status.
es: Si se usa la opción @option{-t}, @code{type} imprime una solo palabra que es una de @samp{alias}, @samp{function}, @samp{builtin}, @samp{file} o @samp{keyword}, si @var{nombre} es un alias, función del intérprete, instrucción integrada del intérprete, archivo de disco o palabra reservada del intérprete respectivamente. Si no se encuentra el @var{nombre}, no se imprime nada y @code{type} devuelve un estado de fallo.

source: If the @option{-p} option is used, @code{type} either returns the name of the disk file that would be executed, or nothing if @option{-t} would not return @samp{file}.
es: Si se usa la opción @option{-p}, @code{type} devuelve o el nombre del archivo de disco que sería ejecutado o nada si @option{-t} no devolviera @samp{file}.

source: The @option{-P} option forces a path search for each @var{name}, even if @option{-t} would not return @samp{file}.
es: La opción @option{-P} fuerza una búsqueda de ruta por cada @var{nombre}, incluso si @option{-t} no devolviera @samp{file}.
