Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Bash includes a number of features to support a separate debugger for shell scripts.
es: Bash incluye varias funcionalidades para ofrecer un depurador separado para guiones del intérprete.

source: The SVR4.2 shell has two privilege-related builtins (@code{mldmode} and @code{priv}) not present in Bash.
es: El intérprete SVR4.2 tiene dos instrucciones integradas relacionadas con privilegios (@code{mldmode} y @code{priv}) inexistentes en Bash.

source: Bash does not have the @code{stop} or @code{newgrp} builtins.
es: Bash no tiene las instrucciones integradas @code{stop} o @code{newgrp}.

source: Bash does not use the @env{SHACCT} variable or perform shell accounting.
es: Bash no usa la variable @env{SHACCT} o realiza contabilidad del intérprete.

source: The SVR4.2 @code{sh} uses a @env{TIMEOUT} variable like Bash uses @env{TMOUT}.
es: El @code{sh} SVR4.2 usa una variable @env{TIMEOUT} como Bash usas @env{TMOUT}.

source: More features unique to Bash may be found in @ref{Bash Features}.
es: Se pueden encontrar más funcionalidades de Bash en @ref{Funcionalidades de Bash}.

source: Implementation Differences From The SVR4.2 Shell
es: Diferencias de Implementación Respecto al Intérprete SVR4.2

source: Since Bash is a completely new implementation, it does not suffer from many of the limitations of the SVR4.2 shell. For instance:
es: Puesto que Bash es una implementación completamente nueva, no tiene muchas de las limitaciones del intérprete SVR4.2. Por ejemplo:

source: Bash does not fork a subshell when redirecting into or out of a shell control structure such as an @code{if} or @code{while} statement.
es: Bash no se bifurca en un subintérprete al redirigir en o desde una estructura de control como una sentencia @code{if} o @code{while}.

source: Bash does not allow unbalanced quotes. The SVR4.2 shell will silently insert a needed closing quote at @code{EOF} under certain circumstances. This can be the cause of some hard-to-find errors.
es: Bash no permite comillas sin correspondencia. El intérprete SVR4.2 insertará silenciosamente una comilla de cierre necesaria en @code{EOF} bajo ciertas circunstancias. Esto puede ser la causa de algunos errores difíciles de encontrar.

source: The SVR4.2 shell uses a baroque memory management scheme based on trapping @code{SIGSEGV}. If the shell is started from a process with @code{SIGSEGV} blocked (e.g., by using the @code{system()} C library function call), it misbehaves badly.
es: El intérprete SVR4.2 usa un pomposo esquema de gestión de memoria basado en el atrapado de @code{SIGSEGV}. Si se inicia el intérprete desde un proceso con @code{SIGSEGV} bloqueado (p. ej., usando la llamada de la biblioteca C @code{system()}), actúa mal.

source: In a questionable attempt at security, the SVR4.2 shell, when invoked without the @option{-p} option, will alter its real and effective @sc{uid} and @sc{gid} if they are less than some magic threshold value, commonly 100. This can lead to unexpected results.
es: En un cuestionable intento de seguridad, el intérprete SVR4.2, al llamarse sin la opción @option{-p}, alterará sus @sc{uid} y @sc{gid} reales y efectivos si son menores que algún umbral mágico, comúnmente 100. Esto puede llevar a resultados inesperados.

source: The SVR4.2 shell does not allow users to trap @code{SIGSEGV}, @code{SIGALRM}, or @code{SIGCHLD}.
es: El intérprete SVR4.2 no permite a usuarios usar las traps @code{SIGSEGV}, @code{SIGALRM} o @code{SIGCHLD}.

source: The SVR4.2 shell does not allow the @env{IFS}, @env{MAILCHECK}, @env{PATH}, @env{PS1}, or @env{PS2} variables to be unset.
es: El intérprete SVR4.2 no permite eliminar las variables @env{IFS}, @env{MAILCHECK}, @env{PATH}, @env{PS1} o @env{PS2}.

source: The SVR4.2 shell treats @samp{^} as the undocumented equivalent of @samp{|}.
es: El intérprete SVR4.2 trata @samp{^} como el equivalente sin documentar de @samp{|}.

source: Bash allows multiple option arguments when it is invoked (@code{-x -v}); the SVR4.2 shell allows only one option argument (@code{-xv}). In fact, some versions of the shell dump core if the second argument begins with a @samp{-}.
es: Bash permite múltiples argumentos de opción cuando es llamado (@code{-x -v}); el intérprete SVR4.2 permite solo un argumento de opción (@code{-xv}). De hecho, algunas versiones del intérprete vuelcan la memoria si el segundo argumento empieza con un @samp{-}.

source: The SVR4.2 shell exits a script if any builtin fails; Bash exits a script only if one of the @sc{posix} special builtins fails, and only for certain failures, as enumerated in the @sc{posix} standard.
es: El intérprete SVR4.2 finaliza un guion si falla cualquier instrucción integrada; Bash finaliza un guion solo si una de las instrucciones integradas especiales @sc{posix} falla, y solo para ciertos fallos, según se enumera en el estándar @sc{posix}.

source: The SVR4.2 shell behaves differently when invoked as @code{jsh} (it turns on job control).
es: El intérprete SVR4.2 se comporta diferente cuando se llama como @code{jsh} (activa el control de tareas).

source: Builtin Index
es: @'Indice Integrado

source: Index of Bash builtin commands.
es: @'Indice de instrucciones integradas de Bash.

source: Reserved Word Index
es: @'Indice de Palabras Reservadas

source: Index of Bash reserved words.
es: @'Indice de palabras reservadas de Bash.

source: Variable Index
es: @'Indice de Variables

source: Quick reference helps you find the variable you want.
es: Referencia rápida que le ayuda a encontrar la variable que quiere.

source: Function Index
es: @'Indice de Funciones

source: Index of bindable Readline functions.
es: @'Indice de funciones Readline asociables.

source: Concept Index
es: @'Indice Conceptual

source: General index for concepts described in this manual.
es: @'Indice general de conceptos descritos en este manual.

source: Index of Shell Builtin Commands
es: @'Indice de Instrucciones Integradas del Intérprete

source: Index of Shell Reserved Words
es: @'Indice de Palabras Reservadas del Intérprete

source: Parameter and Variable Index
es: @'Indice de Parámetros y Variables
