Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Invoked as an interactive login shell, or with @option{--login}
es: Llamado como un intérprete de acceso interactivo, o con @option{--login}

source: When Bash is invoked as an interactive login shell, or as a non-interactive shell with the @option{--login} option, it first reads and executes commands from the file @file{/etc/profile}, if that file exists. After reading that file, it looks for @file{~/.bash_profile}, @file{~/.bash_login}, and @file{~/.profile}, in that order, and reads and executes commands from the first one that exists and is readable. The @option{--noprofile} option may be used when the shell is started to inhibit this behavior.
es: Cuando Bash es llamado como un intérprete de acceso interactivo o como un intérprete no interactivo con la opción @option{--login}, primero lee y ejecuta instrucciones del archivo @file{/etc/profile}, si ese archivo existe. Después de leer ese archivo, busca @file{~/.bash_profile}, @file{~/.bash_login} y @file{~/.profile}, en ese orden, y lee y ejecuta instrucciones del primero que existe y es legible. La opción @option{--noprofile} puede ser usada cuando se inicia el intérprete para inhibir este comportamiento.

source: When an interactive login shell exits, or a non-interactive login shell executes the @code{exit} builtin command, Bash reads and executes commands from the file @file{~/.bash_logout}, if it exists.
es: Cuando finaliza un intérprete interactivo de acceso o un intérprete no interactivo de acceso ejecuta la instrucción integrada @code{exit}, Bash lee y ejecuta instrucciones del archivo @file{~/.bash_logout}, si existe.

source: Invoked as an interactive non-login shell
es: Llamado como un intérprete no de acceso

source: When an interactive shell that is not a login shell is started, Bash reads and executes commands from @file{~/.bashrc}, if that file exists. This may be inhibited by using the @option{--norc} option. The @option{--rcfile @var{file}} option will force Bash to read and execute commands from @var{file} instead of @file{~/.bashrc}.
es: Cuando se inicia un intérprete interactivo que no es un intérprete de acceso, Bash lee y ejecuta instrucciones de @file{~/.bashrc}, si ese archivo existe. Esto puede ser inhibido usando la opción @option{--norc}. La opción @option{--rcfile @var{archivo}} forzará a Bash a leer y ejecutar instrucciones de @var{archivo} en lugar de @file{~/.bashrc}.

source: So, typically, your @file{~/.bash_profile} contains the line
es: Así, típicamente, su @file{~/.bash_profile} contiene la línea

source: after (or before) any login-specific initializations.
es: después (o antes) de las inicializaciones específicas de acceso.

source: Invoked non-interactively
es: Llamado de forma no interactiva

source: When Bash is started non-interactively, to run a shell script, for example, it looks for the variable @env{BASH_ENV} in the environment, expands its value if it appears there, and uses the expanded value as the name of a file to read and execute. Bash behaves as if the following command were executed:
es: Cuando Bash se inicia de forma no interactiva, para ejecutar un guion del intérprete, por ejemplo, busca la variable @env{BASH_ENV} en el entorno, expande su valor si aparece ahí y usa el valor expandido como el nombre de un archivo que leer y ejecutar. Bash se comporta como si la siguiente instrucción fuera ejecutada:

source: but the value of the @env{PATH} variable is not used to search for the filename.
es: pero el valor de la variable @env{PATH} no se usa para buscar el nombre de archivo.

source: As noted above, if a non-interactive shell is invoked with the @option{--login} option, Bash attempts to read and execute commands from the login shell startup files.
es: Como se indicó anteriormente, si se llama a un intérprete interactivo con la opción @option{--login}, Bash trata de leer y ejecutar instrucciones de los archivos de inicio del intérprete de acceso.

source: Invoked with name @code{sh}
es: Llamado con el nombre @code{sh}

source: If Bash is invoked with the name @code{sh}, it tries to mimic the startup behavior of historical versions of @code{sh} as closely as possible, while conforming to the @sc{posix} standard as well.
es: Si se llama a Bash con el nombre @code{sh}, trata de imitar el comportamiento de inicio de versiones históricas de @code{sh} de la manera más fiel posible, ajustándose al mismo tiempo al estándar @sc{posix} también.

source: When invoked as an interactive login shell, or as a non-interactive shell with the @option{--login} option, it first attempts to read and execute commands from @file{/etc/profile} and @file{~/.profile}, in that order. The @option{--noprofile} option may be used to inhibit this behavior. When invoked as an interactive shell with the name @code{sh}, Bash looks for the variable @env{ENV}, expands its value if it is defined, and uses the expanded value as the name of a file to read and execute. Since a shell invoked as @code{sh} does not attempt to read and execute commands from any other startup files, the @option{--rcfile} option has no effect. A non-interactive shell invoked with the name @code{sh} does not attempt to read any other startup files.
es: Cuando se llama como un intérprete de acceso interactivo o como un intérprete no interactivo con la opción @option{--login}, trata primero de leer y ejecutar instrucciones de @file{/etc/profile} y @file{~/.profile}, en ese orden. La opción @option{--noprofile} puede ser usada para inhibir este comportamiento. Al llamarse como un intérprete interactivo con el nombre @code{sh}, Bash busca la variable @env{ENV}, expande su valor si está definido y usa el valor expandido como el nombre de un archivo que leer y ejecutar. Puesto que un intérprete llamado con @code{sh} no trata de leer y ejecutar instrucciones de otros archivos de inicio, la opción @option{--rcfile} no tiene efecto. Un intérprete no interactivo llamado con el nombre @code{sh} no trata de leer otros archivos de inicio.

source: When invoked as @code{sh}, Bash enters @sc{posix} mode after the startup files are read.
es: Al llamarse con @code{sh}, Bash entra al modo @sc{posix} después de que hayan sido leídos los archivos de inicio.

source: Invoked in @sc{posix} mode
es: Llamado en modo @sc{posix}

source: When Bash is started in @sc{posix} mode, as with the @option{--posix} command line option, it follows the @sc{posix} standard for startup files. In this mode, interactive shells expand the @env{ENV} variable and commands are read and executed from the file whose name is the expanded value. No other startup files are read.
es: Cuando se inicia Bash en modo @sc{posix}, como con la opción de línea de órdenes @option{--posix}, sigue el estándar @sc{posix} para archivos de inicio. En este modo, los intérpretes interactivos expanden la variable @env{ENV} y las instrucciones son leídas y ejecutadas del archivo cuyo nombre es el valor expandido. No se leen ningunos otros archivos de inicio.

source: Invoked by remote shell daemon
es: Llamado por un demonio del intérprete remoto

source: Bash attempts to determine when it is being run with its standard input connected to a network connection, as when executed by the remote shell daemon, usually @code{rshd}, or the secure shell daemon @code{sshd}. If Bash determines it is being run in this fashion, it reads and executes commands from @file{~/.bashrc}, if that file exists and is readable. It will not do this if invoked as @code{sh}. The @option{--norc} option may be used to inhibit this behavior, and the @option{--rcfile} option may be used to force another file to be read, but neither @code{rshd} nor @code{sshd} generally invoke the shell with those options or allow them to be specified.
es: Bash trata de determinar cuándo está siendo ejecutado con su entrada estándar conectada a una conexión de red, así como cuándo es ejecutado por el demonio remoto del intérprete, normalmente @code{rshd}, o el demonio del intérprete seguro @code{sshd}. Si Bash determina que está siendo ejecutado de esta forma, lee y ejecuta instrucciones de @file{~/.bashrc}, si ese archivo existe y es legible. No hará esto al ser llamado con @code{sh}. La opción @option{--norc} puede ser usada para inhibir este comportamiento, y la opción @option{--rcfile} puede ser usada para forzar que sea leído otro archivo, pero ni @code{rshd} ni @code{sshd} llaman generalmente al intérprete con estas opciones o permiten que sean especificadas.

source: Invoked with unequal effective and real @sc{uid/gid}s
es: Llamado con diferentes @sc{uid/gid}s reales y efectivos

source: If Bash is started with the effective user (group) id not equal to the real user (group) id, and the @option{-p} option is not supplied, no startup files are read, shell functions are not inherited from the environment, the @env{SHELLOPTS}, @env{BASHOPTS}, @env{CDPATH}, and @env{GLOBIGNORE} variables, if they appear in the environment, are ignored, and the effective user id is set to the real user id. If the @option{-p} option is supplied at invocation, the startup behavior is the same, but the effective user id is not reset.
es: Si Bash es llamado con el id de usuario efectivo (grupo) diferente al id de usuario real (grupo) y no se proporciona la opción @option{-p}, no se lee ningún archivo de inicio, las funciones del intérprete no se heredan del entorno, las variables @env{SHELLOPTS}, @env{BASHOPTS}, @env{CDPATH} y @env{GLOBIGNORE}, si aparecen en el entorno, son ignoradas y el id de usuario efectivo se establece al id de usuario real. Si proporciona la opción @option{-p} en la invocación, el comportamiento de inicio es el mismo, pero el id de usuario efectivo no se restablece.

source: shell, interactive
es: intérprete, interactivo

source: What is an Interactive Shell?
es: ¿Qué es un Intérprete interactivo?

source: What determines whether a shell is Interactive.
es: Qué determina si un intérprete es Interactivo.

source: Is this Shell Interactive?
es: ¿Es este Intérprete Interactivo?

source: How to tell if a shell is interactive.
es: Cómo saber si un intérprete es interactivo.

source: Interactive Shell Behavior
es: Comportamiento del Intérprete Interactivo

source: What changes in a interactive shell?
es: ¿Qué cambia en un intérprete interactivo?

source: An interactive shell is one started without non-option arguments, unless @option{-s} is specified, without specifying the @option{-c} option, and whose input and error output are both connected to terminals (as determined by @code{isatty(3)}), or one started with the @option{-i} option.
es: Un intérprete interactivo es uno iniciado sin argumentos de opción, a no ser que se especifique @option{-s}, sin especificar la opción @option{-c}, y cuyas entrada y salida de error están conectadas a terminales (según se determina por @code{isatty(3)}), o el iniciado con la opción @option{-i}.

source: An interactive shell generally reads from and writes to a user's terminal.
es: Un intérprete interactivo generalmente lee de y escribe a la terminal de un usuario.

source: The @option{-s} invocation option may be used to set the positional parameters when an interactive shell is started.
es: La opción de llamada @option{-s} puede usarse para establecer los parámetros posicionales cuando se inicia un intérprete interactivo.

source: To determine within a startup script whether or not Bash is running interactively, test the value of the @samp{-} special parameter. It contains @code{i} when the shell is interactive. For example:
es: Para determinar dentro de un guion de inicio si Bash está corriendo interactivamente, compruebe el valor del parámetro especial @samp{-}. Contiene @code{i} cuando el intérprete es interactivo. Por ejemplo:

source: case "$-" in *i*) echo This shell is interactive ;; *) echo This shell is not interactive ;; esac
es: case "$-" in *i*) echo Este intérprete es interactivo ;; *) echo Este intérprete no es interactivo ;; esac

source: Alternatively, startup scripts may examine the variable @env{PS1}; it is unset in non-interactive shells, and set in interactive shells. Thus:
es: Alternativamente, los guiones de inicio pueden examinar la variable @env{PS1}; está sin asignar en intérpretes no intéractivos y asignada en intérpretes interactivos. Así:

source: if [ -z "$PS1" ]; then echo This shell is not interactive else echo This shell is interactive fi
es: if [ -z "$PS1" ]; then echo Este intérprete es no interactivo else echo Este intérprete es interactivo fi

source: When the shell is running interactively, it changes its behavior in several ways.
es: Cuando el intérprete está corriendo interactivamente, cambia su comportamiento de varias formas.

source: Startup files are read and executed as described in @ref{Bash Startup Files}.
es: Los archivos de inicio son leídos y ejecutados como se describe en @ref{Archivos de Inicio de Bash}.

source: Job Control (@pxref{Job Control}) is enabled by default. When job control is in effect, Bash ignores the keyboard-generated job control signals @code{SIGTTIN}, @code{SIGTTOU}, and @code{SIGTSTP}.
es: El Control de Tareas (@pxref{Control de Tareas}) está activado por defecto. Cuando el control de tareas está en efecto, Bash ignora las señales de control de tareas generadas por el teclado @code{SIGTTIN}, @code{SIGTTOU} y @code{SIGTSTP}.

source: Bash expands and displays @env{PS1} before reading the first line of a command, and expands and displays @env{PS2} before reading the second and subsequent lines of a multi-line command. Bash expands and displays @env{PS0} after it reads a command but before executing it. See @ref{Controlling the Prompt}, for a complete list of prompt string escape sequences.
es: Bash expande y muestra @env{PS1} antes de leer la primera línea de una instrucción, y expande y muestra @env{PS2} antes de leer la segunda y posteriores líneas de una instrucción multilínea. Bash expande y muestra @env{PS0} tras leer una instrucción pero antes de ejecutarla. Consulte @ref{Controlando el Prompt} para una lista completa de secuencias de escape de cadenas de prompt.

source: Bash executes the value of the @env{PROMPT_COMMAND} variable as a command before printing the primary prompt, @env{$PS1} (@pxref{Bash Variables}).
es: Bash ejecuta el valor de la variable @env{PROMPT_COMMAND} como una instrucción antes de imprimir el prompt primario, @env{$PS1} (@pxref{Variables de Bash}).

source: Readline (@pxref{Command Line Editing}) is used to read commands from the user's terminal.
es: Readline (@pxref{Edición en Línea de Órdenes}) se usa para leer instrucciones desde la terminal del usuario.

source: Bash inspects the value of the @code{ignoreeof} option to @code{set -o} instead of exiting immediately when it receives an @code{EOF} on its standard input when reading a command (@pxref{The Set Builtin}).
es: Bash inspecciona el valor de la opción @code{ignoreeof} para @code{set -o} en vez de finalizar inmediatamente cuando recibe un @code{EOF} en su salida estándar al leer una instrucción (@pxref{La Instrucción Integrada Set}).

source: Command history (@pxref{Bash History Facilities}) and history expansion (@pxref{History Interaction}) are enabled by default. Bash will save the command history to the file named by @env{$HISTFILE} when a shell with history enabled exits.
es: El historial de instrucciones (@pxref{Servicios del Historial de Bash}) y la expansión de historial (@pxref{Interacción con el Historial}) están habilitados por defecto. Bash guardará el historial de instrucciones en el archivo nombrado por @env{$HISTFILE} cuando finaliza un intérprete con el historial habilitado.

source: Alias expansion (@pxref{Aliases}) is performed by default.
es: La expansión de alias (@pxref{Aliases}) se realiza por defecto.

source: In the absence of any traps, Bash ignores @code{SIGTERM} (@pxref{Signals}).
es: En ausencia de traps, Bash ignora @code{SIGTERM} (@pxref{Señales}).

source: In the absence of any traps, @code{SIGINT} is caught and handled (@pxref{Signals}). @code{SIGINT} will interrupt some shell builtins.
es: En ausencia de traps, @code{SIGINT} es atrapada y manejada (@pxref{Señales}). @code{SIGINT} interrumpirá algunas instrucciones integradas del intérprete.

source: An interactive login shell sends a @code{SIGHUP} to all jobs on exit if the @code{huponexit} shell option has been enabled (@pxref{Signals}).
es: Un intérprete de acceso interactivo envía una @code{SIGHUP} a todas las tareas en la salida si la opción del intérprete @option{huponexit} ha sido habilitada (@pxref{Señales}).

source: The @option{-n} invocation option is ignored, and @samp{set -n} has no effect (@pxref{The Set Builtin}).
es: La opción de llamada @option{-n} es ignorada, y @samp{set -n} no tiene efecto (@pxref{La Instrucción Integrada Set}).

source: Bash will check for mail periodically, depending on the values of the @env{MAIL}, @env{MAILPATH}, and @env{MAILCHECK} shell variables (@pxref{Bash Variables}).
es: Bash comprobará el correo periódicamente, dependiendo de los valores de las variables del intérprete @env{MAIL}, @env{MAILPATH} y @env{MAILCHECK} (@pxref{Variables de Bash}).

source: Expansion errors due to references to unbound shell variables after @samp{set -u} has been enabled will not cause the shell to exit (@pxref{The Set Builtin}).
es: Los errores de expansión debidos a referencias a variables sin asociar del intérprete después de que @samp{set -u} haya sido habilitada no harán que el intérprete finalice (@pxref{La Instrucción Integrada Set}).

source: The shell will not exit on expansion errors caused by @var{var} being unset or null in @code{$@{@var{var}:?@var{word}@}} expansions (@pxref{Shell Parameter Expansion}).
es: El intérprete no finalizará durante errores de expansión causados por @var{var} estando sin asignar o nula en expansiones @code{$@{@var{var}:?@var{palabra}@}} (@pxref{Expansión de Parámetros del Intérprete}).

source: Redirection errors encountered by shell builtins will not cause the shell to exit.
es: Los errores de redirección encontrados por instrucciones integradas del intérprete no harán que el intérprete finalice.

source: When running in @sc{posix} mode, a special builtin returning an error status will not cause the shell to exit (@pxref{Bash POSIX Mode}).
es: Cuando se ejecuta en modo @sc{posix}, una instrucción integrada especial que retorne un estado de error no hará que el intérprete se cierre (@pxref{Modo POSIX de Bash}).

source: A failed @code{exec} will not cause the shell to exit (@pxref{Bourne Shell Builtins}).
es: Un @code{exec} fallido no causará que el intérprete se cierre (@pxref{Instrucciones Integradas del Bourne Shell}).

source: Parser syntax errors will not cause the shell to exit.
es: Errores de sintaxis del analizador no harán que el intérprete finalice.

source: Simple spelling correction for directory arguments to the @code{cd} builtin is enabled by default (see the description of the @code{cdspell} option to the @code{shopt} builtin in @ref{The Shopt Builtin}).
es: Está activada por defecto la corrección simple para argumentos de directorio para la instrucción integrada @code{cd} (consulte la descripción de la opción @code{cdspell} para la instrucción integrada @code{shopt} en @ref{La Instrucción Integrada Shopt}).

source: The shell will check the value of the @env{TMOUT} variable and exit if a command is not read within the specified number of seconds after printing @env{$PS1} (@pxref{Bash Variables}).
es: El intérprete comprobará el valor de la variable @env{TMOUT} y finalizará si una instrucción no es leída dentro del número de segundos especificado antes de imprimir @env{$PS1} (@pxref{Variables de Bash}).

source: expressions, conditional
es: expresiones, condicionales

source: Conditional expressions are used by the @code{[[} compound command and the @code{test} and @code{[} builtin commands. The @code{test} and @code{[} commands determine their behavior based on the number of arguments; see the descriptions of those commands for any other command-specific actions.
es: Las expresiones condicionales son usadas por la instrucción compuesta @code{[[} y las instrucciones integradas @code{test} y @code{[}. Las instrucciones @code{test} y @code{[} determinan su comportamiento basadas en el número de argumentos; consulte las descripciones de estas instrucciones para cualquier otra acción especifica de la instrucción.

source: Expressions may be unary or binary, and are formed from the following primaries. Unary expressions are often used to examine the status of a file. There are string operators and numeric comparison operators as well. Bash handles several filenames specially when they are used in expressions. If the operating system on which Bash is running provides these special files, Bash will use them; otherwise it will emulate them internally with this behavior: If the @var{file} argument to one of the primaries is of the form @file{/dev/fd/@var{N}}, then file descriptor @var{N} is checked. If the @var{file} argument to one of the primaries is one of @file{/dev/stdin}, @file{/dev/stdout}, or @file{/dev/stderr}, file descriptor 0, 1, or 2, respectively, is checked.
es: Las expresiones pueden ser unarias o binarias, y están formadas por las siguientes unarias. Las expresiones unarias se usan frecuentemente para examinar el estado de un archivo. Hay operadores de cadenas y operadores numéricos de comparación también. Bash maneja varias nombres de archivo de forma especial cuando son usados en expresiones. Si el sistema operativo en que Bash está corriendo proporciona estos archivos especiales, Bash los usará; de lo contrario, los emulará internamente con este comportamiento: si el argumento @var{archivo} para uno de los primarios es de la forma @file{/dev/fd/@var{N}}, entonces se comprueba el descriptor de archivo @var{N}. Si el argumento @var{archivo} para uno de los primarios es @file{/dev/stdin}, @file{/dev/stdout}, o @file{/dev/stderr} se comprueba el descriptor de archivo 0, 1 o 2, respectivamente.

source: When used with @code{[[}, the @samp{<} and @samp{>} operators sort lexicographically using the current locale. The @code{test} command uses ASCII ordering.
es: Al usarse con @code{[[}, los operadores @samp{<} y @samp{>} ordenan lexicográficamente usando la configuración regional actual. La instrucción @code{test} usa la ordenación ASCII.

source: Unless otherwise specified, primaries that operate on files follow symbolic links and operate on the target of the link, rather than the link itself.
es: A no ser que se especifique lo contrario, los primarios que operan en archivo siguen enlaces simbólicos y operan en el destino del enlace, en vez de en el propio enlace.

source: -a @var{file}
es: -a @var{archivo}

source: True if @var{file} exists.
es: Verdadero si @var{archivo} existe.

source: -b @var{file}
es: -b @var{archivo}

source: True if @var{file} exists and is a block special file.
es: Verdadero si @var{archivo} existe y es un archivo especial de bloque.

source: -c @var{file}
es: -c @var{archivo}

source: True if @var{file} exists and is a character special file.
es: Verdadero si @var{archivo} existe y es un archivo especial de carácter.

source: -d @var{file}
es: -d @var{archivo}

source: True if @var{file} exists and is a directory.
es: Verdadero si @var{archivo} existe y es un directorio.

source: -e @var{file}
es: -e @var{archivo}

source: -f @var{file}
es: -f @var{archivo}

source: True if @var{file} exists and is a regular file.
es: Verdadero si @var{archivo} existe y es un fichero normal.

source: -g @var{file}
es: -g @var{archivo}

source: True if @var{file} exists and its set-group-id bit is set.
es: Verdadero si @var{archivo} existe y su bit set-group-id está establecido.

source: -h @var{file}
es: -h @var{archivo}

source: True if @var{file} exists and is a symbolic link.
es: Verdadero si @var{archivo} existe y es un enlace simbólico.
