Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: The length in characters of the expanded value of @var{parameter} is substituted. If @var{parameter} is @samp{*} or @samp{@@}, the value substituted is the number of positional parameters. If @var{parameter} is an array name subscripted by @samp{*} or @samp{@@}, the value substituted is the number of elements in the array. If @var{parameter} is an indexed array name subscripted by a negative number, that number is interpreted as relative to one greater than the maximum index of @var{parameter}, so negative indices count back from the end of the array, and an index of -1 references the last element.
es: Se sustituye la longitud en caracteres del valor expandido de @var{parámetro}. Si @var{parámetro} es @samp{*} o @samp{@@}, el valor sustituido es el número de parámetros posicionales. Si @var{parámetro} es un nombre de vector subindexado por @samp{*} o @samp{@@}, el valor sustituido es el número de elementos en el vector. Si @var{parámetro} es un nombre de vector indexado subindexado por un número negativo, ese número es interpretado como relativo a uno mayor que el índice máximo de @var{parámetro}, de forma que los índices negativos cuenten atrás desde el final del vector, y un índice de -1 referencie al último elemento.

source: $@{@var{parameter}#@var{word}@}
es: $@{@var{parámetro}#@var{palabra}@}

source: $@{@var{parameter}##@var{word}@}
es: $@{@var{parámetro}##@var{palabra}@}

source: The @var{word} is expanded to produce a pattern and matched according to the rules described below (@pxref{Pattern Matching}). If the pattern matches the beginning of the expanded value of @var{parameter}, then the result of the expansion is the expanded value of @var{parameter} with the shortest matching pattern (the @samp{#} case) or the longest matching pattern (the @samp{##} case) deleted. If @var{parameter} is @samp{@@} or @samp{*}, the pattern removal operation is applied to each positional parameter in turn, and the expansion is the resultant list. If @var{parameter} is an array variable subscripted with @samp{@@} or @samp{*}, the pattern removal operation is applied to each member of the array in turn, and the expansion is the resultant list.
es: La @var{palabra} se expande para producir un patrón y es coincidida según las reglas descritas abajo (@pxref{Coincidencia de Patrones}). Si el patrón coincide con el principio del valor expandido de @var{parámetro}, el resultado de la expansión es el valor expandido de @var{parámetro} con el patrón coincidente más corto (el caso @samp{#}) o el patrón coincidente más largo (el caso @samp{##}). Si @var{parámetro} es @samp{@@} o @samp{*}, se aplica la operación de eliminación de patrón a cada parámetro posicional en orden, y la expansión es la lista resultante. Si @var{parámetro} es una variable de vector subindexada con @samp{@@} o @samp{*}, la operación de eliminación de patrón se aplica a cada miembro del vector en orden, y la expansión es la lista resultante.

source: $@{@var{parameter}%@var{word}@}
es: $@{@var{parámetro}%@var{palabra}@}

source: $@{@var{parameter}%%@var{word}@}
es: $@{@var{parámetro}%%@var{palabra}@}

source: The @var{word} is expanded to produce a pattern and matched according to the rules described below (@pxref{Pattern Matching}). If the pattern matches If the pattern matches a trailing portion of the expanded value of @var{parameter}, then the result of the expansion is the value of @var{parameter} with the shortest matching pattern (the @samp{%} case) or the longest matching pattern (the @samp{%%} case) deleted. If @var{parameter} is @samp{@@} or @samp{*}, the pattern removal operation is applied to each positional parameter in turn, and the expansion is the resultant list. If @var{parameter} is an array variable subscripted with @samp{@@} or @samp{*}, the pattern removal operation is applied to each member of the array in turn, and the expansion is the resultant list.
es: La @var{palabra} se expande para producir un patrón y es coincidida según las reglas descritas abajo (@pxref{Coincidencia de Patrones}). Si el patrón coincide con una porción del final del valor expandido de @var{parámetro}, el resultado de la expansión es el valor de @var{parámetro} con el patrón coincidente más corto (el caso @samp{%}) o el patrón coincidente más largo (el caso @samp{%%}). Si @var{parámetro} es @samp{@@} o @samp{*}, se aplica la operación de eliminación de patrón a cada parámetro posicional en orden, y la expansión es la lista resultante. Si @var{parámetro} es una variable de vector subindexada con @samp{@@} o @samp{*}, la operación de eliminación de patrón se aplica a cada miembro del vector en orden, y la expansión es la lista resultante.

source: $@{@var{parameter}/@var{pattern}/@var{string}@}
es: $@{@var{parámetro}/@var{patrón}/@var{cadena}@}

source: The @var{pattern} is expanded to produce a pattern just as in filename expansion. @var{Parameter} is expanded and the longest match of @var{pattern} against its value is replaced with @var{string}. The match is performed according to the rules described below (@pxref{Pattern Matching}). If @var{pattern} begins with @samp{/}, all matches of @var{pattern} are replaced with @var{string}. Normally only the first match is replaced. If @var{pattern} begins with @samp{#}, it must match at the beginning of the expanded value of @var{parameter}. If @var{pattern} begins with @samp{%}, it must match at the end of the expanded value of @var{parameter}. If @var{string} is null, matches of @var{pattern} are deleted and the @code{/} following @var{pattern} may be omitted. If the @code{nocasematch} shell option (see the description of @code{shopt} in @ref{The Shopt Builtin}) is enabled, the match is performed without regard to the case of alphabetic characters. If @var{parameter} is @samp{@@} or @samp{*}, the substitution operation is applied to each positional parameter in turn, and the expansion is the resultant list. If @var{parameter} is an array variable subscripted with @samp{@@} or @samp{*}, the substitution operation is applied to each member of the array in turn, and the expansion is the resultant list.
es: El @var{patrón} se expande para producir un patrón de la misma manera que en la expansión de nombre de archivo. Se expande @var{parámetro}, y se reemplaza por @var{cadena} la coincidencia de @var{patrón} con el valor más largo. Si @var{patrón} comienza por @samp{/}, todas las coincidencias de @var{patrón} son reemplazadas por @var{cadena}. La coincidencia se realiza según las reglas descritas abajo (@pxref{Coincidencia de Patrones}). Normalmente solo se reemplaza la primera coincidencia. Si @var{patrón} comienza en @samp{#}, debe coincidir al comienzo del valor expandido de @var{parámetro}. Si @var{patrón} comienza por @samp{%}, debe coincidir al final del valor expandido de @var{parámetro}. Si @var{cadena} es nulo, las coincidencias de @var{patrón} son eliminadas y se puede omitir el @code{/} que sigue a @var{patrón}. Si está habilitada la opción del intérprete @code{nocasematch} (consulte la descripción de @code{shopt} en @ref{La Instrucción Integrada Shopt}), la coincidencia se realiza sin importar las mayúsculas y minúsculas de caracteres alfabéticos. Si @var{parámetro} es @samp{@@} o @samp{*}, la operación de sustitución se aplica a cada parámetro posicional en orden y la expansión es la lista resultante. Si @var{parámetro} es una variable de vector subindexada con @samp{@@} o @samp{*}, se aplica la operación de sustitución a cada miembro del vector en orden y la expansión es la lista resultante.

source: $@{@var{parameter}^@var{pattern}@}
es: $@{@var{parámetro}^@var{patrón}@}

source: $@{@var{parameter}^^@var{pattern}@}
es: $@{@var{parámetro}^^@var{patrón}@}

source: $@{@var{parameter},@var{pattern}@}
es: $@{@var{parámetro},@var{patrón}@}

source: $@{@var{parameter},,@var{pattern}@}
es: $@{@var{parámetro},,@var{patrón}@}

source: This expansion modifies the case of alphabetic characters in @var{parameter}. The @var{pattern} is expanded to produce a pattern just as in filename expansion. Each character in the expanded value of @var{parameter} is tested against @var{pattern}, and, if it matches the pattern, its case is converted. The pattern should not attempt to match more than one character. The @samp{^} operator converts lowercase letters matching @var{pattern} to uppercase; the @samp{,} operator converts matching uppercase letters to lowercase. The @samp{^^} and @samp{,,} expansions convert each matched character in the expanded value; the @samp{^} and @samp{,} expansions match and convert only the first character in the expanded value. If @var{pattern} is omitted, it is treated like a @samp{?}, which matches every character. If @var{parameter} is @samp{@@} or @samp{*}, the case modification operation is applied to each positional parameter in turn, and the expansion is the resultant list. If @var{parameter} is an array variable subscripted with @samp{@@} or @samp{*}, the case modification operation is applied to each member of the array in turn, and the expansion is the resultant list.
es: La expansión modifica las mayúsculas y minúsculas de los caracteres alfabéticos. El @var{patrón} se expande para producir un patrón de la misma manera que en la expansión de nombre de archivo. Cada carácter en el valor expandido de @var{parámetro} es comprobado contra @var{patrón}, y, si coincide con el patrón, se alterna entre mayúsculas y minúsculas. El patrón no debería tratar de coincidir con más de un carácter. El operador @samp{^} convierte letras minúsculas que coinciden con @var{patrón} a mayúsculas; el operador @samp{,} convierte letras mayúsculas coincidentes a minúsculas. Las expansiones @samp{^^} y @samp{,,} convierten cada carácter coincidente en el valor expandido; las expansiones @samp{^} y @samp{,} coinciden y convierten solo el primer carácter en el valor expandido. Si se omite @var{patrón}, se trata como un @samp{?}, que coincide con cualquier carácter. Si @var{parámetro} es @samp{@@} o @samp{*}, la operación de modificación de alternación entre mayúsculas y minúsculas se aplica a cada parámetro posicional en orden y la expansión es la lista resultante. Si @var{parámetro} es una variable de vector subindexada con @samp{@@} o @samp{*}, la operación de modificación de alternación entre mayúsculas y minúsculas se aplica a cada miembro en orden y la expansión es la lista resultante.

source: $@{@var{parameter}@@@var{operator}@}
es: $@{@var{parámetro}@@@var{operador}@}

source: The expansion is either a transformation of the value of @var{parameter} or information about @var{parameter} itself, depending on the value of @var{operator}. Each @var{operator} is a single letter:
es: La expansión es o una transformación del valor de @var{parámetro} o información sobre @var{parámetro} en sí, dependiendo del valor de @var{operador}. Cada @var{operador} es una única letra:

source: The expansion is a string that is the value of @var{parameter} quoted in a format that can be reused as input.
es: La expansión es una cadena que es el valor de @var{parámetro} entrecomillado en un formato que puede ser reutilizado como entrada.

source: The expansion is a string that is the value of @var{parameter} with backslash escape sequences expanded as with the @code{$'@dots{}'} quoting mechanism.
es: La expansión es una cadena que es el valor de @var{parámetro} con secuencias de escape de barras bajas expandidas con el mecanismo de entrecomillado @code{$'@dots{}'}.

source: The expansion is a string that is the result of expanding the value of @var{parameter} as if it were a prompt string (@pxref{Controlling the Prompt}).
es: La expansión es una cadena que es el resultado de expandir el valor de @var{parámetro} como si fuera una cadena de prompt (@pxref{Controlando el Prompt}).

source: The expansion is a string in the form of an assignment statement or @code{declare} command that, if evaluated, will recreate @var{parameter} with its attributes and value.
es: La expansión es una cadena en forma de una sentencia de asignación o instrucción @code{declare} que, si se evalúa, recreará @var{parámetro} con sus atributos y valor.

source: The expansion is a string consisting of flag values representing @var{parameter}'s attributes.
es: La expansión es una cadena consistente en valores centinela que representan los atributos de @var{parámetro}.

source: If @var{parameter} is @samp{@@} or @samp{*}, the operation is applied to each positional parameter in turn, and the expansion is the resultant list. If @var{parameter} is an array variable subscripted with @samp{@@} or @samp{*}, the operation is applied to each member of the array in turn, and the expansion is the resultant list.
es: Si @var{parámetro} es @samp{@@} o @samp{*}, se aplica la operación a cada parámetro posicional en orden y la expansión es la lista resultante. Si @var{parámetro} es una variable de vector subindexada con @samp{@@} o @samp{*}, la operación se aplica a cada miembro del vector en orden y la expansión es la lista resultante.

source: The result of the expansion is subject to word splitting and pathname expansion as described below.
es: El resultado de la expansión está sujeto a la división de palabras y la expansión de nombre de archivo como se describe más abajo.

source: Command substitution allows the output of a command to replace the command itself. Command substitution occurs when a command is enclosed as follows:
es: La sustitución de instrucciones permite a la salida de una instrucción reemplazar a la propia instrucción. La sustitución de instrucción ocurre cuando se rodea una instrucción así:

source: $(@var{command})
es: $(@var{instrucción})

source: `@var{command}`
es: `@var{instrucción}`

source: Bash performs the expansion by executing @var{command} in a subshell environment and replacing the command substitution with the standard output of the command, with any trailing newlines deleted. Embedded newlines are not deleted, but they may be removed during word splitting. The command substitution @code{$(cat @var{file})} can be replaced by the equivalent but faster @code{$(< @var{file})}.
es: Bash realiza la expansión ejecutando @var{instrucción} en un entorno de subintérprete y reemplazando la sustitución de la instrucción con la salida estándar de la instrucción, con cualquier nueva línea final eliminada. Las nuevas líneas integradas no se eliminan, pero pueden ser borradas durante la división de palabras. La instrucción de sustitución @code{$(cat @var{file})} puede ser reemplazada por el equivalente pero más rápido @code{$(< @var{archivo})}.

source: When the old-style backquote form of substitution is used, backslash retains its literal meaning except when followed by @samp{$}, @samp{`}, or @samp{\}. The first backquote not preceded by a backslash terminates the command substitution. When using the @code{$(@var{command})} form, all characters between the parentheses make up the command; none are treated specially.
es: Cuando se usa la vieja forma de sustitución de comilla invertida, la barra invertida mantiene su significado literal excepto cuando es seguida por @samp{$}, @samp{`} o @samp{\}. La primera barra invertida no precedida por una barra invertida termina la sustitución de instrucción. Al usar la forma @code{$(@var{instrucción})}, todos los caracteres entre los paréntesis componen la instrucción; ninguno es tratado de forma especial.

source: Command substitutions may be nested. To nest when using the backquoted form, escape the inner backquotes with backslashes.
es: Las sustituciones de instrucciones se pueden anidar. Para anidar usando la forma de comilla invertida, escape las comillas invertidas interiores con barras invertidas.

source: If the substitution appears within double quotes, word splitting and filename expansion are not performed on the results.
es: Si la sustitución aparece entre comillas dobles, la división de palabras y la expansión de nombre de archivo no se realizan en los resultados.

source: expansion, arithmetic
es: expansión, aritmética

source: Arithmetic expansion allows the evaluation of an arithmetic expression and the substitution of the result. The format for arithmetic expansion is:
es: La expansión aritmética permite la evaluación de una expresión aritmética y la sustitución del resultado. El formato para la expansión aritmética es:

source: $(( @var{expression} ))
es: $(( @var{expresión} ))

source: The expression is treated as if it were within double quotes, but a double quote inside the parentheses is not treated specially. All tokens in the expression undergo parameter and variable expansion, command substitution, and quote removal. The result is treated as the arithmetic expression to be evaluated. Arithmetic expansions may be nested.
es: La expresión se trata como si estuviera entre comillas dobles, pero una comilla doble dentro de los paréntesis no se trata de forma especial. Todos los símbolos en la expresión pasan por la expansión de parámetro y variable, sustitución de instrucción y eliminación de comillas. El resultado se trata como la expresión aritmética a evaluar. Las expansiones aritméticas pueden ser anidadas.

source: The evaluation is performed according to the rules listed below (@pxref{Shell Arithmetic}). If the expression is invalid, Bash prints a message indicating failure to the standard error and no substitution occurs.
es: La evaluación se realiza de acuerdo a las reglas listadas abajo (@pxref{Aritmética del Intérprete}). Si la expresión es inválida, Bash imprime un mensaje indicando fallo al error estándar y no ocurre ninguna sustitución.

source: process substitution
es: sustitución de proceso

source: Process substitution allows a process's input or output to be referred to using a filename. It takes the form of
es: La sustitución de proceso permite hacer referencia a la entrada o salida de un proceso usando un nombre de archivo. Toma la forma de

source: <(@var{list})
es: <(@var{lista})

source: >(@var{list})
es: >(@var{lista})

source: The process @var{list} is run asynchronously, and its input or output appears as a filename. This filename is passed as an argument to the current command as the result of the expansion. If the @code{>(@var{list})} form is used, writing to the file will provide input for @var{list}. If the @code{<(@var{list})} form is used, the file passed as an argument should be read to obtain the output of @var{list}. Note that no space may appear between the @code{<} or @code{>} and the left parenthesis, otherwise the construct would be interpreted as a redirection. Process substitution is supported on systems that support named pipes (@sc{fifo}s) or the @file{/dev/fd} method of naming open files.
es: La @var{lista} de proceso es ejecutada asíncronamente, y su entrada o salida aparece como un nombre de archivo. Este nombre de archivo es pasado como un argumento a la instrucción actual como el resultado de la expansión. Si se usa la forma @code{>(@var{lista})}, el archivo pasado como un argumento debería ser leído para obtener la salida de @var{lista}. Observe que no puede aparecer ningún espacio entre @code{<} o @code{>} y el paréntesis izquierdo, de lo contrario la construcción sería interpretada como una redirección. La sustitución de procesos está soportada en sistemas que admiten tuberías nombradas (@sc{fifo}s) o el método @file{/dev/fd} de nombrar archivos abiertos.

source: When available, process substitution is performed simultaneously with parameter and variable expansion, command substitution, and arithmetic expansion.
es: Cuando está disponible, la sustitución de proceso se realiza simultáneamente con la expansión de parámetro y de variable, la sustitución de instrucción y la expansión aritmética.

source: The shell scans the results of parameter expansion, command substitution, and arithmetic expansion that did not occur within double quotes for word splitting.
es: El intérprete escanea los resultados de la expansión de parámetros, la sustitución de instrucción y la expansión aritmética que no ocurrieron dentro de comillas dobles para división de palabras.

source: The shell treats each character of @env{$IFS} as a delimiter, and splits the results of the other expansions into words using these characters as field terminators. If @env{IFS} is unset, or its value is exactly @code{<space><tab><newline>}, the default, then sequences of @code{ <space>}, @code{<tab>}, and @code{<newline>} at the beginning and end of the results of the previous expansions are ignored, and any sequence of @env{IFS} characters not at the beginning or end serves to delimit words. If @env{IFS} has a value other than the default, then sequences of the whitespace characters @code{space}, @code{tab}, and @code{newline} are ignored at the beginning and end of the word, as long as the whitespace character is in the value of @env{IFS} (an @env{IFS} whitespace character). Any character in @env{IFS} that is not @env{IFS} whitespace, along with any adjacent @env{IFS} whitespace characters, delimits a field. A sequence of @env{IFS} whitespace characters is also treated as a delimiter. If the value of @env{IFS} is null, no word splitting occurs.
es: El intérprete trata cada carácter de @env{$IFS} como un delimitador y divide los resultados de las otras expansiones en palabras usando estos caracteres como terminadores de campos. Si @env{IFS} no está habilitado o su valor es exactamente @code{<espacio><tabulación><nueva línea>}, el predeterminado, las secuencias de @code{<espacio>}, @code{<tabulación>} y @code{<nueva línea>} al principio y el final de los resultados de las expansiones previas son ignorados, y cualquier secuencia de caracteres @env{IFS} que no estén al principio o al final sirve para delimitar palabras. Si @env{IFS} tiene un valor distinto al predeterminado, las secuencias de caracteres de espacios en blanco @code{espacio}, @code{tabulación} y @code{nueva línea} son ignoradas al principio y final de la palabra, mientras que el carácter de espacio en blanco esté en el valor de @env{IFS} (un carácter en blanco de @env{IFS}). Cualquier carácter en @env{IFS} que no sea un espacio en blanco de @env{IFS}, junto a algún carácter de espacio en blanco de @env{IFS}, delimita un campo. Una secuencia de caracteres de espacio en blanco de @env{IFS} también se trata como un delimitador. Si el valor de @env{IFS} es nulo, no ocurre ninguna división de palabra.

source: Explicit null arguments (@code{""} or @code{''}) are retained and passed to commands as empty strings. Unquoted implicit null arguments, resulting from the expansion of parameters that have no values, are removed. If a parameter with no value is expanded within double quotes, a null argument results and is retained and passed to a command as an empty string. When a quoted null argument appears as part of a word whose expansion is non-null, the null argument is removed. That is, the word @code{-d''} becomes @code{-d} after word splitting and null argument removal.
es: Los argumentos explícitamente nulos (@code{""} o @code{''}) son conservados y pasados a instrucciones como cadenas vacías. Los argumentos nulos implícitos, resultantes de la expansión de parámetros que no tiene valores, son eliminados. Si un parámetro sin valor se expande entre comillas dobles, resulta en un argumento nulo y es retenido y pasado a una instrucción como una cadena vacía. Cuando un argumento nulo entrecomillado aparece como parte de una palabra cuya expansión no es nula, se elimina el argumento nulo. Es decir, la palabra @code{-d"} se convierte en @code{-d} después de la división de palabras y la eliminación de argumentos nulos.

source: Note that if no expansion occurs, no splitting is performed.
es: Observe que si no ocurre ninguna expansión, no se realiza ninguna división.

source: Pattern Matching
es: Coincidencia de Patrones
