Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: When invoked as @code{sh}, Bash enters @sc{posix} mode after reading the startup files.
es: Cuando se llama como @code{sh}, Bash entra al modo @sc{posix} después de leer los archivos de inicio.

source: The following list is what's changed when `@sc{posix} mode' is in effect:
es: La siguiente lista es lo que se cambia cuando el `modo @sc{posix}' tiene efecto:

source: Bash ensures that the @env{POSIXLY_CORRECT} variable is set.
es: Bash se asegura de que la variable @env{POSIXLY_CORRECT} esta habilitada.

source: When a command in the hash table no longer exists, Bash will re-search @env{$PATH} to find the new location. This is also available with @samp{shopt -s checkhash}.
es: Cuando una instrucción en la tabla hash ya no existe, Bash volverá a inspeccionar @env{$PATH} para encontrar la nueva ubicación. Esto también está disponible con @samp{shopt -s checkhash}.

source: The message printed by the job control code and builtins when a job exits with a non-zero status is `Done(status)'.
es: El mensaje imprimido por el código de control de tareas y las instrucciones integradas cuando una tarea finaliza con un estado distinto a cero es `Hecho(estado)'.

source: The message printed by the job control code and builtins when a job is stopped is `Stopped(@var{signame})', where @var{signame} is, for example, @code{SIGTSTP}.
es: El mensaje imprimido por el código de control de tareas y las instrucciones integradas cuando una tarea es detenida es `Detenido(@var{nombre-señal})', donde @var{nombre-señal} es, por ejemplo, @code{SIGTSTP}.

source: Alias expansion is always enabled, even in non-interactive shells.
es: La expansión de alias está siempre activada, incluso en intérpretes no interactivos.

source: Reserved words appearing in a context where reserved words are recognized do not undergo alias expansion.
es: Las palabras reservadas que aparecen en un contexto donde se reconocen las palabras reservadas no experimentan la expansión de alias.

source: The @sc{posix} @env{PS1} and @env{PS2} expansions of @samp{!} to the history number and @samp{!!} to @samp{!} are enabled, and parameter expansion is performed on the values of @env{PS1} and @env{PS2} regardless of the setting of the @code{promptvars} option.
es: Las expansiones @sc{posix} @env{PS1} and @env{PS2} de @samp{!} para el número de historial y @samp{!!} a @samp{!} son habilitadas, y la expansión de parámetro se realiza en los valores de @env{PS1} y @env{PS2} sin importar la configuración de la opción @code{promptvars}.

source: The @sc{posix} startup files are executed (@env{$ENV}) rather than the normal Bash files.
es: Los archivo de inicio @sc{posix} son ejecutados (@env{$ENV}) en lugar de los archivos normales de Bash.

source: Tilde expansion is only performed on assignments preceding a command name, rather than on all assignment statements on the line.
es: La expansión de virgulilla solo se realiza en asignaciones que preceden un nombre de instrucción, en vez de en todas las sentencias de asignación en la línea.

source: The default history file is @file{~/.sh_history} (this is the default value of @env{$HISTFILE}).
es: El archivo predeterminado del historial es @file{~/.sh_history} (este es el valor predeterminado de @env{$HISTFILE}).

source: Redirection operators do not perform filename expansion on the word in the redirection unless the shell is interactive.
es: Los operadores de redirección no realizan la expansión de nombre de archivo en la palabra en la redirección a no ser que el intérprete sea interactivo.

source: Redirection operators do not perform word splitting on the word in the redirection.
es: Los operadores de redirección no realizan división de palabras en la palabra en la redirección.

source: Function names must be valid shell @code{name}s. That is, they may not contain characters other than letters, digits, and underscores, and may not start with a digit. Declaring a function with an invalid name causes a fatal syntax error in non-interactive shells.
es: Los nombres de funciones deben ser @code{nombre}s válidos del intérprete. Es decir, no pueden contener caracteres distintos de letras, dígitos, barras bajas y no pueden empezar con un dígito. Declarar una función con un nombre inválido causa un error de sintaxis fatal en intérpretes no interactivos.

source: Function names may not be the same as one of the @sc{posix} special builtins.
es: Los nombres de funciones no pueden ser los mismos que una de las instrucciones integradas especiales @sc{posix}.

source: @sc{posix} special builtins are found before shell functions during command lookup.
es: Las instrucciones integradas especiales @sc{posix} son encontradas antes que las funciones del intérprete durante la búsqueda de instrucción.

source: When printing shell function definitions (e.g., by @code{type}), Bash does not print the @code{function} keyword.
es: Al imprimir definiciones de función del intérprete (p. ej., por @code{type}), Bash no imprime la palabra clave @code{función}.

source: Literal tildes that appear as the first character in elements of the @env{PATH} variable are not expanded as described above under @ref{Tilde Expansion}.
es: Las virgulillas literales que aparecen como el primer carácter en elementos de la variable @env{PATH} no son expandidas como se describe anteriormente bajo @ref{Expansión de Virgulilla}.

source: The @code{time} reserved word may be used by itself as a command. When used in this way, it displays timing statistics for the shell and its completed children. The @env{TIMEFORMAT} variable controls the format of the timing information.
es: La palabra reservada @code{time} puede ser usada por sí misma como una instrucción. Cuando se usa de esta forma, muestra las estadísticas de tiempo para el intérprete y sus hijos completados. La variable @env{TIMEFORMAT} controla el formato de la información de tiempo.

source: When parsing and expanding a $@{@dots{}@} expansion that appears within double quotes, single quotes are no longer special and cannot be used to quote a closing brace or other special character, unless the operator is one of those defined to perform pattern removal. In this case, they do not have to appear as matched pairs.
es: Al analizar y expandir una expansión $@{@dots{}@} que aparece dentro de comillas dobles, las comillas simples ya no son especiales y no pueden usarse para entrecomillar una llave de cierre u otro carácter especial, a no ser que el operador sea uno de aquellos definidos para realizar la eliminación de patrón. En este caso, no tienen que aparecer como parejas emparejadas.

source: The parser does not recognize @code{time} as a reserved word if the next token begins with a @samp{-}.
es: El analizador no reconoce @code{time} como una palabra reservada si el siguiente símbolo empieza por un @samp{-}.

source: The @samp{!} character does not introduce history expansion within a double-quoted string, even if the @code{histexpand} option is enabled.
es: El carácter @samp{!} no introduce la expansión del historial dentro de una cadena de comillas dobles, incluso si la opción @code{histexpand} está habilitada.

source: If a @sc{posix} special builtin returns an error status, a non-interactive shell exits. The fatal errors are those listed in the @sc{posix} standard, and include things like passing incorrect options, redirection errors, variable assignment errors for assignments preceding the command name, and so on.
es: Si una instrucción integrada especial @sc{posix} devuelve un estado de error, finaliza un intérprete no interactivo. Los errores fatales son aquellos listados en el estándar @sc{posix}, e incluyen cosas como pasar opciones incorrectas, errores de redirección, errores de asignación de variables para asignaciones que preceden al nombre de la instrucción y demás.

source: A non-interactive shell exits with an error status if a variable assignment error occurs when no command name follows the assignment statements. A variable assignment error occurs, for example, when trying to assign a value to a readonly variable.
es: Un intérprete no interactivo finaliza con un estado de error si un error de asignación de variable ocurre cuando ningún nombre de instrucción sigue a las sentencias de asignación. Un error de asignación de variable ocurre, por ejemplo, al intentar asignar un valor a una variable de solo lectura.

source: A non-interactive shell exits with an error status if a variable assignment error occurs in an assignment statement preceding a special builtin, but not with any other simple command.
es: Un intérprete no interactivo finaliza con un estado de error si un error de asignación de variable ocurre en una sentencia de asignación que precede a una instrucción integrada especial, pero no con cualquier otra instrucción simple.

source: A non-interactive shell exits with an error status if the iteration variable in a @code{for} statement or the selection variable in a @code{select} statement is a readonly variable.
es: Un intérprete no interactivo finaliza con un estado de error si la variable de iteración en una sentencia @code{for} o la variable de selección en una sentencia @code{select} es una variable de solo lectura.

source: Non-interactive shells exit if @var{filename} in @code{.} @var{filename} is not found.
es: Los intérpretes no interactivos finalizan si @var{nombre-de-archivo} en @code{.} @var{nombre-de-archivo} no se encuentra.

source: Non-interactive shells exit if a syntax error in an arithmetic expansion results in an invalid expression.
es: Los intérpretes no interactivos finalizan si un error de sintaxis en una expansión aritmética resulta en una expresión inválida.

source: Non-interactive shells exit if a parameter expansion error occurs.
es: Los intérpretes no interactivos finalizan si ocurre un error de expansión de parámetro.

source: Non-interactive shells exit if there is a syntax error in a script read with the @code{.} or @code{source} builtins, or in a string processed by the @code{eval} builtin.
es: Los intérpretes no interactivos finalizan si hay un error de sintaxis en un guion leído con las instrucciones integradas @code{.} o @code{source}, o en una cadena procesada por la instrucción integrada @code{eval}.

source: Process substitution is not available.
es: La sustitución de procesos no está disponible.

source: While variable indirection is available, it may not be applied to the @samp{#} and @samp{?} special parameters.
es: Aunque la indirección de variable está disponible, no puede ser aplicada a los parámetros especiales @samp{#} y @samp{?}.

source: When expanding the @samp{*} special parameter in a pattern context where the expansion is double-quoted does not treat the @code{$*} as if it were double-quoted.
es: Al expandir el parámetro especial @samp{*} en un contexto de patrón donde la expansión está entre comillas dobles no trata el @code{$*} como si estuviera entre comillas dobles.

source: Assignment statements preceding @sc{posix} special builtins persist in the shell environment after the builtin completes.
es: Las sentencias de asignación que preceden a las instrucciones integradas especiales @sc{posix} persisten en el entorno del intérprete después de que la instrucción integrada se completa.

source: Assignment statements preceding shell function calls persist in the shell environment after the function returns, as if a @sc{posix} special builtin command had been executed.
es: Las sentencias de asignación que preceden llamadas a la función del intérprete persisten en el entorno del intérprete después de que la función retorne, como si hubiera sido ejecutada una instrucción integrada especial @sc{posix}.

source: The @code{command} builtin does not prevent builtins that take assignment statements as arguments from expanding them as assignment statements; when not in @sc{posix} mode, assignment builtins lose their assignment statement expansion properties when preceded by @code{command}.
es: La instrucción integrada especial @code{command} no evita que las instrucciones integradas tomen sentencias de asignación como argumentos de expandirlos como sentencias de asignación; cuando no está en modo @sc{posix}, las instrucciones integradas de asignación pierden sus propiedades de expansión de sentencias de asignación al ser precedidas por @code{command}.

source: The @code{bg} builtin uses the required format to describe each job placed in the background, which does not include an indication of whether the job is the current or previous job.
es: La instrucción integrada @code{bg} usa el formato requerido para describir cada tarea ubicada en segundo plano, que no incluye una indicación de si la tarea es la tarea actual o previa.

source: The output of @samp{kill -l} prints all the signal names on a single line, separated by spaces, without the @samp{SIG} prefix.
es: La salida de @samp{kill -l} imprime todos los nombres de señal en una sola línea, separados por espacios, sin el prefijo @samp{SIG}.

source: The @code{kill} builtin does not accept signal names with a @samp{SIG} prefix.
es: La instrucción integrada @code{kill} no acepta nombres de señal con un prefijo @samp{SIG}.

source: The @code{export} and @code{readonly} builtin commands display their output in the format required by @sc{posix}.
es: Las instrucciones integradas @code{export} y @code{readonly} muestran su salida en el formato requerido por @sc{posix}.

source: The @code{trap} builtin displays signal names without the leading @code{SIG}.
es: La instrucción integrada @code{trap} muestra nombres de señales sin el @code{SIG} inicial.

source: The @code{trap} builtin doesn't check the first argument for a possible signal specification and revert the signal handling to the original disposition if it is, unless that argument consists solely of digits and is a valid signal number. If users want to reset the handler for a given signal to the original disposition, they should use @samp{-} as the first argument.
es: La instrucción integrada @code{trap} no comprueba el primer argumento en busca de una posible especificación de señal y revierte el manejo de tareas a la disposición original si está, a no ser que el argumento consista exclusivamente de dígitos y sea un número de señal válido. Si los usuarios quieren restablecer el manejador para una señal dada a la disposición original, deben usar @samp{-} como el primer argumento.

source: The @code{.} and @code{source} builtins do not search the current directory for the filename argument if it is not found by searching @env{PATH}.
es: Las instrucciones integradas @code{.} y @code{source} no buscan el directorio actual en busca del argumento de nombre de archivo si no es encontrado explorando @env{PATH}.

source: Enabling @sc{posix} mode has the effect of setting the @code{inherit_errexit} option, so subshells spawned to execute command substitutions inherit the value of the @option{-e} option from the parent shell. When the @code{inherit_errexit} option is not enabled, Bash clears the @option{-e} option in such subshells.
es: Activar el modo @sc{posix} tiene el efecto de ajustar la opción @code{inherit_errexit}, de forma que los subintérpretes creados para ejecutar sustituciones de instrucciones heredan el valor de la opción @option{-e} del intérprete padre. Cuando no está activada la opción @option{inherit_errexit}, Bash limpia la opción @option{-e} en tales subintérpretes.

source: Enabling @sc{posix} mode has the effect of setting the @code{shift_verbose} option, so numeric arguments to @code{shift} that exceed the number of positional parameters will result in an error message.
es: Habilitar el modo @sc{posix} tiene el efecto de activar la opción @code{shift_verbose}, para que los argumentos numéricos de @code{shift} que excedan el número de parámetros posicionales produzca un mensaje de error.

source: When the @code{alias} builtin displays alias definitions, it does not display them with a leading @samp{alias } unless the @option{-p} option is supplied.
es: Cuando la instrucción integrada @code{alias} muestra definiciones de aliases, no las muestra con un @samp{alias } inicial a no ser que se proporcione la opción @option{-p}.

source: When the @code{set} builtin is invoked without options, it does not display shell function names and definitions.
es: Cuando instrucción integrada @code{set} es llamada sin opciones, no muestra los nombres y las definiciones de las funciones del intérprete.

source: When the @code{set} builtin is invoked without options, it displays variable values without quotes, unless they contain shell metacharacters, even if the result contains nonprinting characters.
es: Cuando la instrucción integrada @code{set} es llamada sin opciones, muestra valores de variables sin comillas, a no ser que contengan metacaracteres del intérprete, incluso si el resultado contiene caracteres no imprimibles.

source: When the @code{cd} builtin is invoked in @var{logical} mode, and the pathname constructed from @code{$PWD} and the directory name supplied as an argument does not refer to an existing directory, @code{cd} will fail instead of falling back to @var{physical} mode.
es: Cuando la instrucción integrada @code{cd} es llamada en modo @var{logical}, y el nombre de ruta construido de @code{$PWD} y el nombre de directorio proporcionado como un argumento no se refiere a un directorio existente, @code{cd} fallará en vez de recurrir al modo @var{physical}.

source: When the @code{cd} builtin cannot change a directory because the length of the pathname constructed from @code{$PWD} and the directory name supplied as an argument exceeds @var{PATH_MAX} when all symbolic links are expanded, @code{cd} will fail instead of attempting to use only the supplied directory name.
es: Cuando la instrucción integrada builtin no puede cambiar de directorio porque la longitud del nombre de ruta construido a partir de @code{$PWD} y el nombre de directorio proporcionado como argumento excede @var{PATH_MAX} cuando se expanden todos los enlaces simbólicos, @code{cd} fallará en vez de intentar usar solo el nombre de directorio proporcionado.

source: The @code{pwd} builtin verifies that the value it prints is the same as the current directory, even if it is not asked to check the file system with the @option{-P} option.
es: La instrucción integrada @code{pwd} verifica que el valor que imprime es el mismo que el directorio actual, incluso si no se le pide que compruebe el sistema de ficheros con la opción @option{-P}.

source: When listing the history, the @code{fc} builtin does not include an indication of whether or not a history entry has been modified.
es: Al listar el historial, la instrucción integrada @code{fc} no incluye una indicación de si ha sido modificada o no una entrada del historial.

source: The default editor used by @code{fc} is @code{ed}.
es: El editor predeterminado usado por @code{fc} es @code{ed}.

source: The @code{type} and @code{command} builtins will not report a non-executable file as having been found, though the shell will attempt to execute such a file if it is the only so-named file found in @code{$PATH}.
es: Las instrucciones integradas @code{type} y @code{command} no presentan un archivo no ejecutable como encontrado, aunque el intérprete tratará de ejecutar tal archivo si es el único archivo así llamado encontrado en @code{$PATH}.

source: The @code{vi} editing mode will invoke the @code{vi} editor directly when the @samp{v} command is run, instead of checking @code{$VISUAL} and @code{$EDITOR}.
es: El modo de edición @code{vi} llamará al editor @code{vi} directamente cuando se ejecute la instrucción @samp{v}, en vez de comprobar @code{$VISUAL} y @code{$EDITOR}.

source: When the @code{xpg_echo} option is enabled, Bash does not attempt to interpret any arguments to @code{echo} as options. Each argument is displayed, after escape characters are converted.
es: Cuando está habilitada la opción @option{xpg_echo}, Bash no trata de interpretar los argumentos de @code{echo} como opciones. Cada argumento se muestra, después de que los caracteres de escape son convertidos.

source: The @code{ulimit} builtin uses a block size of 512 bytes for the @option{-c} and @option{-f} options.
es: La instrucción integrada @code{ulimit} usa un tamaño de bloque de 512 bytes para las opciones @option{-c} y @option{-f}.

source: The arrival of @code{SIGCHLD} when a trap is set on @code{SIGCHLD} does not interrupt the @code{wait} builtin and cause it to return immediately. The trap command is run once for each child that exits.
es: La llegada de @code{SIGCHLD} cuando una trap está establecida en @code{SIGCHLD} no interrumpe la instrucción integrada @code{wait} y hace que retorne inmediatamente. La instrucción trap es ejecutada una vez por cada hijo que finalice.

source: The @code{read} builtin may be interrupted by a signal for which a trap has been set. If Bash receives a trapped signal while executing @code{read}, the trap handler executes and @code{read} returns an exit status greater than 128.
es: La instrucción integrada @code{read} puede ser interrumpida por una señal para la cual ha sido establecida un trap. Si Bash recibe una señal atrapada mientra ejecuta @code{read}, el manejador de trap se ejecuta y @code{read} devuelve un estado de error mayor que 128.

source: Bash removes an exited background process's status from the list of such statuses after the @code{wait} builtin is used to obtain it.
es: Bash elimina el estado de un proceso en segundo plano finalizado de la lista de tales estados después de que la instrucción integrada @code{wait} sea usada para obtenerlo.

source: There is other @sc{posix} behavior that Bash does not implement by default even when in @sc{posix} mode. Specifically:
es: Hay otro comportamiento @sc{posix} que Bash no implementa por defecto incluso en modo @sc{posix}. Específicamente:

source: The @code{fc} builtin checks @code{$EDITOR} as a program to edit history entries if @code{FCEDIT} is unset, rather than defaulting directly to @code{ed}. @code{fc} uses @code{ed} if @code{EDITOR} is unset.
es: La instrucción integrada @code{fc} comprueba @code{$EDITOR} como un programa para editar entrada de historial si @code{FCEDIT} está sin asignar, en vez de recurrir directamente a @code{ed}. @code{fc} usa @code{ed} si @code{EDITOR} está sin asignar.

source: As noted above, Bash requires the @code{xpg_echo} option to be enabled for the @code{echo} builtin to be fully conformant.
es: Como se indica anteriormente, Bash requiere que la opción @code{xpg_echo} esté activada para la instrucción integrada @code{echo} para ser completamente conforme.

source: Bash can be configured to be @sc{posix}-conformant by default, by specifying the @option{--enable-strict-posix-default} to @code{configure} when building (@pxref{Optional Features}).
es: Bash puede configurarse para que sea conforme con @sc{posix} por defecto, especificando la @option{--enable-strict-posix-default} para @code{configure} al construir (@pxref{Funcionalidades Opcionales}).

source: This chapter discusses what job control is, how it works, and how Bash allows you to access its facilities.
es: Este capítulo discute qué es el control de tareas, cómo funciona y cómo Bash le permite acceder a sus herramientas.

source: Job Control Basics
es: Fundamentos del Control de Tareas

source: How job control works.
es: Cómo funciona el control de tareas.

source: Job Control Builtins
es: Instrucciones Integradas de Control de Tareas

source: Bash builtin commands used to interact with job control.
es: Instrucciones integradas de Bash usadas para interactuar con el control de tareas.

source: Job Control Variables
es: Variables de Control de Tareas

source: Variables Bash uses to customize job control.
es: Variables que Bash usa para personalizar el control de tareas.

source: foreground
es: frente

source: background
es: fondo
