Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: -k @var{file}
es: -k @var{archivo}

source: True if @var{file} exists and its "sticky" bit is set.
es: Verdadero si @var{archivo} existe y su bit «pegajoso» está establecido.

source: -p @var{file}
es: -p @var{archivo}

source: True if @var{file} exists and is a named pipe (FIFO).
es: Verdadero si @var{archivo} existe y es una tubería con nombre (FIFO).

source: -r @var{file}
es: -r @var{archivo}

source: True if @var{file} exists and is readable.
es: Verdadero si @var{archivo} existe y es legible.

source: -s @var{file}
es: -s @var{archivo}

source: True if @var{file} exists and has a size greater than zero.
es: Verdadero si @var{archivo} existe y tiene un tamaño mayor que cero.

source: -t @var{fd}
es: -t @var{da}

source: True if file descriptor @var{fd} is open and refers to a terminal.
es: Verdadero si el descriptor de archivo @var{da} está abierto si se refiere a una terminal.

source: -u @var{file}
es: -u @var{archivo}

source: True if @var{file} exists and its set-user-id bit is set.
es: Verdadero si @var{archivo} existe y su bit set-user-id está establecido.

source: -w @var{file}
es: -w @var{archivo}

source: True if @var{file} exists and is writable.
es: Verdadero si @var{archivo} existe y es escribible.

source: -x @var{file}
es: -x @var{archivo}

source: True if @var{file} exists and is executable.
es: Verdadero si @var{archivo} existe y es ejecutable.

source: -G @var{file}
es: -G @var{archivo}

source: True if @var{file} exists and is owned by the effective group id.
es: Verdadero si @var{archivo} existe y está poseído por el id de grupo efectivo.

source: -L @var{file}
es: -L @var{archivo}

source: -N @var{file}
es: -N @var{archivo}

source: True if @var{file} exists and has been modified since it was last read.
es: Verdadero si @var{archivo} existe y ha sido modificado desde que fue leído por última vez.

source: -O @var{file}
es: -O @var{archivo}

source: True if @var{file} exists and is owned by the effective user id.
es: Verdadero si @var{archivo} existe y está poseído por el id de usuario efectivo.

source: -S @var{file}
es: -S @var{archivo}

source: True if @var{file} exists and is a socket.
es: Verdadero si @var{archivo} existe y es un socket.

source: @var{file1} -ef @var{file2}
es: @var{archivo1} -ef @var{archivo2}

source: True if @var{file1} and @var{file2} refer to the same device and inode numbers.
es: Verdadero si @var{archivo1} y @var{archivo2} se refieren a los mismos números de dispositivo y de inodo.

source: @var{file1} -nt @var{file2}
es: @var{archivo1} -nt @var{archivo2}

source: True if @var{file1} is newer (according to modification date) than @var{file2}, or if @var{file1} exists and @var{file2} does not.
es: Verdadero si @var{archivo1} es más nuevo (según la fecha de modificación) que @var{archivo2}, o si @var{archivo1} existe y @var{archivo2} no.

source: @var{file1} -ot @var{file2}
es: @var{archivo1} -ot @var{archivo2}

source: True if @var{file1} is older than @var{file2}, or if @var{file2} exists and @var{file1} does not.
es: Verdadero si @var{archivo1} es más viejo que @var{archivo2}, o si @var{archivo2} existe y @var{archivo1} no.

source: -o @var{optname}
es: -o @var{nombre-de-opc}

source: True if the shell option @var{optname} is enabled. The list of options appears in the description of the @option{-o} option to the @code{set} builtin (@pxref{The Set Builtin}).
es: Verdadero si la opción del intérprete @var{nombre-de-opc} está habilitada. La lista de opciones aparece en la descripción de la opción @option{-o} de la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}).

source: -v @var{varname}
es: -v @var{nombre-de-var}

source: True if the shell variable @var{varname} is set (has been assigned a value).
es: Verdadero si la variable del intérprete @var{nombre-de-var} está establecida (se le ha asignado un valor).

source: -R @var{varname}
es: -R @var{nombre-de-var}

source: True if the shell variable @var{varname} is set and is a name reference.
es: Verdadero si la variable del intérprete @var{nombre-de-var} está establecida y es una referencia de nombre.

source: -z @var{string}
es: -z @var{cadena}

source: True if the length of @var{string} is zero.
es: Verdadero si la longitud de @var{cadena} es cero.

source: -n @var{string}
es: -n @var{cadena}

source: string
es: cadena

source: True if the length of @var{string} is non-zero.
es: Verdadero si la longitud de @var{cadena} es distinta de cero.

source: @var{string1} == @var{string2}
es: @var{cadena1} == @var{cadena2}

source: @var{string1} = @var{string2}
es: @var{cadena1} = @var{cadena2}

source: True if the strings are equal. When used with the @code{[[} command, this performs pattern matching as described above (@pxref{Conditional Constructs}).
es: Verdadero si las cadenas son iguales. Cuando se usa con la instrucción @code{[[}, esto realiza la coincidencia de patrones como se describió anteriormente (@pxref{Construcciones Condicionales}).

source: @samp{=} should be used with the @code{test} command for @sc{posix} conformance.
es: @samp{=} debería usarse con la instrucción @code{test} para la conformidad con @sc{posix}.

source: @var{string1} != @var{string2}
es: @var{cadena1} != @var{cadena2}

source: True if the strings are not equal.
es: Verdadero si las cadenas no son iguales.

source: @var{string1} < @var{string2}
es: @var{cadena1} < @var{cadena2}

source: True if @var{string1} sorts before @var{string2} lexicographically.
es: Verdadero si @var{cadena1} se ordena lexicográficamente antes que @var{cadena2}.

source: @var{string1} > @var{string2}
es: @var{cadena1} > @var{cadena2}

source: True if @var{string1} sorts after @var{string2} lexicographically.
es: Verdadero si @var{cadena1} se ordena lexicográficamente después que @var{cadena2}.

source: @code{OP} is one of @samp{-eq}, @samp{-ne}, @samp{-lt}, @samp{-le}, @samp{-gt}, or @samp{-ge}. These arithmetic binary operators return true if @var{arg1} is equal to, not equal to, less than, less than or equal to, greater than, or greater than or equal to @var{arg2}, respectively. @var{Arg1} and @var{arg2} may be positive or negative integers. When used with the @code{[[} command, @var{Arg1} and @var{Arg2} are evaluated as arithmetic expressions (@pxref{Shell Arithmetic}).
es: @code{OP} es uno de @samp{-eq}, @samp{-ne}, @samp{-lt}, @samp{-le}, @samp{-gt} o @samp{-ge}. Estos operadores aritméticos binarios devuelven verdadero si @var{arg1} es igual a, no igual a, menor que, menor que o igual a, mayor que, mayor que o igual a @var{arg2}, respectivamente. @var{Arg1} y @var{arg2} pueden ser enteros positivos o negativos. Cuando se usa con la instrucción @code{[[}, @var{Arg1} y @var{Arg2} se evalúan como expresiones aritméticas (@pxref{Aritmética del Intérprete}).

source: arithmetic, shell
es: aritmética, intérprete

source: shell arithmetic
es: aritmética del intérprete

source: expressions, arithmetic
es: expresiones, aritméticas

source: evaluation, arithmetic
es: evaluación, aritmética

source: arithmetic evaluation
es: evaluación aritmética

source: The shell allows arithmetic expressions to be evaluated, as one of the shell expansions or by using the @code{((} compound command, the @code{let} builtin, or the @option{-i} option to the @code{declare} builtin.
es: El intérprete permite evaluar expresiones aritméticas, como una de las expansiones del intérprete o usando la instrucción compuesta @code{((}, la instrucción integrada @code{let} o la opción @option{-i} de la instrucción integrada @code{declare}.

source: Evaluation is done in fixed-width integers with no check for overflow, though division by 0 is trapped and flagged as an error. The operators and their precedence, associativity, and values are the same as in the C language. The following list of operators is grouped into levels of equal-precedence operators. The levels are listed in order of decreasing precedence.
es: La evaluación se hace en enteros de anchura fija sin comprobar por desbordamiento, aunque se atrapa la división entre 0 y se marca como error. Los operadores y su precedencia, asociatividad y valores son los mismos que en lenguaje C. La siguiente lista de operadores está agrupada en niveles de operadores de igual precedencia. Los niveles son listados en orden de precedencia decreciente.

source: variable post-increment and post-decrement
es: postincremento y postdecremento de variable

source: variable pre-increment and pre-decrement
es: preincremento y predecremento de variable

source: unary minus and plus
es: menos y más unarios

source: logical and bitwise negation
es: negación lógica y a nivel de bit

source: exponentiation
es: exponenciación

source: multiplication, division, remainder
es: multiplicación, división, resto

source: addition, subtraction
es: adición, sustracción

source: left and right bitwise shifts
es: desplazamientos de bit a izquierda y derecha

source: comparison
es: comparación

source: equality and inequality
es: igualdad y desigualdad

source: bitwise AND
es: AND a nivel de bit

source: bitwise exclusive OR
es: OR exclusivo a nivel de bit

source: bitwise OR
es: OR a nivel de bit

source: logical AND
es: AND lógico

source: logical OR
es: OR lógico

source: conditional operator
es: operador condicional

source: assignment
es: asignación

source: comma
es: coma

source: Shell variables are allowed as operands; parameter expansion is performed before the expression is evaluated. Within an expression, shell variables may also be referenced by name without using the parameter expansion syntax. A shell variable that is null or unset evaluates to 0 when referenced by name without using the parameter expansion syntax. The value of a variable is evaluated as an arithmetic expression when it is referenced, or when a variable which has been given the @var{integer} attribute using @samp{declare -i} is assigned a value. A null value evaluates to 0. A shell variable need not have its @var{integer} attribute turned on to be used in an expression.
es: Las variables del intérprete se permiten como operandos; la expansión de parámetro se realiza antes de que se evalúe la expresión. Dentro de una expresión, las variables del intérprete también pueden ser referenciadas por nombre sin usar la sintaxis de expansión de parámetros. Una variable del intérprete que es nula o no asignada evalúa a 0 cuando se referencia por nombre sin usar la sintaxis de expansión de parámetro. El valor de una variable se evalúa como una expresión aritmética cuando es referenciado o cuando a una variable a la que se le ha dado el atributo @var{integer} usando @samp{declare -i} se le asigna un valor. Un valor nulo evalúa a 0. Una variable del intérprete no tiene que tener su atributo @var{integer} activado para usarse en una expresión.

source: Constants with a leading 0 are interpreted as octal numbers. A leading @samp{0x} or @samp{0X} denotes hexadecimal. Otherwise, numbers take the form [@var{base}@code{#}]@var{n}, where the optional @var{base} is a decimal number between 2 and 64 representing the arithmetic base, and @var{n} is a number in that base. If @var{base}@code{#} is omitted, then base 10 is used. When specifying @var{n}, the digits greater than 9 are represented by the lowercase letters, the uppercase letters, @samp{@@}, and @samp{_}, in that order. If @var{base} is less than or equal to 36, lowercase and uppercase letters may be used interchangeably to represent numbers between 10 and 35.
es: Las constantes con un 0 inicial se interpretan como números octales. Un @samp{0x} o @samp{0X} denota hexadecimal. De lo contrario, los números toman la forma [@var{base}@code{#}]@var{n}, dona la @var{base} opcional es un número hexadecimal entre 2 y 64 que representa la base aritmética y @var{n} es un número en esa base. Si se omite @var{base}@code{#}, entonces se usa la base 10. Al especificar @var{n}, los dígitos mayores que 9 se representan por letras minúsculas, las letras mayúsculas, @samp{@@} y @samp{_}, en ese orden. Si @var{base} es menor o igual a 36, las letras mayúsculas y minúsculas pueden usarse de forma intercambiable para representar números entre 10 y 35.

source: Operators are evaluated in order of precedence. Sub-expressions in parentheses are evaluated first and may override the precedence rules above.
es: Los operadores se evalúan en orden de precedencia. Las subexpresiones en paréntesis se evalúan primero y pueden sobrescribir las reglas de precedencia anteriores.

source: alias expansion
es: expansión de alias

source: @var{Aliases} allow a string to be substituted for a word when it is used as the first word of a simple command. The shell maintains a list of aliases that may be set and unset with the @code{alias} and @code{unalias} builtin commands.
es: Los @var{aliases} permiten que una cadena sea sustituida por una palabra cuando se usa como la primera palabra de una instrucción simple. El intérprete mantiene una lista de aliases que puede ser establecida y eliminada con las instrucciones integradas @code{alias} y @code{unalias}.

source: The first word of each simple command, if unquoted, is checked to see if it has an alias. If so, that word is replaced by the text of the alias. The characters @samp{/}, @samp{$}, @samp{`}, @samp{=} and any of the shell metacharacters or quoting characters listed above may not appear in an alias name. The replacement text may contain any valid shell input, including shell metacharacters. The first word of the replacement text is tested for aliases, but a word that is identical to an alias being expanded is not expanded a second time. This means that one may alias @code{ls} to @code{"ls -F"}, for instance, and Bash does not try to recursively expand the replacement text. If the last character of the alias value is a @var{blank}, then the next command word following the alias is also checked for alias expansion.
es: La primera palabra de cada instrucción simple, si no está entrecomillada, se comprueba para ver si tiene un alias. En ese caso, ese palabra es reemplazada por el texto del alias. Los caracteres @samp{/}, @samp{$}, @samp{`}, @samp{=} y cualquiera de los metacaracteres o caracteres de entrecomillado del intérprete listados anteriormente no pueden aparecer en un nombre de alias. El texto de reemplazo puede contener cualquier entrada de intérprete válida, incluyendo metacaracteres del intérprete. La primera palabra de texto de reemplazo se comprueba por aliases, pero una palabra que es idéntica a un alias que está siendo expandido no se expande una segunda vez. Esto significa que uno puede crear el alias @code{ls} para @code{"ls -F"}, por ejemplo, y Bash no trata de expandir recursivamente el texto de reemplazo. Si el último carácter del valor del alias es un @var{blanco}, entonces la siguiente palabra de instrucción que sigue al alias también se comprueba para la expansión de alias.

source: Aliases are created and listed with the @code{alias} command, and removed with the @code{unalias} command.
es: Los alias son creados y listados con la instrucción @code{alias}, y eliminados con la instrucción @code{unalias}.

source: There is no mechanism for using arguments in the replacement text, as in @code{csh}. If arguments are needed, a shell function should be used (@pxref{Shell Functions}).
es: No hay mecanismo para usar argumentos en el texto de reemplazo, como en @code{csh}. Si se necesitan argumentos, se debería usar una función del intérprete (@pxref{Funciones del Intérprete}).

source: Aliases are not expanded when the shell is not interactive, unless the @code{expand_aliases} shell option is set using @code{shopt} (@pxref{The Shopt Builtin}).
es: Los aliases no se expanden cuando el intérprete no es interactivo, a no ser que esté habilitada la opción del intérprete @code{expand_aliases} usando @code{shopt} (@pxref{La Instrucción Integrada Shopt}).

source: The rules concerning the definition and use of aliases are somewhat confusing. Bash always reads at least one complete line of input, and all lines that make up a compound command, before executing any of the commands on that line or the compound command. Aliases are expanded when a command is read, not when it is executed. Therefore, an alias definition appearing on the same line as another command does not take effect until the next line of input is read. The commands following the alias definition on that line are not affected by the new alias. This behavior is also an issue when functions are executed. Aliases are expanded when a function definition is read, not when the function is executed, because a function definition is itself a command. As a consequence, aliases defined in a function are not available until after that function is executed. To be safe, always put alias definitions on a separate line, and do not use @code{alias} in compound commands.
es: Las reglas concernientes a la definición y uso de aliases son en cierto modo confusas. Bash siempre lee al menos una línea completa de entrada, y todas las l@'ineas que forman una instrucción compuesta, antes de ejecutar cualquiera de las instrucciones en esa línea o la instrucción compuesta. Los aliases se expanden cuando se lee una instrucción, no cuando se ejecuta. Por lo tanto, una definición de alias que aparece en la misma línea que otra instrucción no tiene efecto hasta que la siguiente línea de entrada es leída. Las instrucciones que siguen la definición del alias en esa línea no se ven afectadas por el nuevo alias. Este comportamiento es también un problema cuando se ejecutan funciones. Los aliases se expanden cuando se lee una definición de función, no cuando se ejecuta la función, porque una definición de función es en sí una instrucción. Como consecuencia, los aliases definidos en una función no están disponibles hasta después de que la función sea ejecutada. Para estar seguro, ponga siempre las definiciones de alias en una línea separada, y no use @code{alias} en instrucciones compuestas.

source: For almost every purpose, shell functions are preferred over aliases.
es: Para casi cualquier propósito, se prefieren las funciones del intérprete a los aliases.

source: arrays
es: vectores

source: Bash provides one-dimensional indexed and associative array variables. Any variable may be used as an indexed array; the @code{declare} builtin will explicitly declare an array. There is no maximum limit on the size of an array, nor any requirement that members be indexed or assigned contiguously. Indexed arrays are referenced using integers (including arithmetic expressions (@pxref{Shell Arithmetic})) and are zero-based; associative arrays use arbitrary strings. Unless otherwise noted, indexed array indices must be non-negative integers.
es: Bash proporciona variables de vectores indexadas y asociadas de una dimensión. Cualquier variable puede ser usada como un vector asociativo; la instrucción integrada @code{declare} declarará explícitamente un vector. No hay límite máximo sobre el tamaño de un vector, ni ningún requerimiento de que los miembros estén indexados o asignados contiguamente. Los vectores indexados son referenciados usando enteros (incluyendo expresiones aritméticas [@pxref{Aritmética del Intérprete}]) y están basados en cero; los vectores asociativos usan cadenas arbitrarias. A no ser que se indique lo contrario, los indices de vectores indexados deben ser enteros no negativos.

source: An indexed array is created automatically if any variable is assigned to using the syntax
es: Un vector indexado se crea automáticamente si se asigna alguna variable usando la sintaxis

source: @var{name}[@var{subscript}]=@var{value}
es: @var{nombre}[@var{subíndice}]=@var{valor}

source: The @var{subscript} is treated as an arithmetic expression that must evaluate to a number. To explicitly declare an array, use
es: El @var{subíndice} se trata como una expresión aritmética que debe evaluar a un número. Para declarar un vector explícitamente, use

source: declare -a @var{name}
es: declare -a @var{nombre}

source: The syntax
es: La sintaxis

source: declare -a @var{name}[@var{subscript}]
es: declare -a @var{nombre}[@var{subíndice}]

source: is also accepted; the @var{subscript} is ignored.
es: también se acepta; el @var{subíndice} es ignorado.

source: Associative arrays are created using
es: Los vectores asociativos son creados usando

source: declare -A @var{name}.
es: declare -A @var{nombre}.

source: Attributes may be specified for an array variable using the @code{declare} and @code{readonly} builtins. Each attribute applies to all members of an array.
es: Los atributos pueden ser especificados para una variable de vector usando las instrucciones integradas @code{declare} y @code{readonly}. Cada atributo se aplica a todos los miembros del vector.

source: Arrays are assigned to using compound assignments of the form
es: Los vectores son asignados usando asignaciones compuestas de la forma

source: @var{name}=(@var{value1} @var{value2} @dots{} )
es: @var{nombre}=(@var{value1} @var{value2} @dots{} )

source: where each @var{value} is of the form @code{[@var{subscript}]=}@var{string}. Indexed array assignments do not require anything but @var{string}. When assigning to indexed arrays, if the optional subscript is supplied, that index is assigned to; otherwise the index of the element assigned is the last index assigned to by the statement plus one. Indexing starts at zero.
es: donde cada @var{valor} es de la forma @code{[@var{subíndice}]=}@var{cadena}. Las asignaciones de vector indexadas no requieren nada excepto @var{cadena}. Al asignar a vectores indexados, si se proporciona el subíndice opcional, se asigna a ese índice; de lo contrario, el índice del elemento asignado es el último índice al que se ha asignado por la sentencia más uno. La indexación empieza en cero.

source: When assigning to an associative array, the subscript is required.
es: Al asignar a un vector asociativo, se requiere el subíndice.

source: This syntax is also accepted by the @code{declare} builtin. Individual array elements may be assigned to using the @code{@var{name}[@var{subscript}]=@var{value}} syntax introduced above.
es: Esta sintaxis también es aceptada por la instrucción integrada @code{declare}. A los elementos individuales de vector también se puede asignar usando la sintaxis @code{@var{nombre}[@var{subíndice}]=@var{valor}} introducida anteriormente.

source: When assigning to an indexed array, if @var{name} is subscripted by a negative number, that number is interpreted as relative to one greater than the maximum index of @var{name}, so negative indices count back from the end of the array, and an index of -1 references the last element.
es: Al asignar a un vector indexado, si @var{nombre} está subindexado por un número negativo, ese número se interpreta como relativo a uno mayor que el índice máximo de @var{nombre}, de forma que los índices negativos cuentan hacia tras desde el final del vector, y un índice de -1 hace referencia al último elemento.
