Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: When a simple command other than a builtin or shell function is to be executed, it is invoked in a separate execution environment that consists of the following. Unless otherwise noted, the values are inherited from the shell.
es: Cuando una instrucción simple distinta de una instrucción integrada o una función del intérprete va a ser ejecutada, es llamada en un entorno de ejecución aislado que consta de lo siguiente. A no ser que se indique lo contrario, los valores se heredan del intérprete.

source: the shell's open files, plus any modifications and additions specified by redirections to the command
es: los archivos abiertos del intérprete, más las modificaciones y adiciones especificadas por redirecciones a la instrucción

source: the current working directory
es: el directorio de trabajo actual

source: the file creation mode mask
es: el modo de la máscara de creación de archivos

source: shell variables and functions marked for export, along with variables exported for the command, passed in the environment (@pxref{Environment})
es: las variables y funciones del intérprete marcadas para exportar, junto a variables exportadas para la instrucción, pasadas en el entorno (@pxref{Entorno})

source: traps caught by the shell are reset to the values inherited from the shell's parent, and traps ignored by the shell are ignored
es: las traps atrapadas por el intérprete son restablecidas a los valores heredados del padre del intérprete, y las traps ignoradas por el intérprete son ignoradas

source: A command invoked in this separate environment cannot affect the shell's execution environment.
es: Una instrucción llamada en este entorno aislado no puede afectar al entorno de ejecución del intérprete.

source: Command substitution, commands grouped with parentheses, and asynchronous commands are invoked in a subshell environment that is a duplicate of the shell environment, except that traps caught by the shell are reset to the values that the shell inherited from its parent at invocation. Builtin commands that are invoked as part of a pipeline are also executed in a subshell environment. Changes made to the subshell environment cannot affect the shell's execution environment.
es: La sustitución de instrucciones, las instrucciones agrupadas con paréntesis y las instrucciones asíncronas son llamadas en un entorno de subintérprete que es una copia del entorno del intérprete, a excepción de que las traps atrapadas por el intérprete son restablecidas a los valores que el intérprete heredó de su padre durante la llamada. Las instrucciones integradas que son llamadas como parte de una tubería también son ejecutadas en un entorno de subintérprete. Los cambios hechos al entorno del subintérprete no pueden afectar al entorno de ejecución del intérprete.

source: Subshells spawned to execute command substitutions inherit the value of the @option{-e} option from the parent shell. When not in @sc{posix} mode, Bash clears the @option{-e} option in such subshells.
es: Los subintérpretes generados para ejecutar sustituciones de instrucciones heredan el valor de la opción @option{-e} del padre del intérprete. Cuando no está en modo @sc{posix}, Bash borra la opción @option{-e} en dichos subintérpretes.

source: If a command is followed by a @samp{&} and job control is not active, the default standard input for the command is the empty file @file{/dev/null}. Otherwise, the invoked command inherits the file descriptors of the calling shell as modified by redirections.
es: Si una instrucción es seguida por un @samp{&} y no está activado el control de tareas, la entrada estándar para el instrucción es el archivo vacío @file{/dev/null}. De lo contrario, la instrucción llamada hereda los descriptores de archivo del intérprete ejecutor según se modifican mediante redirección.

source: environment
es: entorno

source: When a program is invoked it is given an array of strings called the @var{environment}. This is a list of name-value pairs, of the form @code{name=value}.
es: Cuando se llama un programa se le pasa un vector de cadenas llamado el @var{entorno}. Esto es una lista de pares nombre-valor, de la forma @code{nombre=valor}.

source: Bash provides several ways to manipulate the environment. On invocation, the shell scans its own environment and creates a parameter for each name found, automatically marking it for @var{export} to child processes. Executed commands inherit the environment. The @code{export} and @samp{declare -x} commands allow parameters and functions to be added to and deleted from the environment. If the value of a parameter in the environment is modified, the new value becomes part of the environment, replacing the old. The environment inherited by any executed command consists of the shell's initial environment, whose values may be modified in the shell, less any pairs removed by the @code{unset} and @samp{export -n} commands, plus any additions via the @code{export} and @samp{declare -x} commands.
es: Bash proporciona varias formas de manipular el entorno. Durante la llamada, el intérprete escanea su propio entorno y crea un parámetro para cada nombre encontrado, automáticamente marcándolo para @var{exportar} a los procesos hijos. Las instrucciones ejecutadas heredan el entorno. Las instrucciones @code{export} y @samp{declare -x} permiten añadir y eliminar parámetros y funciones en el intérprete. Si se modifica el valor de un parámetro en el intérprete, el nuevo valor se vuelve parte del entorno, reemplazando al viejo. El entorno heredado por cualquier instrucción ejecutada consta del entorno inicial del intérprete, cuyos valores pueden ser modificados en el intérprete, menos las parejas eliminadas mediante las instrucciones @code{unset} y @samp{export -n}, más las adiciones mediante las instrucciones @code{export} y @samp{declare -x}.

source: The environment for any simple command or function may be augmented temporarily by prefixing it with parameter assignments, as described in @ref{Shell Parameters}. These assignment statements affect only the environment seen by that command.
es: El entorno para cualquier instrucción simple o función puede ser aumentado temporalmente prefijándolo con asignaciones de parámetros, como se describe en @ref{Parámetros del Intérprete}. Estas sentencias de asignación afectan solo al entorno visto por esa instrucción.

source: If the @option{-k} option is set (@pxref{The Set Builtin}), then all parameter assignments are placed in the environment for a command, not just those that precede the command name.
es: Si está habilitada la opción @option{-k} (@pxref{La Instrucción Integrada Set}), todas las asignaciones de parámetros son ubicadas en el entorno para una instrucción, no solo aquellas que preceden al nombre de la instrucción.

source: When Bash invokes an external command, the variable @samp{$_} is set to the full pathname of the command and passed to that command in its environment.
es: Cuando Bash llama a una instrucción externa, la variable @samp{$_} es establecida al nombre de ruta completo de la instrucción y pasado a esa instrucción en su entorno.

source: The exit status of an executed command is the value returned by the @var{waitpid} system call or equivalent function. Exit statuses fall between 0 and 255, though, as explained below, the shell may use values above 125 specially. Exit statuses from shell builtins and compound commands are also limited to this range. Under certain circumstances, the shell will use special values to indicate specific failure modes.
es: El estado de salida de una instrucción ejecutada es el valor devuelto por la llamada de sistema @var{waitpid} o función equivalente. Los estados de salida se sitúan entre 0 y 255, sin embargo, como se explica a continuación, el intérprete puede usar los valores encima de 125 de forma especial. Los estados de salida de instrucciones integradas del intérprete y instrucciones compuestas también están limitadas a este rango. Bajo ciertas condiciones, el intérprete usará valores especiales para indicar modos de fallo específicos.

source: For the shell's purposes, a command which exits with a zero exit status has succeeded. A non-zero exit status indicates failure. This seemingly counter-intuitive scheme is used so there is one well-defined way to indicate success and a variety of ways to indicate various failure modes. When a command terminates on a fatal signal whose number is @var{N}, Bash uses the value 128+@var{N} as the exit status.
es: Para propósitos del intérprete, una instrucción que salga con un estado de salida de cero ha tenido éxito. Un estado de salida distinto de cero indica fallo. Este esquema aparentemente en contra del sentido común se usa para que haya un modo bien definido de indicar éxito y una variedad de formas de indicar varios modos de fallo. Cuando una instrucción termina con una señal fatal cuyo número es @var{N}, Bash usa el valor 128+@var{N} como el estado de salida.

source: If a command is not found, the child process created to execute it returns a status of 127. If a command is found but is not executable, the return status is 126.
es: Si no se encuentra una instrucción, el proceso hijo creado para ejecutarla devuelve un estado de 127. Si se encuentra una instrucción pero no es ejecutable, el estado de retorno es 126.

source: If a command fails because of an error during expansion or redirection, the exit status is greater than zero.
es: Si una instrucción falla a causa de un error durante la expansión o redirección, el estado de salida es mayor que cero.

source: The exit status is used by the Bash conditional commands (@pxref{Conditional Constructs}) and some of the list constructs (@pxref{Lists}).
es: El estado de salida es usado por las instrucciones condicionales de Bash (@pxref{Construcciones Condicionales}) y algunas de las construcciones de listas (@pxref{Listas}).

source: All of the Bash builtins return an exit status of zero if they succeed and a non-zero status on failure, so they may be used by the conditional and list constructs. All builtins return an exit status of 2 to indicate incorrect usage, generally invalid options or missing arguments.
es: Todas las instrucciones integradas de Bash devuelven un estado de salida de cero si tienen éxito y un estado de salida distinto de cero en caso de fallo, de forma que pueden ser usados por las construcciones condicionales y de listas. Todas las instrucciones integradas devuelven un estado de salida de 2 para indicar un uso incorrecto, generalmente opciones inválidas o argumentos que faltan.

source: signal handling
es: manejo de señales

source: When Bash is interactive, in the absence of any traps, it ignores @code{SIGTERM} (so that @samp{kill 0} does not kill an interactive shell), and @code{SIGINT} is caught and handled (so that the @code{wait} builtin is interruptible). When Bash receives a @code{SIGINT}, it breaks out of any executing loops. In all cases, Bash ignores @code{SIGQUIT}. If job control is in effect (@pxref{Job Control}), Bash ignores @code{SIGTTIN}, @code{SIGTTOU}, and @code{SIGTSTP}.
es: Cuando Bash es interactivo, en ausencia de traps, ignora @code{SIGTERM} (de forma que @samp{kill 0} no mate un intérprete interactivo) y @code{SIGINT} se atrapa y se maneja (de forma que la instrucción integrada @code{wait} no se pueda interrumpir). Cuando Bash recive una @code{SIGINT}, sale de cualquier bucle que se ejecute. En todos los casos, Bash ignora @code{SIGQUIT}. Si está en efecto el control de tareas (@pxref{Control de Tareas}), Bash ignora @code{SIGTTIN}, @code{SIGTTOU} y @code{SIGTSTP}.

source: Non-builtin commands started by Bash have signal handlers set to the values inherited by the shell from its parent. When job control is not in effect, asynchronous commands ignore @code{SIGINT} and @code{SIGQUIT} in addition to these inherited handlers. Commands run as a result of command substitution ignore the keyboard-generated job control signals @code{SIGTTIN}, @code{SIGTTOU}, and @code{SIGTSTP}.
es: Las instrucciones que no son integradas iniciadas por Bash tienen manejadores de señales establecidos a los valores heredados por el intérprete de su padre. Cuando no está en efecto el control de tareas, las instrucciones asíncronas ignoran @code{SIGINT} y @code{SIGQUIT} además de estos manejadores heredados. Las instrucciones ejecutadas como un resultado de la sustitución de instrucciones ignoran las señales de control de tareas generadas con el teclado @code{SIGTTIN}, @code{SIGTTOU} y @code{SIGTSTP}.

source: The shell exits by default upon receipt of a @code{SIGHUP}. Before exiting, an interactive shell resends the @code{SIGHUP} to all jobs, running or stopped. Stopped jobs are sent @code{SIGCONT} to ensure that they receive the @code{SIGHUP}. To prevent the shell from sending the @code{SIGHUP} signal to a particular job, it should be removed from the jobs table with the @code{disown} builtin (@pxref{Job Control Builtins}) or marked to not receive @code{SIGHUP} using @code{disown -h}.
es: El intérprete se cierra por defecto al recibir un @code{SIGHUP}. Antes de cerrarse, un intérprete interactivo reenvía la @code{SIGHUB} a todas las tareas, en ejecución o detenidas. A las tareas detenidas se les envía @code{SIGCONT} para asegurarse de que reciben la @code{SIGHUB}. Para evitar que el intérprete envíe la señal @code{SIGHUB} a una tarea concreta, debería ser eliminada de la tabla de tareas con la instrucción integrada @code{disown} (@pxref{Instrucciones Integradas de Control de Tareas}) o marcada para no recibir @code{SIGHUB} usando @code{disown -h}.

source: If the @code{huponexit} shell option has been set with @code{shopt} (@pxref{The Shopt Builtin}), Bash sends a @code{SIGHUP} to all jobs when an interactive login shell exits.
es: Si se ha habilitado la opción @code{huponexit} con @code{shopt} (@pxref{La Instrucción Integrada Shopt}), Bash manda una @code{SIGHUB} a todas las tareas cuando se cierra un intérprete de acceso interactivo.

source: If Bash is waiting for a command to complete and receives a signal for which a trap has been set, the trap will not be executed until the command completes. When Bash is waiting for an asynchronous command via the @code{wait} builtin, the reception of a signal for which a trap has been set will cause the @code{wait} builtin to return immediately with an exit status greater than 128, immediately after which the trap is executed.
es: Si Bash está esperando a que una instrucción se complete y recibe una señal para la cual una trap ha sido establecida, el trap no será ejecutada hasta que la instrucción se complete. Cuando Bash está esperando a una instrucción asíncrona mediante la instrucción integrada @code{wait}, la recepción de una señal para la cual una trap ha sido establecida hará que la instrucción integrada @code{wait} retorne inmediatamente con un estado de salida mayor que 128, inmediatamente después se ejecuta la trap.

source: shell script
es: guion del intérprete

source: A shell script is a text file containing shell commands. When such a file is used as the first non-option argument when invoking Bash, and neither the @option{-c} nor @option{-s} option is supplied (@pxref{Invoking Bash}), Bash reads and executes commands from the file, then exits. This mode of operation creates a non-interactive shell. The shell first searches for the file in the current directory, and looks in the directories in @env{$PATH} if not found there.
es: Un guion del intérprete es un archivo de texto que contiene instrucciones del intérprete. Cuando se usa tal archivo como el primer argumento no opcional al llamar a Bash, y ni la opción @option{-c} ni la @option{-s} es proporcionada (@pxref{Llamando a Bash}), Bash lee y ejecuta instrucciones del archivo, después se cierra. Este modo de operación crea un intérprete no interactivo. El intérprete busca primero el archivo en el directorio actual, y busca en los directorios en @env{PATH} si no es encontrado ahí.

source: When Bash runs a shell script, it sets the special parameter @code{0} to the name of the file, rather than the name of the shell, and the positional parameters are set to the remaining arguments, if any are given. If no additional arguments are supplied, the positional parameters are unset.
es: Cuando Bash ejecuta un guion del intérprete, establece el parámetro especial @code{0} al nombre del archivo, en vez de al nombre del intérprete, y los argumentos restantes se asignan a los parámetros posicionales, si se pasa alguno. Si no se proporcionan argumentos adicionales, se eliminan los parámetros posicionales.

source: A shell script may be made executable by using the @code{chmod} command to turn on the execute bit. When Bash finds such a file while searching the @env{$PATH} for a command, it spawns a subshell to execute it. In other words, executing
es: Un guion del intérprete puede hacerse ejecutable usando la instrucción @code{chmod} para activar el bit de ejecución. Cuando Bash encuentra tal archivo al buscar una instrucción en el @env{$PATH}, genera un subintérprete para ejecutarlo. En otras palabras, ejecutar

source: filename @var{arguments}
es: nombre-de-archivo @var{argumentos}

source: is equivalent to executing
es: es equivalente a ejecutar

source: bash filename @var{arguments}
es: bash nombre-de-archivo @var{argumentos}

source: if @code{filename} is an executable shell script. This subshell reinitializes itself, so that the effect is as if a new shell had been invoked to interpret the script, with the exception that the locations of commands remembered by the parent (see the description of @code{hash} in @ref{Bourne Shell Builtins}) are retained by the child.
es: si @code{nombre-de-archivo} es un guion del intérprete ejecutable. Este subintérprete se reinicializa, para que el efecto sea como si un nuevo intérprete hubiera sido llamado para interpretar el guion, con la excepción de que las ubicaciones de las instrucciones recordadas por el padre (lea la descripción de @code{hash} en @ref{Instrucciones Integradas del Bourne Shell}) son retenidas por el hijo.

source: Most versions of Unix make this a part of the operating system's command execution mechanism. If the first line of a script begins with the two characters @samp{#!}, the remainder of the line specifies an interpreter for the program. Thus, you can specify Bash, @code{awk}, Perl, or some other interpreter and write the rest of the script file in that language.
es: La mayoría de versiones de Unix hacen esto parte del mecanismo de ejecución de instrucciones del sistema operativo. Si la primera línea del guion empieza por los dos caracteres @samp{#!}, el resto de la línea especifica un intérprete para el programa. Así, puede especificar Bash, @code{awk}, Perl o cualquier otro intérprete y escribir el resto del archivo de guion en ese lenguaje.

source: The arguments to the interpreter consist of a single optional argument following the interpreter name on the first line of the script file, followed by the name of the script file, followed by the rest of the arguments. Bash will perform this action on operating systems that do not handle it themselves. Note that some older versions of Unix limit the interpreter name and argument to a maximum of 32 characters.
es: Los argumentos para el intérprete constan de un único argumento opcional que sigue al nombre del intérprete en la primera línea del archivo de guion, seguido del nombre del archivo del guion, seguido del resto de argumentos. Bash realizará está acción en sistemas operativos que no la manejan por sí mismos. Tenga en cuenta que algunas versiones antiguas de Unix limitan el nombre y argumento del intérprete a un máximo de 32 caracteres.

source: Bash scripts often begin with @code{#! /bin/bash} (assuming that Bash has been installed in @file{/bin}), since this ensures that Bash will be used to interpret the script, even if it is executed under another shell.
es: Los guiones de Bash empiezan normalmente por @code{#! /bin/bash} (asumiendo que Bash ha sido instalado en @file{/bin}), ya que se asegura que Bash será usado para interpretar el guion, incluso si es ejecutado desde otro intérprete.

source: Bourne Shell Builtins
es: Instrucciones Integradas del Bourne Shell

source: Builtin commands inherited from the Bourne Shell.
es: Las instrucciones integradas heredadas del Bourne Shell.

source: Bash Builtins
es: Instrucciones Integradas de Bash

source: Table of builtins specific to Bash.
es: Tabla de instrucciones integradas específicas de Bash.

source: Modifying Shell Behavior
es: Modificando el Comportamiento del Intérprete

source: Builtins to modify shell attributes and optional behavior.
es: Instrucciones integradas para modificar atributos del intérprete y comportamiento opcional.

source: Special Builtins
es: Instrucciones Integradas Especiales

source: Builtin commands classified specially by POSIX.
es: Instrucciones integradas clasificadas de forma especial por POSIX.

source: Builtin commands are contained within the shell itself. When the name of a builtin command is used as the first word of a simple command (@pxref{Simple Commands}), the shell executes the command directly, without invoking another program. Builtin commands are necessary to implement functionality impossible or inconvenient to obtain with separate utilities.
es: Las instrucciones integradas están incluidas en el propio intérprete. Cuando el nombre de una instrucción integrada se usa como la primera palabra de una instrucción simple (@pxref{Instrucciones Simples}), el intérprete ejecuta la orden directamente, sin invocar otro programa. Las instrucciones integradas son necesarias para implementar funcionalidad imposible o inconveniente de obtener con utilidades separadas.

source: This section briefly describes the builtins which Bash inherits from the Bourne Shell, as well as the builtin commands which are unique to or have been extended in Bash.
es: Esta sección describe brevemente las instrucciones integradas que Bash hereda del Bourne Shell, así como las instrucciones integradas que son únicas o han sido extendidas en Bash.

source: Several builtin commands are described in other chapters: builtin commands which provide the Bash interface to the job control facilities (@pxref{Job Control Builtins}), the directory stack (@pxref{Directory Stack Builtins}), the command history (@pxref{Bash History Builtins}), and the programmable completion facilities (@pxref{Programmable Completion Builtins}).
es: En otros capítulos se describen varias instrucciones integradas: las instrucciones integradas que proporcionan la interfaz de Bash para las utilidades del control de tareas (@pxref{Instrucciones Integradas de Control de Tareas}), la pila de directorio (@pxref{Instrucciones Integradas de la Pila de Directorios}), el historial de instrucciones (@pxref{Instrucciones Integradas del Historial de Bash}) y las utilidades de completado programables (@pxref{Instrucciones Integradas de Compleción Programable}).

source: Many of the builtins have been extended by @sc{posix} or Bash.
es: Muchas de las instrucciones integradas han sido extendidas por @sc{posix} o Bash.
