Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: The @samp{minimal-config} option can be used to disable all of the following options, but it is processed first, so individual options may be enabled using @samp{enable-@var{feature}}.
es: La opción @samp{minimal-config} se puede usar para deshabilitar todas las siguientes opciones, pero se procesa primero, para que se puedan habilitar opciones individuales usando @samp{enable-@var{funcionalidad}}.

source: All of the following options except for @samp{disabled-builtins}, @samp{direxpand-default}, and @samp{xpg-echo-default} are enabled by default, unless the operating system does not provide the necessary support.
es: Todas las siguientes opciones excepto @samp{disabled-builtins}, @samp{direxpand-default} y @samp{xpg-echo-default} están habilitadas por defecto, a no ser que el sistema operativo no proporcione el soporte necesario.

source: Allow alias expansion and include the @code{alias} and @code{unalias} builtins (@pxref{Aliases}).
es: Permite la expansión de alias e incluye las instrucciones integradas @code{alias} y @code{unalias} (@pxref{Aliases}).

source: Include support for the alternate form of the @code{for} command that behaves like the C language @code{for} statement (@pxref{Looping Constructs}).
es: Incluye soporte para la forma alternativa de la instrucción @code{for} que se comporta como la sentencia @code{for} del lenguaje C (@pxref{Construcciones de Bucle}).

source: Include support for one-dimensional array shell variables (@pxref{Arrays}).
es: Incluye soporte para variables del intérprete de vectores unidimensionales (@pxref{Vectores}).

source: Include support for @code{csh}-like history substitution (@pxref{History Interaction}).
es: Incluye soporte para la sustitución de historial estilo @code{csh} (@pxref{Interacción con el Historial}).

source: Include @code{csh}-like brace expansion ( @code{b@{a,b@}c} @expansion{} @code{bac bbc} ). See @ref{Brace Expansion}, for a complete description.
es: Incluye expansión de llaves estilo @code{csh} ( @code{b@{a,b@}c} @expansion{} @code{bac bbc} ). Consulte @ref{Expansión de Llaves}, para una descripción completa.

source: Include support for case-modifying attributes in the @code{declare} builtin and assignment statements. Variables with the @var{uppercase} attribute, for example, will have their values converted to uppercase upon assignment.
es: Incluye soporte para los atributos que cambian entre mayúsculas y minúsculas en la instrucción integrada @code{declare} y sentencias de asignación. A las variables con el atributo @var{uppercase}, por ejemplo, se les convertirán sus valores a mayúscula en la asignación.

source: Include support for case-modifying word expansions.
es: Incluye soporte para expansiones de palabras que modifican entre mayúsculas y minúsculas.

source: Include support for recognizing @code{time} as a reserved word and for displaying timing statistics for the pipeline following @code{time} (@pxref{Pipelines}). This allows pipelines as well as shell builtins and functions to be timed.
es: Incluye soporte para reconocer @code{time} como una palabra reservada y para mostrar estadísticas de tiempo para la tubería que sigue a @code{time} (@pxref{Tuberías}). Esto permite que tanto tuberías como instrucciones integradas del intérprete y funciones sean cronometradas.

source: Include support for the @code{[[} conditional command. (@pxref{Conditional Constructs}).
es: Incluye soporte para la instrucción condicional @code{[[}. (@pxref{Construcciones Condicionales}).

source: Include support for matching @sc{posix} regular expressions using the @samp{=~} binary operator in the @code{[[} conditional command. (@pxref{Conditional Constructs}).
es: Incluye soporte para coincidir expresiones regulares @sc{posix} usando el operador binario @samp{=~} en la instrucción condicional @code{[[}. (@pxref{Construcciones Condicionales}).

source: Include support for coprocesses and the @code{coproc} reserved word (@pxref{Pipelines}).
es: Incluye soporte para coprocesos y la palabra reservada @code{coproc} (@pxref{Tuberías}).

source: Include support for the bash debugger (distributed separately).
es: Incluye soporte para el depurador de Bash (distribuido por separado).

source: If calling @code{stat} on /dev/fd/@var{N} returns different results than calling @code{fstat} on file descriptor @var{N}, supply this option to enable a workaround. This has implications for conditional commands that test file attributes.
es: Si ejecutar @code{stat} en /dev/fd/@var{N} devuelve diferentes resultados que ejecutar @code{fstat} en el descriptor de archivo @var{N}, proporciona esta opción para activar una solución alternativa. Esto tiene implicaciones para instrucciones condicionales que comprueban los atributos de los archivos.

source: Cause the @code{direxpand} shell option (@pxref{The Shopt Builtin}) to be enabled by default when the shell starts. It is normally disabled by default.
es: Hace que la opción del intérprete @code{direxpand} (@pxref{La Instrucción Integrada Shopt}) sea habilitada por defecto cuando se inicia el intérprete. Normalmente está deshabilitada por defecto.

source: Include support for a @code{csh}-like directory stack and the @code{pushd}, @code{popd}, and @code{dirs} builtins (@pxref{The Directory Stack}).
es: Incluye soporte para una pila de directorios del estilo @code{csh} y las instrucciones integradas @code{pushd}, @code{popd} y @code{dirs} (@pxref{La Pila de Directorios}).

source: Allow builtin commands to be invoked via @samp{builtin xxx} even after @code{xxx} has been disabled using @samp{enable -n xxx}. See @ref{Bash Builtins}, for details of the @code{builtin} and @code{enable} builtin commands.
es: Permite que las instrucciones integradas sean invocadas mediante @samp{builtin xxx} incluso después de que @code{xxx} haya sido deshabilitado usando @samp{enable -n xxx}. Consulte @ref{Instrucciones Integradas de Bash}, para detalles de las instrucciones integradas @code{builtin} y @code{enable}.

source: Include support for the @code{((@dots{}))} command (@pxref{Conditional Constructs}).
es: Incluye soporte para la instrucción @code{((@dots{}))} (@pxref{Construcciones Condicionales}).

source: Include support for the extended pattern matching features described above under @ref{Pattern Matching}.
es: Incluye soporte para las funcionalidades extendidas de coincidencia de patrones descritas antes en @ref{Coincidencia de Patrones}.

source: Set the default value of the @var{extglob} shell option described above under @ref{The Shopt Builtin} to be enabled.
es: Habilita la opción predeterminada de la opción del intérprete @var{extglob} descrita anteriormente en @ref{La Instrucción Integrada Shopt}.

source: Include support for importing function definitions exported by another instance of the shell from the environment. This option is enabled by default.
es: Incluye soporte para importar definiciones de función exportadas por otra instancia del intérprete desde el entorno. Esta opción está habilitada por defecto.

source: Set the default value of the @var{globasciiranges} shell option described above under @ref{The Shopt Builtin} to be enabled. This controls the behavior of character ranges when used in pattern matching bracket expressions.
es: Habilita el valor predeterminado de la opción del intérprete @var{globasciiranges} descrita antes en @ref{La Instrucción Integrada Shopt}. Esto controla el comportamiento de rangos de caracteres cuando se usa en expresiones de llaves de coincidencia de patrones.

source: Include the @code{help} builtin, which displays help on shell builtins and variables (@pxref{Bash Builtins}).
es: Incluye la instrucción integrada @code{help}, que muestra ayuda sobre las instrucciones integradas y variables del intérprete (@pxref{Instrucciones Integradas de Bash}).

source: Include command history and the @code{fc} and @code{history} builtin commands (@pxref{Bash History Facilities}).
es: Incluye el historial de instrucciones y las instrucciones integradas @code{fc} y @code{history} (@pxref{Servicios del Historial de Bash}).

source: This enables the job control features (@pxref{Job Control}), if the operating system supports them.
es: Esto habilita las funcionalidades de control de tareas (@pxref{Control de Tareas}), si el sistema operativo las soporta.

source: This enables support for multibyte characters if the operating system provides the necessary support.
es: Esto habilita el soporte para caracteres multibyte si el sistema operativo proporciona el soporte necesario.

source: This enables the special handling of filenames of the form @code{/dev/tcp/@var{host}/@var{port}} and @code{/dev/udp/@var{host}/@var{port}} when used in redirections (@pxref{Redirections}).
es: Esto habilita el manejo especial de nombres de archivo de la forma @code{/dev/tcp/@var{anfitrión}/@var{puerto}} y @code{/dev/udp/@var{host}/@var{port}} cuando se usan en redirecciones (@pxref{Redirecciones}).

source: This enables process substitution (@pxref{Process Substitution}) if the operating system provides the necessary support.
es: Esto permite la sustitución de procesos (@pxref{Sustitución de Procesos}) si el sistema operativo proporciona el soporte necesario.

source: Enable the programmable completion facilities (@pxref{Programmable Completion}). If Readline is not enabled, this option has no effect.
es: Habilita las facilidades de compleción programable (@pxref{Compleción Programable}). Si Readline no está habilitado, esta opción no tiene efecto.

source: Turn on the interpretation of a number of backslash-escaped characters in the @env{$PS0}, @env{$PS1}, @env{$PS2}, and @env{$PS4} prompt strings. See @ref{Controlling the Prompt}, for a complete list of prompt string escape sequences.
es: Activa la interpretación de varios caracteres escapados con barras invertidas en las cadenas del prompt @env{$PS0}, @env{$PS1}, @env{$PS2} y @env{$PS4}. Consulte @ref{Controlando el Prompt}, para una lista completa de secuencias de escape de prompt.

source: Include support for command-line editing and history with the Bash version of the Readline library (@pxref{Command Line Editing}).
es: Incluye soporte para edición en línea de órdenes e historial con la versión de Bash de la biblioteca Readline (@pxref{Edición en Línea de Órdenes}).

source: Include support for a @dfn{restricted shell}. If this is enabled, Bash, when called as @code{rbash}, enters a restricted mode. See @ref{The Restricted Shell}, for a description of restricted mode.
es: Incluye soporte para un @dfn{intérprete restringido}. Si esto está habilitado, Bash, cuando se ejecuta como @code{rbash}, entra en un modo restringido. Consulte @ref{El Intérprete Restringido}, para una descripción del modo restringido.

source: Include the @code{select} compound command, which allows the generation of simple menus (@pxref{Conditional Constructs}).
es: Incluye la instrucción compuesta @code{select}, que permite la generación de menús simples (@pxref{Construcciones Condicionales}).

source: Use external files for the documentation displayed by the @code{help} builtin instead of storing the text internally.
es: Usa archivos externos para la documentación mostrada por la instrucción integrada @code{help} en vez de almacenar el texto internamente.

source: Store the text displayed by the @code{help} builtin as a single string for each help topic. This aids in translating the text to different languages. You may need to disable this if your compiler cannot handle very long string literals.
es: Guarda el texto mostrado por la instrucción integrada @code{help} como una cadena simple para cada tema de ayuda. Esto ayuda a traducir el texto a diferentes idiomas. Puede que necesite deshabilitar esto si su compilador no puede manejar literales de cadenas muy largos.

source: Make Bash @sc{posix}-conformant by default (@pxref{Bash POSIX Mode}).
es: Hace a Bash conforme con el estándar @sc{posix} por defecto (@pxref{Modo POSIX de Bash}).

source: A synonym for @code{--enable-xpg-echo-default}.
es: Un sinónimo para @code{--enable-xpg-echo-default}.

source: Make the @code{echo} builtin expand backslash-escaped characters by default, without requiring the @option{-e} option. This sets the default value of the @code{xpg_echo} shell option to @code{on}, which makes the Bash @code{echo} behave more like the version specified in the Single Unix Specification, version 3. @xref{Bash Builtins}, for a description of the escape sequences that @code{echo} recognizes.
es: Hace que la instrucción integrada @code{echo} expanda los caracteres escapados por barras invertidas por defecto, sin requerir la opción @option{-e}. Esto establece el valor predeterminado de la opción del intérprete @code{xpg_echo} a @code{on}, que hace que el @code{echo} de Bash se comporte más como la versión especificada en la Especificación Única de Unix, versión 3. @xref{Instrucciones Integradas de Bash}, para una descripción de las secuencias de escape que @code{echo} reconoce.

source: The file @file{config-top.h} contains C Preprocessor @samp{#define} statements for options which are not settable from @code{configure}. Some of these are not meant to be changed; beware of the consequences if you do. Read the comments associated with each definition for more information about its effect.
es: El archivo @file{config-top.h} contiene sentencias de Preprocesador C @samp{#define} para opciones que no se pueden establecer desde @code{configure}. Algunas de estas no están pensadas para cambiarse; aténgase a las consecuencias si lo hace. Lea los comentarios asociados con cada definición para más información sobre su efecto.

source: Please report all bugs you find in Bash. But first, you should make sure that it really is a bug, and that it appears in the latest version of Bash. The latest version of Bash is always available for FTP from @uref{ftp://ftp.gnu.org/pub/gnu/bash/}.
es: Por favor, reporte todos los errores que encuentre en Bash. Pero primero, debería asegurarse de que es realmente un error, y de que aparece en la última versión de Bash. La última versión de Bash siempre está disponible para FTP desde @uref{ftp://ftp.gnu.org/pub/gnu/bash/}.

source: Once you have determined that a bug actually exists, use the @code{bashbug} command to submit a bug report. If you have a fix, you are encouraged to mail that as well! Suggestions and `philosophical' bug reports may be mailed to @email{bug-bash@@gnu.org} or posted to the Usenet newsgroup @code{gnu.bash.bug}.
es: Una vez que haya determinado que existe realmente un error, use la instrucción @code{bashbug} para enviar un informe de fallo. ¡Si tiene un arreglo, le animamos a que nos envíe eso también! Sugerencias e informes de errores `filosóficos' pueden ser enviados a @email{bug-bash@@gnu.org} o publicados en el grupo de noticias Usenet @code{gnu.bash.org}.

source: All bug reports should include:
es: Todos los informes de fallo deberían incluir:

source: The version number of Bash.
es: El número de versión de Bash.

source: The hardware and operating system.
es: El hardware y el sistema operativo.

source: The compiler used to compile Bash.
es: El compilador usado para compilar Bash.

source: A description of the bug behaviour.
es: Una descripción del comportamiento del error.

source: A short script or `recipe' which exercises the bug and may be used to reproduce it.
es: Un guion corto o `receta' que produzca el fallo y pueda ser usado para reproducirlo.

source: @code{bashbug} inserts the first three items automatically into the template it provides for filing a bug report.
es: @code{bashbug} inserta los primeros tres elementos automáticamente en la plantilla que proporciona para enviar un informe de fallo.

source: Please send all reports concerning this manual to @email{bug-bash@@gnu.org}.
es: Por favor, envíe todos los informes relativos a este manual a @email{bug-bash@@gnu.org}.

source: Bash implements essentially the same grammar, parameter and variable expansion, redirection, and quoting as the Bourne Shell. Bash uses the @sc{posix} standard as the specification of how these features are to be implemented. There are some differences between the traditional Bourne shell and Bash; this section quickly details the differences of significance. A number of these differences are explained in greater depth in previous sections. This section uses the version of @code{sh} included in SVR4.2 (the last version of the historical Bourne shell) as the baseline reference.
es: Bash implementa esencialmente la misma gramática, expansión de parámetros y variables, redirección y entrecomillado que el Bourne Shell. Bash usa el estándar @sc{posix} como la especificación de cómo deberían ser implementadas estas características. Hay algunas diferencias entre el intérprete Bourne tradicional y Bash; esta sección detalla rápidamente las diferencias significantes. Varias de estas diferencias se explican detalladamente en secciones previas. Esta sección usa la versión de @code{sh} incluida en SVR4.2 (la última versión del histórico intérprete Bourne) como la referencia base.

source: Bash is @sc{posix}-conformant, even where the @sc{posix} specification differs from traditional @code{sh} behavior (@pxref{Bash POSIX Mode}).
es: Bash está conforme con @sc{posix} incluso cuando la especificación @sc{posix} difiere del comportamiento tradicional de @code{sh} (@pxref{Modo POSIX de Bash}).

source: Bash has multi-character invocation options (@pxref{Invoking Bash}).
es: Bash tiene opciones de llamada de varios caracteres (@pxref{Llamando a Bash}).

source: Bash has command-line editing (@pxref{Command Line Editing}) and the @code{bind} builtin.
es: Bash tiene edición en línea de órdenes (@pxref{Edición en Línea de Órdenes}) y la instrucción integrada @code{bind}.

source: Bash provides a programmable word completion mechanism (@pxref{Programmable Completion}), and builtin commands @code{complete}, @code{compgen}, and @code{compopt}, to manipulate it.
es: Bash proporciona un mecanismo de compleción programable de palabra (@pxref{Compleción Programable}), y las instrucciones integradas @code{complete}, @code{compgen} y @code{compopt} para manipularlo.

source: Bash has command history (@pxref{Bash History Facilities}) and the @code{history} and @code{fc} builtins to manipulate it. The Bash history list maintains timestamp information and uses the value of the @code{HISTTIMEFORMAT} variable to display it.
es: Bash tiene historial de instrucciones (@pxref{Servicios del Historial de Bash}) y las instrucciones integradas @code{history} y @code{fc} para manipularlo. La lista del historial de Bash mantiene información de marcas de tiempo y usa el valor de la variable @code{HISTTIMEFORMAT} para mostrarla.

source: Bash implements @code{csh}-like history expansion (@pxref{History Interaction}).
es: Bash implementa expansión del historial estilo @code{csh} (@pxref{Interacción con el Historial}).

source: Bash has one-dimensional array variables (@pxref{Arrays}), and the appropriate variable expansions and assignment syntax to use them. Several of the Bash builtins take options to act on arrays. Bash provides a number of built-in array variables.
es: Bash tiene variables de vectores unidimensionales (@pxref{Vectores}), y las apropiadas expansiones de variable y sintaxis de asignación para usarlos. Varias de las instrucciones integradas de Bash toman opciones para actuar sobre vectores. Bash ofrece una serie de variables de vectores integradas.

source: The @code{$'@dots{}'} quoting syntax, which expands ANSI-C backslash-escaped characters in the text between the single quotes, is supported (@pxref{ANSI-C Quoting}).
es: La sintaxis de entrecomillado @code{$'@dots{}'}, que expande caracteres de barra invertida ANSI-C en el texto entre las comillas simples, está soportada (@pxref{Entrecomillado ANSI-C}).

source: Bash supports the @code{$"@dots{}"} quoting syntax to do locale-specific translation of the characters between the double quotes. The @option{-D}, @option{--dump-strings}, and @option{--dump-po-strings} invocation options list the translatable strings found in a script (@pxref{Locale Translation}).
es: Bash soporta la sintaxis de entrecomillado @code{$"@dots{}"} para hacer tranducciones de región específica de los caracteres entre las comillas dobles. Las opciones de llamada @option{-D}, @option{--dump-strings} y @option{--dump-po-strings} listan las cadenas convertibles encontradas en un guion (@pxref{Traducción de Localización}).

source: Bash implements the @code{!} keyword to negate the return value of a pipeline (@pxref{Pipelines}). Very useful when an @code{if} statement needs to act only if a test fails. The Bash @samp{-o pipefail} option to @code{set} will cause a pipeline to return a failure status if any command fails.
es: Bash implementa la palabra clave @code{!} para negar el valor de retorno de una tubería (@pxref{Tuberías}). Muy útil cuando una sentencia @code{if} solo tiene que actuar si una comprobación falla. La opción de Bash @samp{-o pipefail} para @code{set} hará que una tubería devuelva un estado de fallo si falla cualquier instrucción.

source: Bash has the @code{time} reserved word and command timing (@pxref{Pipelines}). The display of the timing statistics may be controlled with the @env{TIMEFORMAT} variable.
es: Bash tiene la palabra reservada @code{time} y el cronometrado de instrucciones (@pxref{Tuberías}). La muestra de las estádisticas de tiempo puede ser controlada por la variable @env{TIMEFORMAT}.

source: Bash implements the @code{for (( @var{expr1} ; @var{expr2} ; @var{expr3} ))} arithmetic for command, similar to the C language (@pxref{Looping Constructs}).
es: Bash implementa la aritmética @code{for (( @var{expr1} ; @var{expr2} ; @var{expr3} ))} para instrucción, similar al lenguaje C (@pxref{Construcciones de Bucle}).

source: Bash includes the @code{select} compound command, which allows the generation of simple menus (@pxref{Conditional Constructs}).
es: Bash incluye la instrucción compuesta @code{select}, que permite la generación de menús simples (@pxref{Construcciones Condicionales}).

source: Bash includes the @code{[[} compound command, which makes conditional testing part of the shell grammar (@pxref{Conditional Constructs}), including optional regular expression matching.
es: Bash incluye la instrucción compuesta @code{[[}, que hace la comprobación condicional parte de la gramática del intérprete (@pxref{Construcciones Condicionales}), incluyendo correspondencias opcionales de expresiones regulares.

source: Bash provides optional case-insensitive matching for the @code{case} and @code{[[} constructs.
es: Bash proporciona coincidencia opcional independiente de minúsculas y mayúsculas para las construcciones @code{case} y @code{[[}.

source: Bash includes brace expansion (@pxref{Brace Expansion}) and tilde expansion (@pxref{Tilde Expansion}).
es: Bash incluye expansión de llaves (@pxref{Expansión de Llaves}) y expansión de virgulilla (@pxref{Expansión de Virgulilla}).

source: Bash implements command aliases and the @code{alias} and @code{unalias} builtins (@pxref{Aliases}).
es: Bash implementa aliases de instrucciones y las instrucciones integradas @code{alias} y @code{unalias} (@pxref{Aliases}).

source: Bash provides shell arithmetic, the @code{((} compound command (@pxref{Conditional Constructs}), and arithmetic expansion (@pxref{Shell Arithmetic}).
es: Bash proporciona aritmética del intérprete, la instrucción compuesta @code{((} (@pxref{Construcciones Condicionales}) y expansión aritmética (@pxref{Aritmética del Intérprete}).
