Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Bash Reference Manual
es: Manual de Referencia de Bash

source: This text is a brief description of the features that are present in the Bash shell (version @value{VERSION}, @value{UPDATED}).
es: Este texto es una breve descripción de las funcionalidades presentes en el intérprete de órdenes de Bash (version @value{VERSION}, @value{UPDATED}).

source: This is Edition @value{EDITION}, last updated @value{UPDATED}, of @cite{The GNU Bash Reference Manual}, for @code{Bash}, Version @value{VERSION}.
es: Esta es la Edición @value{EDITION}, actualizada por última vez @value{UPDATED}, de @cite{Manual de Referencia de Bash}, para @code{Bash}, Version @value{VERSION}.

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled ``GNU Free Documentation License''.
es: Se otorga permiso para copiar, distribuir y/o modificar este documento bajo los términos de la GNU Free Documentation License [Licencia de Documentación Libre de GNU], Version 1.3 o cualquier versión posterior publicada por la Free Software Foundation; sin Invariant Sections [secciones invariables], sin Front-Cover Texts [textos en la cubierta frontal] y sin Back-Cover Texts [textos en la cubierta trasera]. Se incluye una copia de está licencia en la sección titulada ``GNU Free Documentation License''."

source: Basics
es: Básicos

source: The GNU Bourne-Again SHell.
es: La GNU Bourne-Again SHell.

source: Reference Documentation for Bash
es: Documentación de Referencia para Bash

source: Edition @value{EDITION}, for @code{Bash} Version @value{VERSION}.
es: Edición @value{EDITION}, para @code{Bash} Versión @value{VERSION}.

source: Introduction
es: Introducción

source: Bash Features
es: Funcionalidades de Bash

source: This text is a brief description of the features that are present in the Bash shell (version @value{VERSION}, @value{UPDATED}). The Bash home page is @url{http://www.gnu.org/software/bash/}.
es: Este texto es una descripción breve de las funcionalidades presentes en el intérprete de órdenes Bash (versión @value{VERSION}, @value{UPDATED}). El sitio web la Bash es @url{http://www.gnu.org/software/bash/}.

source: Bash contains features that appear in other popular shells, and some features that only appear in Bash. Some of the shells that Bash has borrowed concepts from are the Bourne Shell (@file{sh}), the Korn Shell (@file{ksh}), and the C-shell (@file{csh} and its successor, @file{tcsh}). The following menu breaks the features up into categories, noting which features were inspired by other shells and which are specific to Bash.
es: Bash contiene funcionalidades que aparecen en otros intérpretes de instrucciones populares, y algunas funcionalidades que solo aparecen en Bash. Algunos de los intérpretes de los que Bash ha tomado conceptos son el Bourne Shell (@file{sh}), el Korn Shell (@file{ksh}) y el C-shell (@file{csh} y su sucesor, @file{tcsh}). El siguiente menú divide las funcionalidades en categorías, mencionando qué funcionalidades fueron inspiradas por otros intérpretes y cuáles son propias de Bash.

source: This manual is meant as a brief introduction to features found in Bash. The Bash manual page should be used as the definitive reference on shell behavior.
es: Este manual está pensado como una breve introducción a las funcionalidades que se encuentran en Bash. La página de manual de Bash debería usarse como la referencia definitiva sobre el compartamiento del intérprete de órdenes.

source: An introduction to the shell.
es: Una introducción al intérprete de órdenes.

source: Definitions
es: Definiciones

source: Some definitions used in the rest of this manual.
es: Algunas definiciones usadas en el resto de este manual.

source: Basic Shell Features
es: Funcionalidades Básicas del Intérprete

source: The shell "building blocks".
es: Los "bloques constructores" del intérprete.

source: Shell Builtin Commands
es: Instrucciones Integradas del Intérprete

source: Commands that are a part of the shell.
es: Instrucciones que son parte del intérprete.

source: Shell Variables
es: Variables del Intérprete

source: Variables used or set by Bash.
es: Variables usadas o establecidas por Bash.

source: Features found only in Bash.
es: Funcionalidades únicas de Bash.

source: Job Control
es: Control de Tareas

source: What job control is and how Bash allows you to use it.
es: Qué es el control de tareas y cómo te permite Bash usarlo.

source: Command Line Editing
es: Edición en Línea de Órdenes

source: Chapter describing the command line editing features.
es: Capítulo que describe las funcionalidades de la edición en línea de órdenes.

source: Using History Interactively
es: Usando el Historial Interactivamente

source: Command History Expansion
es: Expansión del Historial de Órdenes

source: Installing Bash
es: Instalación de Bash

source: How to build and install Bash on your system.
es: Cómo construir e instalar Bash en tu sistema.

source: Reporting Bugs
es: Notificar Errores

source: How to report bugs in Bash.
es: Cómo notificar errores en Bash.

source: Major Differences From The Bourne Shell
es: Diferencias Principales Respecto a The Bourne Shell

source: A terse list of the differences between Bash and historical versions of /bin/sh.
es: Una escueta lista de las diferencias entre Bash y versiones históricas de /bin/sh.

source: Copying and sharing this documentation.
es: Copiar y compartir esta documentación.

source: Indexes
es: Glosarios

source: Various indexes for this manual.
es: Varios glosarios para este manual.

source: What is Bash?
es: ¿Qué es Bash?

source: A short description of Bash.
es: Una breve descripción de Bash.

source: What is a shell?
es: ¿Qué es un intérprete?

source: A brief introduction to shells.
es: Una breve introducción a los intérpretes de instrucciones.

source: Bash is the shell, or command language interpreter, for the @sc{gnu} operating system. The name is an acronym for the @samp{Bourne-Again SHell}, a pun on Stephen Bourne, the author of the direct ancestor of the current Unix shell @code{sh}, which appeared in the Seventh Edition Bell Labs Research version of Unix.
es: Bash es el intérprete, o el lenguaje intérprete de órdenes, para el sistema operativo @sc{gnu}. El nombre es un acrónimo de @samp{Bourne-Again SHell}, un juego de palabras con Stephen Bourne, el autor del ancestro directo del actual intérprete @code{sh}, que apareció en la versión Seventh Edition Bell Labs Research de Unix.

source: Bash is largely compatible with @code{sh} and incorporates useful features from the Korn shell @code{ksh} and the C shell @code{csh}. It is intended to be a conformant implementation of the @sc{ieee} @sc{posix} Shell and Tools portion of the @sc{ieee} @sc{posix} specification (@sc{ieee} Standard 1003.1). It offers functional improvements over @code{sh} for both interactive and programming use.
es: Bash es en gran parte compatible con @code{sh} e incorpora funcionalidades útiles del intérprete Korn @code{ksh} y el intérprete C @code{csh}. Esta concebido para ser una implementación que se ajusta a la parte @sc{ieee} @sc{posix} Shell and Tools de la especificación @sc{ieee} @sc{posix} (@sc{ieee} Standard 1003.1). Ofrece mejoras funcionales sobre @code{sh} tanto para uso interactivo como para programar.

source: While the @sc{gnu} operating system provides other shells, including a version of @code{csh}, Bash is the default shell. Like other @sc{gnu} software, Bash is quite portable. It currently runs on nearly every version of Unix and a few other operating systems @minus{} independently-supported ports exist for @sc{ms-dos}, @sc{os/2}, and Windows platforms.
es: Aunque el sistema operativo @sc{gnu} proporciona otros intérpretes de órdenes, incluyendo una versión de @code{csh}, Bash es el intérprete predeterminado. Al igual que otro software de @sc{gnu}, Bash es bastante portable. Actualmente se ejecuta en casi cualquier versión de Unix y algunos otros sistemas operativos ---existen versiones portadas mantenidas de forma independiente para @sc{ms-dos}, @sc{os/2} y plataformas Windows---.

source: At its base, a shell is simply a macro processor that executes commands. The term macro processor means functionality where text and symbols are expanded to create larger expressions.
es: Básicamente, un intérprete es simplemente un procesador de macros que ejecuta instrucciones. El término procesador de macros significa funcionalidad donde texto y símbolos son expandidos para crear expresiones más grandes.

source: A Unix shell is both a command interpreter and a programming language. As a command interpreter, the shell provides the user interface to the rich set of @sc{gnu} utilities. The programming language features allow these utilities to be combined. Files containing commands can be created, and become commands themselves. These new commands have the same status as system commands in directories such as @file{/bin}, allowing users or groups to establish custom environments to automate their common tasks.
es: Un intérprete de Unix es tanto un intérprete de órdenes como un lenguaje de programación. Como un intérprete de instrucciones, el intérprete proporciona la interfaz de usuario a un variado conjunto de utilidades de @sc{gnu}. Las funcionalidades del lenguaje de programación permiten que estás utilidades se combinen. Se pueden crear archivos que contienen instrucciones, y convertirse ellos mismos en instrucciones. Estas nuevas órdenes tienen la misma naturaleza que instrucciones del sistema en directorios como @file{/bin}, permitiendo que usuarios o grupos puedan establecer entornos personalizados para automatizar sus tareas comunes.

source: Shells may be used interactively or non-interactively. In interactive mode, they accept input typed from the keyboard. When executing non-interactively, shells execute commands read from a file.
es: Los intérpretes pueden ser usados de forma interactiva o de forma no interactiva. En el modo interactivo, aceptan la entrada escrita desde el teclado. Cuando se ejecutan de forma no interactiva, los intérpretes ejecutan instrucciones leídas de un archivo.

source: A shell allows execution of @sc{gnu} commands, both synchronously and asynchronously. The shell waits for synchronous commands to complete before accepting more input; asynchronous commands continue to execute in parallel with the shell while it reads and executes additional commands. The @dfn{redirection} constructs permit fine-grained control of the input and output of those commands. Moreover, the shell allows control over the contents of commands' environments.
es: Un intérprete permite la ejecución de instrucciones @sc{gnu}, tanto síncrona como asíncronamente. El intérprete espera a que las instrucciones síncronas se completen antes de aceptar más entradas; las instrucciones asíncronas continúan ejecutándose en paralelo con el intérprete mientras que lee y ejecuta instrucciones adicionales. Las construcciones de @dfn{redirección} permiten un control preciso de la entrada y la salida de esas instrucciones. Asimismo, el intérprete proporciona control sobre los contenidos de los entornos de instrucciones.

source: Shells also provide a small set of built-in commands (@dfn{builtins}) implementing functionality impossible or inconvenient to obtain via separate utilities. For example, @code{cd}, @code{break}, @code{continue}, and @code{exec} cannot be implemented outside of the shell because they directly manipulate the shell itself. The @code{history}, @code{getopts}, @code{kill}, or @code{pwd} builtins, among others, could be implemented in separate utilities, but they are more convenient to use as builtin commands. All of the shell builtins are described in subsequent sections.
es: Los intérpretes también proporcionan un pequeño conjunto de instrucciones integradas (@dfn{builtins}) que implementan funcionalidad imposible o inconveniente de obtener mediante utilidades separadas. Por ejemplo, @code{cd}, @code{break}, @code{continue} y @code{exec} no pueden ser implementados fuera del intérprete porque manipulan directamente el intérprete en sí mismo. Las instrucciones integradas @code{history}, @code{getopts}, @code{kill} o @code{pwd}, entre otras, podrían ser implementadas en utilidades separadas, pero son más convenientes de usar como instrucciones integradas. Todas las funciones integradas del intérprete son descritas en las secciones posteriores.

source: While executing commands is essential, most of the power (and complexity) of shells is due to their embedded programming languages. Like any high-level language, the shell provides variables, flow control constructs, quoting, and functions.
es: Mientras que la ejecución de instrucciones es esencial, la mayoría del poder (y de la complejidad) de los intérpretes es debido a sus lenguajes de programación integrados. Como cualquier otro lenguaje de alto nivel, el intérprete proporciona variables, estructuras de control de flujo, entrecomillado y funciones.

source: Shells offer features geared specifically for interactive use rather than to augment the programming language. These interactive features include job control, command line editing, command history and aliases. Each of these features is described in this manual.
es: Los intérpretes ofrecen funcionalidades enfocadas específicamente para uso interactivo en vez de para aumentar el lenguaje de programación. Estas funcionalidades interactivas incluyen control de tareas, edición en línea de órdenes, historial de instrucciones y aliases. En este manual se describe cada una de estas funcionalidades.

source: These definitions are used throughout the remainder of this manual.
es: Estas definiciones son usadas a lo largo de este manual.

source: A family of open system standards based on Unix. Bash is primarily concerned with the Shell and Utilities portion of the @sc{posix} 1003.1 standard.
es: Una familia de estándares de sistemas abiertos basado en Unix. Bash se atañe principalmente a la porción Shell and Utilities del estándar @sc{posix} 1003.1.

source: blank
es: vacío

source: A space or tab character.
es: Un carácter de espacio o tabulación.

source: builtin
es: instrucción integrada

source: A command that is implemented internally by the shell itself, rather than by an executable program somewhere in the file system.
es: Una instrucción que está implementada internamente por el propio intérprete, en vez de por un programa ejecutable en algún lugar del archivo de ficheros.

source: control operator
es: operador de control

source: A @code{token} that performs a control function. It is a @code{newline} or one of the following: @samp{||}, @samp{&&}, @samp{&}, @samp{;}, @samp{;;}, @samp{;&}, @samp{;;&}, @samp{|}, @samp{|&}, @samp{(}, or @samp{)}.
es: Un @code{símbolo} que realiza una función de control. Es una @code{nueva línea} o uno de los siguientes: @samp{||}, @samp{&&}, @samp{&}, @samp{;}, @samp{;;}, @samp{;&}, @samp{;;&}, @samp{|}, @samp{|&}, @samp{(}, o @samp{)}.

source: exit status
es: estado de salida

source: The value returned by a command to its caller. The value is restricted to eight bits, so the maximum value is 255.
es: El valor devuelto por una instrucción a su ejecutor. El valor está restringido a ocho bits, así que el máximo valor es 255.

source: field
es: campo

source: A unit of text that is the result of one of the shell expansions. After expansion, when executing a command, the resulting fields are used as the command name and arguments.
es: Una unidad de texto que es el resultado de una de las expansiones del intérprete. Después de la expansión, cuando se ejecuta un comando, los campos resultantes son usados como el nombre de instrucción y los argumentos.

source: filename
es: nombre de archivo

source: A string of characters used to identify a file.
es: Una cadena de caracteres usada para identificar a un archivo.

source: job
es: tarea

source: A set of processes comprising a pipeline, and any processes descended from it, that are all in the same process group.
es: Un conjunto de procesos que componen una tubería, y cualquier otro proceso que descienda de ella, que se encuentran todos en el mismo grupo de proceso.

source: job control
es: control de tareas

source: A mechanism by which users can selectively stop (suspend) and restart (resume) execution of processes.
es: Un mecanismo por el cual los usuarios pueden selectivamente parar (suspender) o reiniciar (reanudar) la ejecución de procesos.

source: metacharacter
es: metacarácter

source: A character that, when unquoted, separates words. A metacharacter is a @code{space}, @code{tab}, @code{newline}, or one of the following characters: @samp{|}, @samp{&}, @samp{;}, @samp{(}, @samp{)}, @samp{<}, or @samp{>}.
es: Un carácter que, cuando no está entrecomillado, separa palabras. Un metacarácter es @code{espacio}, @code{tabulación}, @code{nueva línea} o uno de los siguientes caracteres: @samp{|}, @samp{&}, @samp{;}, @samp{(}, @samp{)}, @samp{<}, or @samp{>}.

source: name
es: nombre

source: identifier
es: identificador

source: A @code{word} consisting solely of letters, numbers, and underscores, and beginning with a letter or underscore. @code{Name}s are used as shell variable and function names. Also referred to as an @code{identifier}.
es: Una @code{palabra} que solo está compuesta de letras, números y barras bajas, y comienza por una letra o barra baja. Los @code{Nombre}s son usados como nombres de variables y funciones del intérprete. También mencionado como @code{indentificador}.

source: operator
es: operador

source: operator, shell
es: operador, intérprete

source: A @code{control operator} or a @code{redirection operator}. @xref{Redirections}, for a list of redirection operators. Operators contain at least one unquoted @code{metacharacter}.
es: Un @code{operador de control} o un @code{operador de redirección}. @xref{Redirecciones}, para una lista de los operadores de redirección. Los operadores contienen al menos un @code{metacarácter} sin entrecomillar.

source: process group
es: grupo de proceso

source: A collection of related processes each having the same process group @sc{id}.
es: Una colección de procesos relacionados que tienen el mismo @sc{id} de proceso de grupo.

source: process group ID
es: ID de proceso de grupo

source: A unique identifier that represents a @code{process group} during its lifetime.
es: Un identificador único que representa un @code{proceso de grupo} durante su tiempo de vida.

source: reserved word
es: palabra reservada

source: A @code{word} that has a special meaning to the shell. Most reserved words introduce shell flow control constructs, such as @code{for} and @code{while}.
es: Una @code{palabra} que tiene un significado especial para el intérprete. La mayoría de palabras reservadas introducen construcciones de control de flujo, como @code{for} y @code{while}.

source: return status
es: estado de retorno

source: A synonym for @code{exit status}.
es: Un sinónimo de @code{estado de salida}.

source: signal
es: señal

source: A mechanism by which a process may be notified by the kernel of an event occurring in the system.
es: Un mecanismo por el cual un proceso puede ser notificado por el núcleo de un evento ocurrido en el sistema.

source: special builtin
es: instrucción integrada especial

source: A shell builtin command that has been classified as special by the @sc{posix} standard.
es: Una instrucción integrada del intérprete que ha sido clasificada como especial por el estándar @sc{posix}.

source: token
es: símbolo

source: A sequence of characters considered a single unit by the shell. It is either a @code{word} or an @code{operator}.
es: Una secuencia de caracteres considerada como unidad única por el intérprete. O bien es una @code{palabra} o un @code{operador}

source: word
es: palabra

source: A sequence of characters treated as a unit by the shell. Words may not include unquoted @code{metacharacters}.
es: Una secuencia de caracteres tratada como una unidad por el intérprete. Las palabras no pueden incluir @code{metacaracteres} sin entrecomillar.

source: Bash is an acronym for @samp{Bourne-Again SHell}. The Bourne shell is the traditional Unix shell originally written by Stephen Bourne. All of the Bourne shell builtin commands are available in Bash, The rules for evaluation and quoting are taken from the @sc{posix} specification for the `standard' Unix shell.
es: Bash es un acrónimo para @samp{Bourne-Again SHell}. El Bourne shell es el intérprete tradicional de Unix escrito originalmente por Stephen Bourne. Todas las instrucciones integradas del Bourne shell están disponibles en Bash. Las reglas para evaluación y entrecomillado se toman de la especificación @sc{posix} para el intérprete Unix `estándar'.

source: This chapter briefly summarizes the shell's `building blocks': commands, control structures, shell functions, shell @i{parameters}, shell expansions, @i{redirections}, which are a way to direct input and output from and to named files, and how the shell executes commands.
es: Este capítulo resume brevemente los `bloques constructores' del intérprete: instrucciones, estructuras de control, funciones del intérprete, @i{parámetros} del intérprete, expansiones del intérprete, @i{redirecciones}, las cuales son una forma de dirigir entrada y salida desde y hacia archivos nombrados, y cómo el intérprete ejecuta instrucciones.

source: Shell Syntax
es: Sintaxis del Intérprete

source: What your input means to the shell.
es: Qué significa su entrada para el intérprete.

source: Shell Commands
es: Instrucciones del Intérprete

source: The types of commands you can use.
es: Los tipos de instrucciones que puede usar.

source: Shell Functions
es: Funciones del Intérprete

source: Grouping commands by name.
es: Agrupando instrucciones por nombre.

source: Shell Parameters
es: Parámetros del Intérprete

source: How the shell stores values.
es: Cómo el intérprete guarda valores.

source: Shell Expansions
es: Expansiones del Intérprete

source: How Bash expands parameters and the various expansions available.
es: Cómo Bash expande parámetros y las distintas expansiones disponibles.

source: Redirections
es: Redirecciones

source: A way to control where input and output go.
es: Una forma de controlar adónde van la entrada y la salida.

source: Executing Commands
es: Ejecutando Instrucciones

source: What happens when you run a command.
es: Qué pasa cuando ejecutas una instrucción.

source: Shell Scripts
es: Guiones del Intérprete

source: Executing files of shell commands.
es: Ejecutando archivos de instrucciones del intérprete.

source: Shell Operation
es: Funcionamiento del Intérprete

source: The basic operation of the shell.
es: El funcionamiento básico del intérprete.

source: Quoting
es: Entrecomillado

source: How to remove the special meaning from characters.
es: Cómo eliminar el significado especial de caracteres.

source: Comments
es: Comentarios

source: How to specify comments.
es: Cómo especificar comentarios.

source: When the shell reads input, it proceeds through a sequence of operations. If the input indicates the beginning of a comment, the shell ignores the comment symbol (@samp{#}), and the rest of that line.
es: Cuando el intérprete lee la entrada, procede a través de una secuencia de operaciones. Si la entrada indica el inicio de un comentario, el intérprete ignora el símbolo de comentario (@samp{#}) y el resto de esa línea.
