Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: How the shell matches patterns.
es: Cómo el intérprete coincide con patrones.

source: expansion, filename
es: expansión, nombre de archivo

source: expansion, pathname
es: expansión, nombre de ruta

source: pathname expansion
es: expansión de nombre de ruta

source: After word splitting, unless the @option{-f} option has been set (@pxref{The Set Builtin}), Bash scans each word for the characters @samp{*}, @samp{?}, and @samp{[}. If one of these characters appears, then the word is regarded as a @var{pattern}, and replaced with an alphabetically sorted list of filenames matching the pattern (@pxref{Pattern Matching}). If no matching filenames are found, and the shell option @code{nullglob} is disabled, the word is left unchanged. If the @code{nullglob} option is set, and no matches are found, the word is removed. If the @code{failglob} shell option is set, and no matches are found, an error message is printed and the command is not executed. If the shell option @code{nocaseglob} is enabled, the match is performed without regard to the case of alphabetic characters.
es: Después de la división de palabras, a no ser que la opción @option{-f} haya sido establecida (@pxref{La Instrucción Integrada Set}), Bash escanea cada palabra en busca de los caracteres @samp{*}, @samp{?} y @samp{[}. Si uno de estos caracteres aparece, la palabra es tratada como un @var{patrón} y reemplazada con una lista de nombres de archivo ordenada alfabéticamente que coincide con el patrón (@pxref{Coincidencia de Patrones}). Si no se encuentra ningún nombre de archivo coincidente y está desactivada la opción del intérprete @code{nullglob}, la palabra se deja sin modificar. Si la opción @code{nullglob} está habilitada y no se encuentran coincidencias, la palabra es eliminada. Si la opción del intérprete @code{failglob} está establecida y no se encuentran coincidencias, se imprime un mensaje de error y no se ejecuta la instrucción. Si está habilitada la opción de intérprete @code{nocaseglob}, la coincidencia se realiza sin tener en cuenta las mayúsculas y minúsculas de caracteres alfabéticos.

source: When a pattern is used for filename expansion, the character @samp{.} at the start of a filename or immediately following a slash must be matched explicitly, unless the shell option @code{dotglob} is set. The filenames @samp{.} and @samp{..} must always be matched explicitly, even if @code{dotglob} is set. In other cases, the @samp{.} character is not treated specially.
es: Cuando se usa un patrón para la expansión de nombre de archivo, el carácter @samp{.} al principio de un nombre de archivo o inmediatamente siguiendo a una barra debe ser coincidido explícitamente, a no ser que la opción del intérprete @code{dotglob} esté habilitada. Los nombres de archivo @samp{.} y @samp{..} deben ser coincididos siempre explícitamente, incluso si @code{dotglob} está habilitada. En otros casos, el carácter @samp{.} no es tratado de forma especial.

source: When matching a filename, the slash character must always be matched explicitly by a slash in the pattern, but in other matching contexts it can be matched by a special pattern character as described below (@pxref{Pattern Matching}).
es: Al coincidir con un nombre de archivo, el carácter de barra debe ser siempre coincidido expl@'icitamente por una barra en el patrón, pero en otros contextos de coincidencia puede ser coincidido por un carácter de patrón especial como se describe abajo (@pxref{Coincidencia de Patrones}).

source: See the description of @code{shopt} in @ref{The Shopt Builtin}, for a description of the @code{nocaseglob}, @code{nullglob}, @code{failglob}, and @code{dotglob} options.
es: Consulte la descripción de @code{shopt} en @ref{La Instrucción Integrada Shopt}, para una descripción de las opciones @code{nocaseglob}, @code{nullglob}, @code{failglob} y @code{dotglob}.

source: The @env{GLOBIGNORE} shell variable may be used to restrict the set of file names matching a pattern. If @env{GLOBIGNORE} is set, each matching file name that also matches one of the patterns in @env{GLOBIGNORE} is removed from the list of matches. If the @code{nocaseglob} option is set, the matching against the patterns in @env{GLOBIGNORE} is performed without regard to case. The filenames @file{.} and @file{..} are always ignored when @env{GLOBIGNORE} is set and not null. However, setting @env{GLOBIGNORE} to a non-null value has the effect of enabling the @code{dotglob} shell option, so all other filenames beginning with a @samp{.} will match. To get the old behavior of ignoring filenames beginning with a @samp{.}, make @samp{.*} one of the patterns in @env{GLOBIGNORE}. The @code{dotglob} option is disabled when @env{GLOBIGNORE} is unset.
es: La variable del intérprete @env{GLOBIGNORE} puede ser usada para restringir el conjunto de nombres de archivo que coinciden con un patrón. Si @env{GLOBIGNORE} está establecida, cada nombre de archivo coincidente que también coincida con uno de los patrones en @env{GLOBIGNORE} es eliminado de la lista de coincidencias. Si la opción @code{nocaseglob} está habilitada, la coincidencia con el patrón en @env{GLOBIGNORE} se realiza sin importar las mayúsculas y minúsculas. Los nombres de archivo @file{.} y @file{..} siempre se ignoran cuando @env{GLOBIGNORE} está establecida y no es nula. Sin embargo, establecer @env{GLOBIGNORE} a un valor no nulo tiene el efecto de activar la opción del intérprete @code{dotglob}, para que todos los otros nombres de archivo que empiezan por @samp{.} coincidan. Para obtener el viejo comportamiento de ignorar los nombres de archivo que comienzan por @samp{.}, haz @samp{.*} uno de los patrones en @env{GLOBIGNORE}. La opción @code{dotglob} se desabilita cuando @env{GLOBIGNORE} no está establecida.

source: pattern matching
es: coincidencia de patrón

source: matching, pattern
es: coincidencia, patrón

source: Any character that appears in a pattern, other than the special pattern characters described below, matches itself. The @sc{nul} character may not occur in a pattern. A backslash escapes the following character; the escaping backslash is discarded when matching. The special pattern characters must be quoted if they are to be matched literally.
es: Cualquier carácter que aparezca en un patrón, distinto a los caracteres de patrón especial descritos más abajo, coincide con sí mismo. El carácter @sc{nul} no puede ocurrir en un patrón. Una barra invertida escapa el siguiente carácter; la barra invertida de escape se descarta durante la coincidencia. Los caracteres de patrones especiales deben ser entrecomillados si no van a ser coincididos literalmente.

source: The special pattern characters have the following meanings:
es: Los caracteres de patrón especiales tienen los siguientes significados:

source: Matches any string, including the null string. When the @code{globstar} shell option is enabled, and @samp{*} is used in a filename expansion context, two adjacent @samp{*}s used as a single pattern will match all files and zero or more directories and subdirectories. If followed by a @samp{/}, two adjacent @samp{*}s will match only directories and subdirectories.
es: Coincide con cualquier cadena, incluida la cadena nula. Cuando está habilitada la opción @code{globstar} y se usa @samp{*} en un contexto de expansión de nombre de archivo, dos @samp{*} adyacentes usados como un patrón único coincidirán con todos los archivos y cero o más directorios y subdirectorios. Detrás de una @samp{/}, dos @samp{*} adyacentes solo coincidirán con directorios y subdirectorios.

source: Matches any single character.
es: Coincide con un único carácter.

source: Matches any one of the enclosed characters. A pair of characters separated by a hyphen denotes a @var{range expression}; any character that falls between those two characters, inclusive, using the current locale's collating sequence and character set, is matched. If the first character following the @samp{[} is a @samp{!} or a @samp{^} then any character not enclosed is matched. A @samp{@minus{}} may be matched by including it as the first or last character in the set. A @samp{]} may be matched by including it as the first character in the set. The sorting order of characters in range expressions is determined by the current locale and the values of the @env{LC_COLLATE} and @env{LC_ALL} shell variables, if set.
es: Coincide con cualquiera de los patrones incluidos. Una pareja de patrones separada por un guion denota una @var{expresión de rango}; cualquier carácter que se encuentre entre esos dos caracteres, inclusive, usando la secuencia de ordenación y el conjunto de caracteres de la configuración regional actual, es coincidido. Si el primer carácter que sigue al @samp{[} es un @samp{!} o un @samp{^}, es coincidido cualquier carácter no incluido. Un @samp{@minus{}} puede ser coincidido incluyéndolo como el primer o último carácter en el conjunto. Un @samp{]} puede ser coincidido incluyéndolo como el primer carácter en el conjunto. El orden de ordenación de caracteres en las expresiones de rango se determina por la configuración regional actual y los valores de las variables del intérprete @env{LC_COLLATE} y @env{LC_ALL}, si están establecidas.

source: For example, in the default C locale, @samp{[a-dx-z]} is equivalent to @samp{[abcdxyz]}. Many locales sort characters in dictionary order, and in these locales @samp{[a-dx-z]} is typically not equivalent to @samp{[abcdxyz]}; it might be equivalent to @samp{[aBbCcDdxXyYz]}, for example. To obtain the traditional interpretation of ranges in bracket expressions, you can force the use of the C locale by setting the @env{LC_COLLATE} or @env{LC_ALL} environment variable to the value @samp{C}, or enable the @code{globasciiranges} shell option.
es: Por ejemplo, en la configuración regional predeterminada C, @samp{[a-dx-z]} es equivalente a @samp{[abcdxyz]}. Muchas configuraciones regionales ordenan los caracteres en orden de diccionario, y en estas configuraciones regionales @samp{[a-dx-z]} no es normalmente equivalente a @samp{[abcdxyz]}; podría ser equivalente a @samp{[aBbCcDdxXyYz]}, por ejemplo. Para obtener la interpretación tradicional de rangos en las expresiones de llaves, puede forzar el uso de la configuración regional C estableciendo la variable de entorno @env{LC_COLLATE} o @env{LC_ALL} al valor @samp{C}, o habilitar la opción del intérprete @code{globasciiranges}.

source: Within @samp{[} and @samp{]}, @var{character classes} can be specified using the syntax @code{[:}@var{class}@code{:]}, where @var{class} is one of the following classes defined in the @sc{posix} standard:
es: Dentro de @samp{[} y @samp{]}, se pueden especificar @var{clases de caracteres} usando la sintaxis @code{[:}@var{clase}@code{:]}, donde @var{clase} es una de las siguientes clases definidas en el estándar @sc{posix}:

source: A character class matches any character belonging to that class. The @code{word} character class matches letters, digits, and the character @samp{_}.
es: Una clase de carácter coincide cualquier carácter que perteneciente a esa clase. La clase de carácter @code{word} coincide con letras, dígitos y el carácter @samp{_}.

source: Within @samp{[} and @samp{]}, an @var{equivalence class} can be specified using the syntax @code{[=}@var{c}@code{=]}, which matches all characters with the same collation weight (as defined by the current locale) as the character @var{c}.
es: Dentro de @samp{[} y @samp{]}, se puede especificar una @var{clase de equivalencia} usando la sintaxis @code{[=}@var{c}@code{=]}, que coincide con todos los caracteres con el mismo peso de ordenación (según esté definido en la configuración regional actual) como el carácter @var{c}.

source: Within @samp{[} and @samp{]}, the syntax @code{[.}@var{symbol}@code{.]} matches the collating symbol @var{symbol}.
es: Dentro de @samp{[} y @samp{]}, la sintaxis @code{[.}@var{símbolo}@code{.]} coincide con el símbolo de ordenación @var{símbolo}.

source: If the @code{extglob} shell option is enabled using the @code{shopt} builtin, several extended pattern matching operators are recognized. In the following description, a @var{pattern-list} is a list of one or more patterns separated by a @samp{|}. Composite patterns may be formed using one or more of the following sub-patterns:
es: Si la opción del intérprete @code{extglob} se habilita usando la instrucción integrada @code{shopt}, se reconocen varios operadores de coincidencia de patrón extendido. En la siguiente descripción, una @var{lista-de-patrones} es una lista de uno o más patrones separados por un @samp{|}. Se pueden formar patrones compuestos usando uno o más de los siguientes subpatrones:

source: ?(@var{pattern-list})
es: ?(@var{lista-de-patrones})

source: Matches zero or one occurrence of the given patterns.
es: Coincide con cero o una ocurrencia de los patrones dados.

source: *(@var{pattern-list})
es: *(@var{lista-de-patrones})

source: Matches zero or more occurrences of the given patterns.
es: Coincide con cero o más ocurrencias de los patrones dados.

source: +(@var{pattern-list})
es: +(@var{lista-de-patrones})

source: Matches one or more occurrences of the given patterns.
es: Coincide con una o más ocurrencias de los patrones dados.

source: @@(@var{pattern-list})
es: @@(@var{lista-de-patrones})

source: Matches one of the given patterns.
es: Coincide con uno de los patrones dados.

source: !(@var{pattern-list})
es: !(@var{lista-de-patrones})

source: Matches anything except one of the given patterns.
es: Coincide con cualquier cosa menos uno de los patrones dados.

source: Complicated extended pattern matching against long strings is slow, especially when the patterns contain alternations and the strings contain multiple matches. Using separate matches against shorter strings, or using arrays of strings instead of a single long string, may be faster.
es: Las coincidencias extendidas de patrón complicadas con cadenas largas es lenta, especialmente cuando los patrones contienen alteraciones y las cadenas contienen varias coincidencias. Usar coincidencias separadas sobre cadenas más cortas o usar vectores de cadenas en vez de una única cadena larga, puede ser más rápido.

source: After the preceding expansions, all unquoted occurrences of the characters @samp{\}, @samp{'}, and @samp{"} that did not result from one of the above expansions are removed.
es: Después de las expansiones precedentes, todas las ocurrencias sin entrecomillar de los caracteres @samp{\}, @samp{'} y @samp{"} que no se produjeron a partir de una de las expresiones anteriores son eliminadas.

source: redirection
es: redirección

source: Before a command is executed, its input and output may be @var{redirected} using a special notation interpreted by the shell. Redirection allows commands' file handles to be duplicated, opened, closed, made to refer to different files, and can change the files the command reads from and writes to. Redirection may also be used to modify file handles in the current shell execution environment. The following redirection operators may precede or appear anywhere within a simple command or may follow a command. Redirections are processed in the order they appear, from left to right.
es: Antes de que se ejecute una instrucción, su entrada y su salida pueden ser @var{redirigidas} usando una notación especial interpretada por el intérprete. La redirección permite a manejadores de archivos de instrucciones ser duplicados, abiertos, cerrados, referidos a otros archivos, y puede cambiar los archivos de los que la instrucción lee y a los que escribe. La redirección también se puede usar para modificar los manejadores de archivos en el actual entorno de ejecución del intérprete. Los siguientes operadores de redirección pueden preceder o aparecer en cualquier lugar dentro de una instrucción simple o pueden seguir a una instrucción. Las redirecciones se procesan en el orden en que aparecen, de izquierda a derecha.

source: Each redirection that may be preceded by a file descriptor number may instead be preceded by a word of the form @{@var{varname}@}. In this case, for each redirection operator except >&- and <&-, the shell will allocate a file descriptor greater than 10 and assign it to @{@var{varname}@}. If >&- or <&- is preceded by @{@var{varname}@}, the value of @var{varname} defines the file descriptor to close. If @{@var{varname}@} is supplied, the redirection persists beyond the scope of the command, allowing the shell programmer to manage the file descriptor himself.
es: Cada redirección que pueda ser precedida por un número de descriptor de archivo puede ser precedida en su lugar por una palabra de la forma @{@var{nombre-de-var}. En este caso, para cada operador de redirección excepto >&- y <&-, el intérprete destinará un descriptor de archivo mayor que 10 y lo asignará a @{@var{nombre-de-var}. Si >&- o <&- es precedido por @{@var{nombre-de-var}@}, el valor de @var{nombre-de-var} define el descriptor de archivo que cerrar. Si se proporciona @{@var{nombre-de-var}@}, la redirección persiste más allá del alcance de la instrucción, permitiendo al programador del intérprete manejar el descriptor de archivo por su cuenta.

source: In the following descriptions, if the file descriptor number is omitted, and the first character of the redirection operator is @samp{<}, the redirection refers to the standard input (file descriptor 0). If the first character of the redirection operator is @samp{>}, the redirection refers to the standard output (file descriptor 1).
es: En las siguientes descripciones, si se omite el número del descriptor de archivo y el primer carácter del operador de redirección es @samp{<}, la redirección hace referencia a la entrada estándar (descriptor de archivo 0). Si el primer carácter del operador de redirección es @samp{>}, la redirección hace referencia a la salida estándar (descriptor de archivo 1).

source: The word following the redirection operator in the following descriptions, unless otherwise noted, is subjected to brace expansion, tilde expansion, parameter expansion, command substitution, arithmetic expansion, quote removal, filename expansion, and word splitting. If it expands to more than one word, Bash reports an error.
es: La palabra que sigue al operador de redirección en las siguientes descripciones, a no ser que se indique lo contrario, está sujeta a la expansión de llaves, expansión de virgulilla, expansión de parámetros, sustitución de instrucciones, expansión aritmética, eliminación de comillas, expansión de nombre de archivo y división de palabras. Si se expande a más de una palabra, Bash informa de un error.

source: Note that the order of redirections is significant. For example, the command
es: Observe que el orden de las redirecciones es importante. Por ejemplo, la instrucción

source: ls > @var{dirlist} 2>&1
es: ls > @var{lista-de-dir} 2>&1

source: directs both standard output (file descriptor 1) and standard error (file descriptor 2) to the file @var{dirlist}, while the command
es: dirige tanto la salida estándar (descriptor de archivo 1) como el error estándar (descriptor de archivo 2) al archivo @var{lista-de-dir}, mientras que la instrucción

source: ls 2>&1 > @var{dirlist}
es: ls 2>&1 > @var{lista-de-dir}

source: directs only the standard output to file @var{dirlist}, because the standard error was made a copy of the standard output before the standard output was redirected to @var{dirlist}.
es: dirige solo la salida estándar al archivo @var{lista-de-dir}, porque el error estándar fue convertido en una copia de la salida estándar antes de que la salida estándar fuera redirigida a @var{lista-de-dir}.

source: Bash handles several filenames specially when they are used in redirections, as described in the following table. If the operating system on which Bash is running provides these special files, bash will use them; otherwise it will emulate them internally with the behavior described below.
es: Bash maneja varios nombres de archivos de forma especial cuando son usados en redirecciones, como se describe en la siguiente tabla. Si el sistema operativo en que Bash se ejecuta proporciona estos archivos especiales, Bash los usará; en caso contrario, los emulará internamente con el comportamiento descrito a continuación.

source: /dev/fd/@var{fd}
es: /dev/fd/@var{da}

source: If @var{fd} is a valid integer, file descriptor @var{fd} is duplicated.
es: Si @var{da} es un entero válido, se duplica el descriptor de archivo @var{da}.

source: File descriptor 0 is duplicated.
es: Se duplica el descriptor de archivo 0.

source: File descriptor 1 is duplicated.
es: Se duplica el descriptor de archivo 1.

source: File descriptor 2 is duplicated.
es: Se duplica el descriptor de archivo 2.

source: /dev/tcp/@var{host}/@var{port}
es: /dev/tcp/@var{anfitrión}/@var{puerto}

source: If @var{host} is a valid hostname or Internet address, and @var{port} is an integer port number or service name, Bash attempts to open the corresponding TCP socket.
es: Si @var{anfitrión} es un nombre válido de anfitrión o dirección de Internet y @var{puerto} es un número entero de puerto o nombre de servicio, Bash trata de abrir el socket TCP correspondiente.

source: /dev/udp/@var{host}/@var{port}
es: /dev/udp/@var{anfitrión}/@var{puerto}

source: If @var{host} is a valid hostname or Internet address, and @var{port} is an integer port number or service name, Bash attempts to open the corresponding UDP socket.
es: Si @var{anfitrión} es un nombre válido de anfitrión o dirección de Internet y @var{puerto} es un número entero de puerto o nombre de servicio, Bash trata de abrir el socket UDP correspondiente.

source: A failure to open or create a file causes the redirection to fail.
es: Un fallo al crear o abrir un archivo hace que la redirección falle.

source: Redirections using file descriptors greater than 9 should be used with care, as they may conflict with file descriptors the shell uses internally.
es: Las redirecciones usando descriptores de archivo mayores que 9 deberían ser usadas con cuidado, ya que pueden entrar en conflicto con descriptores de archivo que el intérprete usa internamente.

source: Redirecting Input
es: Redirigiendo Entrada

source: Redirection of input causes the file whose name results from the expansion of @var{word} to be opened for reading on file descriptor @code{n}, or the standard input (file descriptor 0) if @code{n} is not specified.
es: La redirección de entrada hace que los archivos cuyo nombre deriva de la expansión de @var{palabra} sean abiertos para lectura en el descriptor de archivo @code{n}, o la entrada estándar (descriptor de archivo 0) si @code{n} no está especificado.

source: The general format for redirecting input is:
es: El formato generar para redirigir una entrada es:

source: [@var{n}]<@var{word}
es: [@var{n}]<@var{palabra}

source: Redirecting Output
es: Redirigiendo Salida

source: Redirection of output causes the file whose name results from the expansion of @var{word} to be opened for writing on file descriptor @var{n}, or the standard output (file descriptor 1) if @var{n} is not specified. If the file does not exist it is created; if it does exist it is truncated to zero size.
es: La redirección de salida hace que el archivo cuyo nombre deriva de la expansión de @var{palabra} sea abierto para escritura en el descriptor de archivo @var{n}, o el error estándar (descriptor de archivo 1) si no se especifica @var{n}. Si el archivo no existe, se crea; si existe, es truncado a tamaño cero.

source: The general format for redirecting output is:
es: El formato general para redirigir una salida es:

source: [@var{n}]>[|]@var{word}
es: [@var{n}]>[|]@var{palabra}
