Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: In the context where an assignment statement is assigning a value to a shell variable or array index (@pxref{Arrays}), the @samp{+=} operator can be used to append to or add to the variable's previous value. This includes arguments to builtin commands such as @code{declare} that accept assignment statements (@var{declaration} commands). When @samp{+=} is applied to a variable for which the @var{integer} attribute has been set, @var{value} is evaluated as an arithmetic expression and added to the variable's current value, which is also evaluated. When @samp{+=} is applied to an array variable using compound assignment (@pxref{Arrays}), the variable's value is not unset (as it is when using @samp{=}), and new values are appended to the array beginning at one greater than the array's maximum index (for indexed arrays), or added as additional key-value pairs in an associative array. When applied to a string-valued variable, @var{value} is expanded and appended to the variable's value.
es: En el contexto en el que una sentencia de asignación esté asignando un valor a una variable o índice de vector (@pxref{Vectores}) del intérprete, el operador @samp{+=} puede ser usado para añadir o sumar al valor previo de la variable. Esto incluye argumentos de instrucciones integradas como @code{declare} que aceptan sentencias de asignación (instrucciones de @var{declaración}). Cuando @samp{+=} se aplica a una variable para la cual el atributo @var{integer} ha sido establecido, @var{valor} se evalúa como una expresión aritmética y se suma al valor actual de la variable, que también es evaluado. Cuando @samp{+=} se aplica a una variable de vector usando la asignación compuesta (@pxref{Vectores}), el valor de la variable no es eliminado (como lo es al usar @samp{=}), y se adjuntan nuevos valores al vector empezando por un número a partir del índice máximo del vector (para vectores indexados), o se añade como una pareja clave-valor en un vector asociativo. Cuando se aplica a una variable con valor de cadena, @var{valor} se expande y se añade al valor de la variable.

source: A variable can be assigned the @var{nameref} attribute using the @option{-n} option to the @code{declare} or @code{local} builtin commands (@pxref{Bash Builtins}) to create a @var{nameref}, or a reference to another variable. This allows variables to be manipulated indirectly. Whenever the nameref variable is referenced, assigned to, unset, or has its attributes modified (other than using or changing the nameref attribute itself), the operation is actually performed on the variable specified by the nameref variable's value. A nameref is commonly used within shell functions to refer to a variable whose name is passed as an argument to the function. For instance, if a variable name is passed to a shell function as its first argument, running
es: Se puede asignar una variable el atributo @var{nameref} usando la opción @option{-n} para las instrucciones integradas @code{declare} o @code{local} (@pxref{Instrucciones Integradas de Bash}) para crear una @var{nameref}, o una referencia a otra variable. Esto permite que las variables sean manipuladas indirectamente. Cada vez que se haga referencia a la variable nameref, se asigne, elimine o sean modificados sus atributos (aparte de usando o cambiando el atributo nameref en sí), la operación se realiza en la variable especificada por el valor de la variable nameref. Un nameref se usa comúnmente dentro de las funciones del intérprete para referirse a una variable cuyo nombre es pasado como un argumento a la función. Por ejemplo, si un nombre de variable es pasado a una función del intérprete como su primer argumento, ejecutar

source: inside the function creates a nameref variable @var{ref} whose value is the variable name passed as the first argument. References and assignments to @var{ref}, and changes to its attributes, are treated as references, assignments, and attribute modifications to the variable whose name was passed as @code{$1}.
es: dentro de la función crea una variable nameref @var{ref} cuyo valor es el nombre de variable pasado como el primer argumento. Las referencias y asignaciones a @var{ref}, y cambios a sus atributos, son tratados como referencias, asignaciones y modificaciones de atributo a la variable cuyo nombre fue pasado a @code{$1}.

source: If the control variable in a @code{for} loop has the nameref attribute, the list of words can be a list of shell variables, and a name reference will be established for each word in the list, in turn, when the loop is executed. Array variables cannot be given the nameref attribute. However, nameref variables can reference array variables and subscripted array variables. Namerefs can be unset using the @option{-n} option to the @code{unset} builtin (@pxref{Bourne Shell Builtins}). Otherwise, if @code{unset} is executed with the name of a nameref variable as an argument, the variable referenced by the nameref variable will be unset.
es: Si la variable de control en un bucle @code{for} tiene el atributo nameref, la lista de palabras puede ser una lista de variables del intérprete, y una referencia de nombre será establecida para cada palabra en la lista, en orden, cuando el bucle sea ejecutado. No se le puede dar el atributo nameref a las variables de vector. Sin embargo, las variables nameref pueden hacer referencia a variables de vector y variables de subíndice de vector. Los namerefs pueden ser eliminados usando la opción @option{-n} de la instrucción integrada @code{unset} (@pxref{Instrucciones Integradas del Bourne Shell}). De lo contrario, si se ejecuta @code{unset} con el nombre de una variable nameref como un argumento, la variable referenciada por la variable nameref será eliminada.

source: parameters, positional
es: parámetros, posicional

source: A @var{positional parameter} is a parameter denoted by one or more digits, other than the single digit @code{0}. Positional parameters are assigned from the shell's arguments when it is invoked, and may be reassigned using the @code{set} builtin command. Positional parameter @code{N} may be referenced as @code{$@{N@}}, or as @code{$N} when @code{N} consists of a single digit. Positional parameters may not be assigned to with assignment statements. The @code{set} and @code{shift} builtins are used to set and unset them (@pxref{Shell Builtin Commands}). The positional parameters are temporarily replaced when a shell function is executed (@pxref{Shell Functions}).
es: Un @var{parámetro posicional} es un parámetro denotado por uno o más dígitos, aparte del único dígito @code{0}. Los argumentos posicionales se asignan desde los argumentos del intérprete cuando es llamado y pueden ser reasignados usando la instrucción integrada @code{set}. El parámetro posicional @code{N} puede ser referenciado como @code{$@{N@}}, o como @code{$N} cuando @code{N} consta de un único dígito. Los parámetros posicionales no pueden ser asignados con declaraciones de asignación. Las instrucciones integradas @code{set} y @code{shift} son usadas para asignar y eliminarlos (@pxref{Instrucciones Integradas del Intérprete}). Los parámetros posicionales son temporalmente reemplazados cuando se ejecuta una función del intérprete (@pxref{Funciones del Intérprete}).

source: When a positional parameter consisting of more than a single digit is expanded, it must be enclosed in braces.
es: Cuando un parámetro posicional que consta de un único dígito se expande, debe estar rodeado de llaves.

source: parameters, special
es: parámetros, especial

source: The shell treats several parameters specially. These parameters may only be referenced; assignment to them is not allowed.
es: El intérprete trata varios parámetros de forma especial. Estos parámetros solo pueden ser referenciados; las asignaciones a ellos no están permitidas.

source: ($*) Expands to the positional parameters, starting from one. When the expansion is not within double quotes, each positional parameter expands to a separate word. In contexts where it is performed, those words are subject to further word splitting and pathname expansion. When the expansion occurs within double quotes, it expands to a single word with the value of each parameter separated by the first character of the @env{IFS} special variable. That is, @code{"$*"} is equivalent to @code{"$1@var{c}$2@var{c}@dots{}"}, where @var{c} is the first character of the value of the @code{IFS} variable. If @env{IFS} is unset, the parameters are separated by spaces. If @env{IFS} is null, the parameters are joined without intervening separators.
es: ($*) Se expande a los parámetros posicionales, empezando por uno. Cuando la expansión no está entre comillas dobles, cada parámetro posicional se expande a una palabra separada. En los contextos donde se realiza, aquellas palabras están sujetas a una división de palabras y expansión de nombre de archivo posteriores. Cuando la expansión ocurre dentro de comillas dobles, se expande a una única palabra con el valor de cada parámetro separado por el primer carácter de la variable especial @env{IFS}. Es decir, @code{"$*} es equivalente a @code{"$1@var{c}$2@var{c}@dots{}"}, donde @var{c} es el primer carácter del valor de la variable @code{IFS}. Si se elimina @env{IFS}, los parámetros se separan por espacios. Si @env{IFS} no está asignado, los parámetros se unen sin separadores intermedios.

source: ($@@) Expands to the positional parameters, starting from one. In contexts where word splitting is performed, this expands each positional parameter to a separate word; if not within double quotes, these words are subject to word splitting. In contexts where word splitting is not performed, this expands to a single word with each positional parameter separated by a space. When the expansion occurs within double quotes, and word splitting is performed, each parameter expands to a separate word. That is, @code{"$@@"} is equivalent to @code{"$1" "$2" @dots{}}. If the double-quoted expansion occurs within a word, the expansion of the first parameter is joined with the beginning part of the original word, and the expansion of the last parameter is joined with the last part of the original word. When there are no positional parameters, @code{"$@@"} and @code{$@@} expand to nothing (i.e., they are removed).
es: ($@@) Se expande a los parámetros posicionales empezando por uno. En contextos donde se realiza la división de palabras, esto expande cada parámetro posicional a una palabra separada; si no está entre comillas dobles, estas palabras están sujetas a la división de palabras. En contextos donde no se realiza la división de palabras, esto se expande a una única palabra con cada parámetro posicional separado por un espacio. Cuando la expansión ocurre dentro de comillas dobles y se realiza la división de palabras, cada parámetro se expande a una palabra separada. Es decir, @code{"$@@"} es equivalente a @code{"$1" "$2" @dots{}}. Si la expansión rodeada entre comillas dobles ocurre dentro de una palabra, la expansión del primer parámetro se una con la parte inicial de la palabra original y la expansión del último parámetro se una con la última parte de la palabra original. Cuando no hay parámetros posicionales, @code{"$@@"} y @code{$@@} se expanden a nada (es decir, son eliminados).

source: ($#) Expands to the number of positional parameters in decimal.
es: ($#) Se expande al número de parámetros posicionales en decimal.

source: ($?) Expands to the exit status of the most recently executed foreground pipeline.
es: ($?) Se expande al estado de salida de la tubería en primer plano ejecutada más recientemente.

source: ($-, a hyphen.) Expands to the current option flags as specified upon invocation, by the @code{set} builtin command, or those set by the shell itself (such as the @option{-i} option).
es: ($-, un guion.) Se expande a las actuales opciones centinelas como se especifica en la llamada, por la instrucción integrada @code{set} o aquellas establecidas por el propio intérprete (como la opción @option{-i}).

source: ($$) Expands to the process @sc{id} of the shell. In a @code{()} subshell, it expands to the process @sc{id} of the invoking shell, not the subshell.
es: ($$) Se expande al @sc{id} de proceso del intérprete. En un subintérprete @code{()}, se expande al @sc{id} de proceso del intérprete que lo llama, no del subintérprete.

source: ($!) Expands to the process @sc{id} of the job most recently placed into the background, whether executed as an asynchronous command or using the @code{bg} builtin (@pxref{Job Control Builtins}).
es: ($!) Se expande al @sc{id} de proceso de tarea ubicada en segundo plano más recientemente, bien ejecutada como una instrucción asíncrona o usando la instrucción integrada @code{bg} (@pxref{Instrucciones Integradas de Control de Tareas}).

source: ($0) Expands to the name of the shell or shell script. This is set at shell initialization. If Bash is invoked with a file of commands (@pxref{Shell Scripts}), @code{$0} is set to the name of that file. If Bash is started with the @option{-c} option (@pxref{Invoking Bash}), then @code{$0} is set to the first argument after the string to be executed, if one is present. Otherwise, it is set to the filename used to invoke Bash, as given by argument zero.
es: ($0) Se expande al nombre del intérprete o el guion del intérprete. Esto es establecido durante la inicialización del intérprete. Si Bash se invoca con un archivo de instrucciones (@pxref{Guiones del Intérprete}), @code{$0} se establece al nombre de ese archivo. Si Bash se inicia con la opción @option{-c} (@pxref{Llamando a Bash}), entonces @code{$0} se establece al primer argumento después de que la cadena sea ejecutada, si una está presente. De lo contrario, es establecido al nombre de archivo usado para llamar a Bash, como si fuera dado como argumento cero.

source: ($_, an underscore.) At shell startup, set to the absolute pathname used to invoke the shell or shell script being executed as passed in the environment or argument list. Subsequently, expands to the last argument to the previous simple command executed in the foreground, after expansion. Also set to the full pathname used to invoke each command executed and placed in the environment exported to that command. When checking mail, this parameter holds the name of the mail file.
es: ($_, una barra baja). Durante el inicio del intérprete, establecida al nombre de ruta absoluto usado para llamar al intérprete o el guion del intérprete ejecutado como se pasa en el entorno o en la lista de argumentos. Posteriormente, se expande al último argumento de la instrucción simple anterior, ejecutada en primer plano, después de la expansión. También asignada al nombre de ruta completo usado para llamar a cada instrucción ejecutada y ubicada en el entorno exportado para esa instrucción. Al consultar el correo, este parámetro guarda el nombre del archivo de correo.

source: expansion
es: expansión

source: Expansion is performed on the command line after it has been split into @code{token}s. There are seven kinds of expansion performed:
es: La expansión se realiza en la línea de órdenes después de que haya sido dividida en @code{símbolo}s. Hay siete tipos de expansión realizados:

source: brace expansion
es: expansión de llaves

source: tilde expansion
es: expansión de virgulilla

source: parameter and variable expansion
es: expansión de parámetros y variables

source: command substitution
es: sustitución de instrucciones

source: arithmetic expansion
es: expansión aritmética

source: word splitting
es: división de palabras

source: filename expansion
es: expansión de nombre de archivo

source: Brace Expansion
es: Expansión de Llaves

source: Expansion of expressions within braces.
es: Expansión de expresiones dentro de llaves.

source: Tilde Expansion
es: Expansión de Virgulilla

source: Expansion of the ~ character.
es: Expansión del carácter ~.

source: Shell Parameter Expansion
es: Expansión de Parámetros del Intérprete

source: How Bash expands variables to their values.
es: Como Bash expande variables a sus valores.

source: Command Substitution
es: Sustitución de Instrucciones

source: Using the output of a command as an argument.
es: Usando la salida de una instrucción como argumento.

source: Arithmetic Expansion
es: Expansión Aritmética

source: How to use arithmetic in shell expansions.
es: Cómo usar la aritmética en expansiones del intérprete.

source: Process Substitution
es: Sustitución de Procesos

source: A way to write and read to and from a command.
es: Una forma de escribir y leer a y desde una instrucción.

source: Word Splitting
es: División de Palabras

source: How the results of expansion are split into separate arguments.
es: Cómo los resultados de expansión son divididos en argumentos separados.

source: Filename Expansion
es: Expansión de Nombre de Archivo

source: A shorthand for specifying filenames matching patterns.
es: Una abreviatura para especificar nombres de archivos que coinciden con patrones.

source: Quote Removal
es: Eliminación de Comillas

source: How and when quote characters are removed from words.
es: Cómo y cuándo los caracteres de entrecomillado son eliminados de palabras.

source: The order of expansions is: brace expansion; tilde expansion, parameter and variable expansion, arithmetic expansion, and command substitution (done in a left-to-right fashion); word splitting; and filename expansion.
es: El orden de las expansiones es expansión de llaves; expansión de virgulilla, expansión de parámetros y variables, expansión aritmética y sustitución de instrucciones (hechas de izquierda a derecha); división de palabras; y expansión de nombre de archivo.

source: On systems that can support it, there is an additional expansion available: @var{process substitution}. This is performed at the same time as tilde, parameter, variable, and arithmetic expansion and command substitution.
es: En sistemas que lo soportan, hay un expansión adicional disponible: @var{sustitución de proceso}. Esta se realiza al mismo tiempo que la expansión de virgulilla, parámetros y variables y la sustitución de instrucciones.

source: After these expansions are performed, quote characters present in the original word are removed unless they have been quoted themselves (@var{quote removal}).
es: Después de que se hayan realizado estas expansiones, los caracteres de entrecomillado presentes en la palabra original son eliminados a no ser que estos mismos hayan sido entrecomillados (@var{eliminación de comillas}).

source: Only brace expansion, word splitting, and filename expansion can increase the number of words of the expansion; other expansions expand a single word to a single word. The only exceptions to this are the expansions of @code{"$@@"} and @code{$*} (@pxref{Special Parameters}), and @code{"$@{@var{name}[@@]@}"} and @code{$@{@var{name}[*]@}} (@pxref{Arrays}).
es: Solo la expansión de llaves, división de palabras y la expansión de nombre de archivo pueden aumentar el número de palabras de la expansión; otras expansiones expanden una sola palabra a una sola palabra. Las únicas excepciones a esto son las expansiones de @code{"$@@"} y @code{$*} (@pxref{Parámetros Especiales}, y @code{$@{@var{nombre}[*]@}} (@pxref{Vectores}).

source: After all expansions, @code{quote removal} (@pxref{Quote Removal}) is performed.
es: Después de todas las expansiones, se realiza la @code{eliminación de comillas} (@pxref{Eliminación de Comillas}).

source: expansion, brace
es: expansión, llave

source: Brace expansion is a mechanism by which arbitrary strings may be generated. This mechanism is similar to @var{filename expansion} (@pxref{Filename Expansion}), but the filenames generated need not exist. Patterns to be brace expanded take the form of an optional @var{preamble}, followed by either a series of comma-separated strings or a sequence expression between a pair of braces, followed by an optional @var{postscript}. The preamble is prefixed to each string contained within the braces, and the postscript is then appended to each resulting string, expanding left to right.
es: La expansión de llaves es un mecanismo por el cual se pueden generar cadenas arbitrarias. Este mecanismo es similar a la @var{expansión de nombre de archivo} (@pxref{Expansión de Nombre de Archivo}), pero los nombres de archivo generados no necesitan existir. Los patrones que serán expandidos por llaves toman la forma de un @var{preámbulo} opcional, seguido de una serie de cadenas separadas por comas o una expresión secuencial entre un par de llaves, seguida por un @var{epílogo} opcional. El preámbulo es prefijado a cada cadena contenida entre las llaves, y el epílogo es entonces añadido a cada cadena resultante, expandiendo de izquierda a derecha.

source: Brace expansions may be nested. The results of each expanded string are not sorted; left to right order is preserved. For example,
es: Las expansiones de llaves pueden ser anidadas. Los resultados de cada cadena expandida no se ordenan; se preserva el orden de izquierda a derecha. Por ejemplo,

source: A sequence expression takes the form @code{@{@var{x}..@var{y}[..@var{incr}]@}}, where @var{x} and @var{y} are either integers or single characters, and @var{incr}, an optional increment, is an integer. When integers are supplied, the expression expands to each number between @var{x} and @var{y}, inclusive. Supplied integers may be prefixed with @samp{0} to force each term to have the same width. When either @var{x} or @var{y} begins with a zero, the shell attempts to force all generated terms to contain the same number of digits, zero-padding where necessary. When characters are supplied, the expression expands to each character lexicographically between @var{x} and @var{y}, inclusive, using the default C locale. Note that both @var{x} and @var{y} must be of the same type. When the increment is supplied, it is used as the difference between each term. The default increment is 1 or -1 as appropriate.
es: Una expresión secuencial toma la forma @code{@{@var{x}..@var{y}[..@var{incr}]@}}, donde @var{x} e @var{y} son enteros o caracteres únicos, y @var{incr}, un incremento opcional, es un entero. Cuando se proporcionan enteros, la expresión se expande a cada número entre @var{x} y @var{y}, inclusive. Los enteros proporcionados pueden ser prefijados con @samp{0} para forzar que cada término tenga la misma anchura. Cuando @var{x} o @var{y} comienzan en cero, el intérprete trata de obligar a todos los términos generados contener el mismo número de dígitos, rellenando con ceros donde sea necesario. Cuando se proporcionan los caracteres, la expresión se expande a cada carácter lexicográficamente entre @var{x} e @var{y}, inclusive, usando la configuración regional predeterminada C. Observe que tanto @var{x} e @var{y} deben ser del mismo tipo. Cuando se proporciona el incremento, se usa como diferencia entre cada término. El incremento predeterminado es 1 o -1 según corresponda.

source: Brace expansion is performed before any other expansions, and any characters special to other expansions are preserved in the result. It is strictly textual. Bash does not apply any syntactic interpretation to the context of the expansion or the text between the braces.
es: La expansión de llaves se realiza antes que cualquier otra expansión, y se preservan todos los caracteres especiales de otras expansiones en el resultado. Es estrictamente textual. Bash no aplica ninguna interpretación sintáctica al contexto de la expansión o al texto entre las llaves.
