Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Installation Names
es: Nombres de Instalación

source: How to set the various paths used by the installation.
es: Cómo establecer las distintas rutas usadas por la instalación.

source: Specifying the System Type
es: Especificando el Tipo de Sistema

source: How to configure Bash for a particular system.
es: Cómo configurar Bash para un sistema concreto.

source: Sharing Defaults
es: Compartiendo Predeterminados

source: How to share default configuration values among GNU programs.
es: Cómo compartir los valores de configuración predeterminados entre programas GNU.

source: Operation Controls
es: Controles de Operación

source: Options recognized by the configuration program.
es: Opciones reconocidas por el programa de configuración.

source: Optional Features
es: Funcionalidades Opcionales

source: How to enable and disable optional features when building Bash.
es: Cómo habilitar y deshabilitar funcionalidades opcionales al construir Bash.

source: installation
es: instalación

source: configuration
es: configuración

source: Bash installation
es: instalación de Bash

source: Bash configuration
es: configuración de Bash

source: These are installation instructions for Bash.
es: Estas son las instrucciones de instalación para Bash.

source: The simplest way to compile Bash is:
es: La forma más simple de compilar Bash es:

source: @code{cd} to the directory containing the source code and type @samp{./configure} to configure Bash for your system. If you're using @code{csh} on an old version of System V, you might need to type @samp{sh ./configure} instead to prevent @code{csh} from trying to execute @code{configure} itself.
es: Vaya con @code{cd} al directorio que contiene el código fuente y escriba @samp{./configure} para configurar Bash para su sistema. Si está usando @code{csh} en una vieja versión de System V, puede que necesite escribir @samp{sh ./configure} en su lugar para evitar que @code{csh} intente ejecutar el propio @code{configure}.

source: Running @code{configure} takes some time. While running, it prints messages telling which features it is checking for.
es: Ejecutar @code{configure} toma algo de tiempo. Durante su ejecución, imprime mensajes que dicen qué características está comprobando.

source: Type @samp{make} to compile Bash and build the @code{bashbug} bug reporting script.
es: Escriba @samp{make} para compilar Bash y construir el guion de informe de errores @code{bashbug}.

source: Optionally, type @samp{make tests} to run the Bash test suite.
es: Opcionalmente, escriba @samp{make tests} para ejecutar el conjunto de pruebas de Bash.

source: Type @samp{make install} to install @code{bash} and @code{bashbug}. This will also install the manual pages and Info file.
es: Escriba @samp{make install} para instalar @code{bash} y @code{bashbug}. Esto también instalará las páginas de manual y el archivo Info.

source: The @code{configure} shell script attempts to guess correct values for various system-dependent variables used during compilation. It uses those values to create a @file{Makefile} in each directory of the package (the top directory, the @file{builtins}, @file{doc}, and @file{support} directories, each directory under @file{lib}, and several others). It also creates a @file{config.h} file containing system-dependent definitions. Finally, it creates a shell script named @code{config.status} that you can run in the future to recreate the current configuration, a file @file{config.cache} that saves the results of its tests to speed up reconfiguring, and a file @file{config.log} containing compiler output (useful mainly for debugging @code{configure}). If at some point @file{config.cache} contains results you don't want to keep, you may remove or edit it.
es: El guion del intérprete @code{configure} trata de adivinar los valores correctos para varias variables dependientes del sistema durante la compilación. Usa esos valores para crear un @file{Makefile} en cada directorio del paquete (el directorio superior; los directorios @file{builtins}, @file{doc} y @file{support}; cada directorio bajo @file{lib}; y varios otros). También crea un archivo @file{config.h} que contiene definiciones dependientes del sistema. Finalmente crea un guion del intérprete llamado @code{config.status} que puede ejecutar en el futuro para recrear la configuración actual, un archivo @file{config.cache} que guarda los resultados de sus pruebas para acelerar la reconfiguración y un archivo @file{config.log} que contiene salida de compilador (útil principalmente para depurar @code{configure}). Si en algún momento @file{config.cache} contiene resultados que no quiere conservar, puede eliminarlo o editarlo.

source: To find out more about the options and arguments that the @code{configure} script understands, type
es: Para averiguar más sobre las opciones y argumentos que el guion @code{configure} entiende, escriba

source: at the Bash prompt in your Bash source directory.
es: en el prompt de Bash en su directorio de fuentes de Bash.

source: If you want to build Bash in a directory separate from the source directory -- to build for multiple architectures, for example -- just use the full path to the configure script. The following commands will build bash in a directory under @file{/usr/local/build} from the source code in @file{/usr/local/src/bash-4.4}:
es: Si quieres construir Bash en un directorio separado del directorio fuente ---para construir para varias arquitecturas, por ejemplo--- simplemente usa la ruta completa para el guion configure. Las siguientes instrucciones construirán bash en un directorio bajo @file{/usr/local/build} desde el código fuente en @file{/usr/local/src/bash-4.4}:

source: See @ref{Compiling For Multiple Architectures} for more information about building in a directory separate from the source.
es: Consulte @ref{Compilando para Múltiples Arquitecturas} para saber más sobre constuir en un directorio separado del código fuente.

source: If you need to do unusual things to compile Bash, please try to figure out how @code{configure} could check whether or not to do them, and mail diffs or instructions to @email{bash-maintainers@@gnu.org} so they can be considered for the next release.
es: Si necesita hacer cosas inusuales para compilar Bash, intente averiguar cómo @code{configure} podría comprobar si hacerlas o no, y envié diffs o instrucciones a @email{bash-maintainers@@gnu.org} para que puedan ser consideradas para la próxima publicación.

source: The file @file{configure.ac} is used to create @code{configure} by a program called Autoconf. You only need @file{configure.ac} if you want to change it or regenerate @code{configure} using a newer version of Autoconf. If you do this, make sure you are using Autoconf version 2.50 or newer.
es: El archivo @file{configure.ac} se usa para crear @code{configure} por un programa llamado Autoconf. Solo necesita @file{configure.ac} si quiere cambiarlo o regenerar @code{configure} usando una versión más reciente de Autoconf. Si hace esto, asegúrese de que está usando la versión de Autoconf 2.50 o posterior.

source: You can remove the program binaries and object files from the source code directory by typing @samp{make clean}. To also remove the files that @code{configure} created (so you can compile Bash for a different kind of computer), type @samp{make distclean}.
es: Puede eliminar los binarios y archivos objeto del programa del directorio del código fuente escribiendo @samp{make clean}. Para eliminar también los archivos que creó @code{configure} (de forma que pueda compilar Bash para un tipo de ordenador diferente), escriba @samp{make distclean}.

source: Some systems require unusual options for compilation or linking that the @code{configure} script does not know about. You can give @code{configure} initial values for variables by setting them in the environment. Using a Bourne-compatible shell, you can do that on the command line like this:
es: Algunos sistemas requieren opciones poco usuales para la compilación o el enlazado sobre las que el guion @code{configure} no sabe. Puede darle a @code{configure} valores iniciales para variables estableciéndolas en el entorno. Usando un intérprete compatible con Bourne, puede hacer esto en la línea de órdenes así:

source: On systems that have the @code{env} program, you can do it like this:
es: En sistemas que tienen el programa @code{env}, puede hacerlo así:

source: The configuration process uses GCC to build Bash if it is available.
es: El proceso de configuración usa GCC para construir Bash si está disponible.

source: You can compile Bash for more than one kind of computer at the same time, by placing the object files for each architecture in their own directory. To do this, you must use a version of @code{make} that supports the @code{VPATH} variable, such as GNU @code{make}. @code{cd} to the directory where you want the object files and executables to go and run the @code{configure} script from the source directory (@pxref{Basic Installation}). You may need to supply the @option{--srcdir=PATH} argument to tell @code{configure} where the source files are. @code{configure} automatically checks for the source code in the directory that @code{configure} is in and in `..'.
es: Puede compilar Bash para más de un tipo de ordenador al mismo tiempo, ubicando los archivos objeto para cada arquitectura en su propio directorio Para hacer esto, debe usar una versión de @code{make} que soporte la variable @code{VPATH}, como GNU @code{make}. Vaya con @code{cd} al directorio donde quiere que vayan los archivos objeto y ejecutables y ejecute el guion @code{configure} desde el directorio fuente (@pxref{Instalación Básica}). Puede que necesite proporcionar el argumento @option{--srcdir=PATH} para decirle a @code{configure} dónde están los archivos fuente. @code{configure} comprueba automáticamente el código fuente en el directorio en que está @code{cofigure} y en `..'.

source: If you have to use a @code{make} that does not supports the @code{VPATH} variable, you can compile Bash for one architecture at a time in the source code directory. After you have installed Bash for one architecture, use @samp{make distclean} before reconfiguring for another architecture.
es: Si tiene que usar un @code{make} que no soporta la variable @code{VPATH}, puede compilar Bash para una arquitectura a la vez en el directorio del código fuente. Después de que haya instalado Bash para una arquitectura, use @samp{make distclean} antes de reconfigurar para otra arquitectura.

source: Alternatively, if your system supports symbolic links, you can use the @file{support/mkclone} script to create a build tree which has symbolic links back to each file in the source directory. Here's an example that creates a build directory in the current directory from a source directory @file{/usr/gnu/src/bash-2.0}:
es: Alternativamente, si su sistema soporta enlaces simbólicos, puede usar el guion @file{support/mkclone} para crear un árbol de construcción que tiene enlaces simbólicos atrás a cada archivo en el directorio de fuentes. He aquí un ejemplo que crea un directorio de construcción en el directorio actual desde un directorio fuente @file{/usr/gnu/src/bash-2.0}:

source: The @code{mkclone} script requires Bash, so you must have already built Bash for at least one architecture before you can create build directories for other architectures.
es: El guion @code{mkclone} requiere Bash, así que tiene que tener ya Bash construido para al menos una arquitectura antes de que pueda crear directorios de construcción para otras arquitecturas.

source: By default, @samp{make install} will install into @file{/usr/local/bin}, @file{/usr/local/man}, etc. You can specify an installation prefix other than @file{/usr/local} by giving @code{configure} the option @option{--prefix=@var{PATH}}, or by specifying a value for the @code{DESTDIR} @samp{make} variable when running @samp{make install}.
es: Por defecto, @samp{make install} instalará en @file{/usr/local/bin}, @file{/usr/local/man}, etc. Puede especificar un prefijo de instalación distinto de @file{/usr/local} pasando a @code{configure} la opción @option{--prefix=@var{RUTA}}, o especificando un valor para la variable de @samp{make} @code{DESTDIR} al ejecutar @samp{make install}.

source: You can specify separate installation prefixes for architecture-specific files and architecture-independent files. If you give @code{configure} the option @option{--exec-prefix=@var{PATH}}, @samp{make install} will use @var{PATH} as the prefix for installing programs and libraries. Documentation and other data files will still use the regular prefix.
es: Puede especificar prefijos de instalación separados para archivos específicos de arquitectura y archivos independientes de la arquitectura. Si le pasa a @code{configure} la opción @option{--exec-prefix=@var{RUTA}}, @samp{make install} usará @var{PATH} como el prefijo para instalar programas y librerías. La documentación y otros archivos de datos todavía usarán el prefijo normal.

source: There may be some features @code{configure} can not figure out automatically, but need to determine by the type of host Bash will run on. Usually @code{configure} can figure that out, but if it prints a message saying it can not guess the host type, give it the @option{--host=TYPE} option. @samp{TYPE} can either be a short name for the system type, such as @samp{sun4}, or a canonical name with three fields: @samp{CPU-COMPANY-SYSTEM} (e.g., @samp{i386-unknown-freebsd4.2}).
es: Puede haber algunas funcionalidades que @code{configure} no puede averiguar automáticamente, pero necesita determinar por el tipo de anfitrión en que se ejecutará Bash. Normalmente @code{configure} puede averiguarlo, pero si imprime un mensaje diciendo que no puede averiguar el tipo de anfitrión, pásele la opción @option{--host=TIPO}. @samp{TIPO} puede ser un nombre corto para el tipo de sistema, como @samp{sun4}, o un nombre canónico con tres campos: @samp{CPU-EMPRESA-SISTEMA} (p. ej., @samp{i386-unknown-freebsd4.2}).

source: See the file @file{support/config.sub} for the possible values of each field.
es: Vea el archivo @file{support/config.sub} para los posibles valores de cada campo.

source: If you want to set default values for @code{configure} scripts to share, you can create a site shell script called @code{config.site} that gives default values for variables like @code{CC}, @code{cache_file}, and @code{prefix}. @code{configure} looks for @file{PREFIX/share/config.site} if it exists, then @file{PREFIX/etc/config.site} if it exists. Or, you can set the @code{CONFIG_SITE} environment variable to the location of the site script. A warning: the Bash @code{configure} looks for a site script, but not all @code{configure} scripts do.
es: Si quiere asignar valores predeterminados para que los compartan guiones @code{configure}, puede crear un guion del intérprete del sitio llamado @code{config.site} que le da valores predeterminados a variables como @code{CC}, @code{cache_file} y @code{prefix}. @code{configure} mira en @file{PREFIX/share/config.site} si existe, después en @file{PREFIX/etc/config.site} si existe. O puede establecer la variable de entorno @code{CONFIG_SITE} a la ubicación del guion del sitio. Una advertencia: el @code{configure} de Bash busca un guion de sitio, pero no todos los guiones @code{configure} lo hacen.

source: @code{configure} recognizes the following options to control how it operates.
es: @code{configure} reconoce las siguientes opciones para controlar cómo opera.

source: --cache-file=@var{file}
es: --cache-file=@var{archivo}

source: Use and save the results of the tests in @var{file} instead of @file{./config.cache}. Set @var{file} to @file{/dev/null} to disable caching, for debugging @code{configure}.
es: Usa y guarda los resultados de las pruebas en @var{archivo} en vez de @file{./config.cache}. Asigna @file{/dev/null} a @var{archivo} para deshabilitar el caché, para depurar @code{configure}.

source: Print a summary of the options to @code{configure}, and exit.
es: Imprime un resumen de las opciones para @code{configure}, y finaliza.

source: Do not print messages saying which checks are being made.
es: No imprime mensajes diciendo qué comprobaciones se están realizando.

source: Look for the Bash source code in directory @var{dir}. Usually @code{configure} can determine that directory automatically.
es: Busca el código fuente de Bash en el directorio @var{dir}. Normalmente @code{configure} puede averiguar ese directorio automáticamente.

source: Print the version of Autoconf used to generate the @code{configure} script, and exit.
es: Imprime la versión de Autoconf usada para generar el guion @code{configure}, y finaliza.

source: @code{configure} also accepts some other, not widely used, boilerplate options. @samp{configure --help} prints the complete list.
es: @code{configure} también acepta alguna otra opción de plantilla, no usadas ampliamente. @code{configure --help} imprime la lista completa.

source: The Bash @code{configure} has a number of @option{--enable-@var{feature}} options, where @var{feature} indicates an optional part of Bash. There are also several @option{--with-@var{package}} options, where @var{package} is something like @samp{bash-malloc} or @samp{purify}. To turn off the default use of a package, use @option{--without-@var{package}}. To configure Bash without a feature that is enabled by default, use @option{--disable-@var{feature}}.
es: El @code{configure} de Bash tiene varias opciones @option{--enable-@var{funcionalidad}}, donde @var{funcionalidad} indica una parte opcional de Bash. También hay varias opciones @option{--with-@var{paquete}}, donde @var{paquete} es algo como @samp{bash-malloc} o @samp{purify}. Para desactivar el uso predeterminado de un paquete, use @option{--without-@var{paquete}}. Para configurar Bash sin una funcionalidad que esté activada por defecto, use @option{--disable-@var{funcionalidad}}.

source: Here is a complete list of the @option{--enable-} and @option{--with-} options that the Bash @code{configure} recognizes.
es: He aquí una lista completa de las opciones @option{--enable-} y @option{--with-} que el @code{configure} de Bash reconoce.

source: Define if you are using the Andrew File System from Transarc.
es: Define si usar el Andrew File System de Transarc.

source: Use the Bash version of @code{malloc} in the directory @file{lib/malloc}. This is not the same @code{malloc} that appears in @sc{gnu} libc, but an older version originally derived from the 4.2 @sc{bsd} @code{malloc}. This @code{malloc} is very fast, but wastes some space on each allocation. This option is enabled by default. The @file{NOTES} file contains a list of systems for which this should be turned off, and @code{configure} disables this option automatically for a number of systems.
es: Usa la versión de Bash de @code{malloc} en el directorio @file{lib/malloc}. Esto no es el mismo @code{malloc} que aparece en @sc{gnu} libc, sino una versión más vieja derivada originalmente del @code{malloc} de @sc{bsd} 4.2. Este @code{malloc} es muy rápido, pero desperdicia algo de espacio en cada asignación. Esta opción está activada por defecto. El archivo @file{NOTES} contiene una lista de sistemas para los cuales esto debería ser desactivado, y @code{configure} deshabilita esta opción automáticamente para varios sistemas.

source: Use the curses library instead of the termcap library. This should be supplied if your system has an inadequate or incomplete termcap database.
es: Usa la biblioteca curses en vez de la biblioteca termcap. Esto debe ser proporcionado si su sistema tiene una base de datos inadecuada o incompleta de termcap.

source: A synonym for @code{--with-bash-malloc}.
es: Un sinónimo para @code{--with-bash-malloc}.

source: --with-installed-readline[=@var{PREFIX}]
es: --with-installed-readline[=@var{PREFIJO}]

source: Define this to make Bash link with a locally-installed version of Readline rather than the version in @file{lib/readline}. This works only with Readline 5.0 and later versions. If @var{PREFIX} is @code{yes} or not supplied, @code{configure} uses the values of the make variables @code{includedir} and @code{libdir}, which are subdirectories of @code{prefix} by default, to find the installed version of Readline if it is not in the standard system include and library directories. If @var{PREFIX} is @code{no}, Bash links with the version in @file{lib/readline}. If @var{PREFIX} is set to any other value, @code{configure} treats it as a directory pathname and looks for the installed version of Readline in subdirectories of that directory (include files in @var{PREFIX}/@code{include} and the library in @var{PREFIX}/@code{lib}).
es: Define esto para enlazar Bash con una versión instalada localmente de Readline en vez de la versión en @file{lib/readline}. Esto solo funciona con las versiones de Readline 5.0 y posteriores. Si @var{PREFIJO} es @code{yes} o no proporcionado, @code{configure} usa los valores de las variables make @code{includedir} y @code{libdir}, que son subdirectorios de @code{prefijo} por defecto, para encontrar la versión instalada de Readline si no está en los directorios estándares del sistema de inclusión y bibliotecas. Si @var{PREFIJO} es @code{no}, Bash se enlaza con la versión en @file{lib/readline}. Si @var{PREFIJO} está establecido a cualquier otro valor, @code{configure} lo trata como un nombre de ruta de directorio y busca la versión instalada de Readline en subdirectorios de ese directorio (archivos de inclusión en @var{PREFIJO}/@code{include} y la biblioteca en @var{PREFIJO}/@code{lib}).

source: Define this to use the Purify memory allocation checker from Rational Software.
es: Define esto para usar el comprobador de ubicación de memoria Purify de Rational Software.

source: This produces a shell with minimal features, close to the historical Bourne shell.
es: Esto produce un intérprete con funcionalidades mínimas, cercano al Bourne shell histórico.

source: There are several @option{--enable-} options that alter how Bash is compiled and linked, rather than changing run-time features.
es: Hay varias opciones @option{--enable-} que alteran cómo se compila y se enlaza Bash, en vez de cambiar funcionalidades de tiempo de ejecución.

source: Enable support for @uref{http://www.unix.org/version2/whatsnew/lfs20mar.html, large files} if the operating system requires special compiler options to build programs which can access large files. This is enabled by default, if the operating system provides large file support.
es: Habilita soporte para @uref{http://www.unix.org/version2/whatsnew/lfs20mar.html, archivos grandes} si el sistema operativo requiere opciones especiales de compilador para construir programas que puede acceder a archivos grandes. Esto está habilitado por defecto, si el sistema operativo ofrece soporte para archivos grandes.

source: This builds a Bash binary that produces profiling information to be processed by @code{gprof} each time it is executed.
es: Esto construye un binario de Bash que produce información de análisis de rendimiento para ser procesada por @code{gprof} cada vez que se ejecuta.

source: This causes Bash to be linked statically, if @code{gcc} is being used. This could be used to build a version to use as root's shell.
es: Esto hace que Bash sea enlazado estáticamente, si se usa @code{gcc}. Esto podría ser usado para construir una versión para usar como intérprete de root.
