Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: For example, if @file{/usr/sys} is a symbolic link to @file{/usr/local/sys} then:
es: Por ejemplo, si @file{/usr/sys} es un enlace simbólico a @file{/usr/local/sys}, entonces:

source: If @code{set -P} is on, then:
es: Si @code{set -P} está activada, entonces:

source: If set, any trap on @code{DEBUG} and @code{RETURN} are inherited by shell functions, command substitutions, and commands executed in a subshell environment. The @code{DEBUG} and @code{RETURN} traps are normally not inherited in such cases.
es: Si está establecida, cualquier trap en @code{DEBUG} y @code{RETURN} son heredadas por funciones del intérprete, sustituciones de instrucciones e instrucciones ejecutadas en un entorno de subintérprete. Las trampas @code{DEBUG} y @code{RETURN} no son heredadas normalmente en tales casos.

source: If no arguments follow this option, then the positional parameters are unset. Otherwise, the positional parameters are set to the @var{arguments}, even if some of them begin with a @samp{-}.
es: Si ningún argumento sigue a esta opción, los parámetros posicionales son eliminados. En caso contrario, los parámetros posicionales son establecidos a @var{argumentos}, incluso si algunos de ellos comienzan por @samp{-}.

source: Signal the end of options, cause all remaining @var{arguments} to be assigned to the positional parameters. The @option{-x} and @option{-v} options are turned off. If there are no arguments, the positional parameters remain unchanged.
es: Señala el fin de las opciones, hace que todos los @var{argumentos} restantes sean asignados a los parámetros posicionales. Las opciones @option{-x} y @option{-v} son desactivadas. Si no hay argumentos, los parámetros posicionales no cambian.

source: Using @samp{+} rather than @samp{-} causes these options to be turned off. The options can also be used upon invocation of the shell. The current set of options may be found in @code{$-}.
es: Usar @samp{+} en vez de @samp{-} hace que estás opciones se desactiven. Las opciones también pueden ser usadas al invocar al intérprete. El conjunto actual de opciones se puede encontrar en @code{$-}.

source: The remaining N @var{arguments} are positional parameters and are assigned, in order, to @code{$1}, @code{$2}, @dots{} @code{$N}. The special parameter @code{#} is set to N.
es: Los N @var{argumentos} porsicionales restantes son parámetros posicionales y son asignados, en orden, a @code{$1}, @code{$2}, @dots{} @code{$N}. El parámetro especial @code{#} es establecido a N.

source: The return status is always zero unless an invalid option is supplied.
es: El estado de retorno siempre es cero a no ser que se proporcione una opción inválida.

source: This builtin allows you to change additional shell optional behavior.
es: Esta instrucción integrada te permite cambiar el comportamiento adicional del intérprete.

source: shopt [-pqsu] [-o] [@var{optname} @dots{}]
es: shopt [-pqsu] [-o] [@var{nombre-de-opción} @dots{}]

source: Toggle the values of settings controlling optional shell behavior. The settings can be either those listed below, or, if the @option{-o} option is used, those available with the @option{-o} option to the @code{set} builtin command (@pxref{The Set Builtin}). With no options, or with the @option{-p} option, a list of all settable options is displayed, with an indication of whether or not each is set; if @var{optnames} are supplied, the output is restricted to those options. The @option{-p} option causes output to be displayed in a form that may be reused as input. Other options have the following meanings:
es: Alterna los valores de los ajustes que controlan el comportamiento opcional del intérprete. Los ajustes pueden ser los listados a continuación o, si se usa la opción @option{-o}, aquellos disponibles con la opción @option{-o} para la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}). Sin opciones, o con la opción @option{-p}, se muestra una lista de todas las opciones que pueden ser habilitadas, con una indicación de si está habilitada o no; si se proporcionan @var{nombres-de-opciones}, se limita la salida a esas opciones. La opción @option{-p} hace que la salida se muestre de forma que pueda ser reutilizada como entrada. Las otras opciones tienen los siguientes significados:

source: Enable (set) each @var{optname}.
es: Activa (habilita) cada @var{nombre-de-opción}.

source: Disable (unset) each @var{optname}.
es: Desactiva (deshabilita) cada @var{nombre-de-opción}.

source: Suppresses normal output; the return status indicates whether the @var{optname} is set or unset. If multiple @var{optname} arguments are given with @option{-q}, the return status is zero if all @var{optnames} are enabled; non-zero otherwise.
es: Suprime la salida normal; el estado de retorno indica si el @var{nombre-de-opción} está habilitado o deshabilitado. Si se pasan varios argumentos @var{nombre-de-opción} con @option{-q}, el estado de retorno es cero si todos los @var{nombres-de-opción} están habilitados; distinto de cero en caso contrario.

source: Restricts the values of @var{optname} to be those defined for the @option{-o} option to the @code{set} builtin (@pxref{The Set Builtin}).
es: Limita los valores de @var{nombre-de-opción} a aquellos definidos por la opción @option{-o} para la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}).

source: If either @option{-s} or @option{-u} is used with no @var{optname} arguments, @code{shopt} shows only those options which are set or unset, respectively.
es: Si @option{-s} o @option{-u} se usan sin argumentos @var{nombre-de-opción}, @code{shopt} muestra solo aquellas opciones que están habilitadas o deshabilitadas, respectivamente.

source: Unless otherwise noted, the @code{shopt} options are disabled (off) by default.
es: A no ser que se indique lo contrario, las opciones @code{shopt} están deshabilitadas (off) por defecto.

source: The return status when listing options is zero if all @var{optnames} are enabled, non-zero otherwise. When setting or unsetting options, the return status is zero unless an @var{optname} is not a valid shell option.
es: El estado de retorno al listar opciones es cero si todos los @var{nombres-de-opciones} están habilitados, diferente a cero en caso contrario. Al habilitar o deshabilitar opciones, el estado de retorno es cero a no ser que @var{nombre-de-opción} no sea una opción del intérprete válida.

source: The list of @code{shopt} options is:
es: La lista de opciones @code{shopt} es:

source: If set, the shell suppresses multiple evaluation of associative array subscripts during arithmetic expression evaluation, while executing builtins that can perform variable assignments, and while executing builtins that perform array dereferencing.
es: Si está habilitada, el intérprete suprime la evaluación múltiple de super@'indices de vectores durante la evaluación de una expresión aritmética, mientras ejecuta instrucciones integradas que pueden realizar asignaciones de variables y mientras ejecuta instrucciones integradas que realizan la desreferenciación de vectores.

source: If set, a command name that is the name of a directory is executed as if it were the argument to the @code{cd} command. This option is only used by interactive shells.
es: Si está habilitada, un nombre de instrucción que es el nombre de un directorio es ejecutado como si fuera el argumento de la instrucción @code{cd}. Esta opción solo es usada por intérpretes interactivos.

source: If this is set, an argument to the @code{cd} builtin command that is not a directory is assumed to be the name of a variable whose value is the directory to change to.
es: Si esto está habilitado, se asume que un argumento para la instrucción integrada @code{cd} que no es un directorio es el nombre de una variable cuyo valor es el directorio al que cambiar.

source: If set, minor errors in the spelling of a directory component in a @code{cd} command will be corrected. The errors checked for are transposed characters, a missing character, and a character too many. If a correction is found, the corrected path is printed, and the command proceeds. This option is only used by interactive shells.
es: Si está habilitada, serán corregidos los errores de escritura menores de un componente de directorio en una instrucción @code{cd}. Los errores comprobados son caracteres transpuestos, y un carácter de más. Si se encuentra una corrección, se imprime la ruta corregida, y la instrucción procede. Esta opción solo es usada por intérpretes interactivos.

source: If this is set, Bash checks that a command found in the hash table exists before trying to execute it. If a hashed command no longer exists, a normal path search is performed.
es: Si esto está habilitado, Bash comprueba que una instrucción encontrada en la tabla hash existe antes de intentar ejecutarla. Si una instrucción con un hash ya no existe, se realiza una búsqueda de ruta normal.

source: If set, Bash lists the status of any stopped and running jobs before exiting an interactive shell. If any jobs are running, this causes the exit to be deferred until a second exit is attempted without an intervening command (@pxref{Job Control}). The shell always postpones exiting if any jobs are stopped.
es: Si está habilitada, Bash lista el estado de cualquier tarea detenida o en ejecución antes de que salga de un intérprete interactivo. Si alguna tarea está en ejecución, esto hace que la salida sea pospuesta hasta que se intente una segunda salida sin una instrucción interviniente (@pxref{Control de Tareas}). El intérprete siempre pospone la salida si se detiene cualquier tarea.

source: If set, Bash checks the window size after each external (non-builtin) command and, if necessary, updates the values of @env{LINES} and @env{COLUMNS}. This option is enabled by default.
es: Si está habilitada, Bash comprueba la tamaño de la ventana después de cada instrucción externa (no integrada) y, si es necesario, actualiza los valores de @env{LINES} y @env{COLUMNS}. Esta opción está habilitada por defecto.

source: If set, Bash attempts to save all lines of a multiple-line command in the same history entry. This allows easy re-editing of multi-line commands. This option is enabled by default, but only has an effect if command history is enabled (@pxref{Bash History Facilities}).
es: Si está habilitada, Bash intenta guardar todas las líneas de una instrucción de varias líneas en la misma entrada del historial. Esto permite una reedición sencilla de instrucciones de varias líneas. Esta opción está habilitada por defecto, pero solo tiene efecto si el historial de instrucciones está habilitado (@pxref{Servicios del Historial de Bash}).

source: If set, Bash changes its behavior to that of version 3.1 with respect to quoted arguments to the conditional command's @samp{=~} operator and with respect to locale-specific string comparison when using the @code{[[} conditional command's @samp{<} and @samp{>} operators. Bash versions prior to bash-4.1 use ASCII collation and strcmp(3); bash-4.1 and later use the current locale's collation sequence and strcoll(3).
es: Si está habilitada, Bash cambia su comportamiento al de la versión 3.1 con respecto a los argumentos entrecomillados para el operador de la instrucción condicional @samp{=~} y respecto a la comparación de cadenas de configuración regional específica cuando se usan los operadores @samp{<} y @samp{>} de la instrucción condicional @code{[[}. Las versiones de Bash anteriores a bash-4.1 usan la secuencia de ordenación de la actual configuración regional y strcoll(3).

source: If set, Bash changes its behavior to that of version 3.2 with respect to locale-specific string comparison when using the @code{[[} conditional command's @samp{<} and @samp{>} operators (see previous item) and the effect of interrupting a command list. Bash versions 3.2 and earlier continue with the next command in the list after one terminates due to an interrupt.
es: Si está habilitada, Bash cambia su comportamiento al de la versión 3.2 con respecto a la comparación de cadenas de regionalización específica cuando se usan los operadores @samp{<} y @samp{>} de la instrucción condicional @code{[[} (consulta elemento anterior) y el efecto de interrumpir una lista de instrucciones. Las versiones de Bash 3.2 y anteriores continúan con la siguiente instrucción en la lista después de que una termine debido a una interrupción.

source: If set, Bash changes its behavior to that of version 4.0 with respect to locale-specific string comparison when using the @code{[[} conditional command's @samp{<} and @samp{>} operators (see description of @code{compat31}) and the effect of interrupting a command list. Bash versions 4.0 and later interrupt the list as if the shell received the interrupt; previous versions continue with the next command in the list.
es: Si está habilitada, Bash cambia su comportamiento al de la versión 4.0 con respecto a la comparación de cadenas de regionalización específica cuando se usan los operadores @samp{<} y @samp{>} de la instrucción condicional @code{[[} (ve la descripción de @code{compat31}) y el efecto de interrumpir una lista de instrucciones. Las versiones de Bash 4.0 y posteriores interrumpen la lista como si el intérprete recibiera la interrupción; las versiones previas continúan con la siguiente instrucción en la lista.

source: If set, Bash, when in @sc{posix} mode, treats a single quote in a double-quoted parameter expansion as a special character. The single quotes must match (an even number) and the characters between the single quotes are considered quoted. This is the behavior of @sc{posix} mode through version 4.1. The default Bash behavior remains as in previous versions.
es: Si está habilitada, Bash, en el modo @sc{posix}, trata una comilla simple en una expansión de parámetros de comillas dobles como un carácter especial. Las comillas simples deben coincidir (un número par) y los caracteres entre las comillas simples se consideran entrecomillados. Este es el comportamiento del modo @sc{posix} a través de la versión 4.1. El comportamiento por defecto de Bash permanece como en versiones anteriores.

source: If set, Bash does not process the replacement string in the pattern substitution word expansion using quote removal.
es: Si está habilitada, no procesa la cadena de reemplazo en la expansión de palabra de sustitución de patrón usando la eliminación de comillas.

source: If set, Bash does not print a warning message if an attempt is made to use a quoted compound array assignment as an argument to @code{declare}, makes word expansion errors non-fatal errors that cause the current command to fail (the default behavior is to make them fatal errors that cause the shell to exit), and does not reset the loop state when a shell function is executed (this allows @code{break} or @code{continue} in a shell function to affect loops in the caller's context).
es: Si está habilitada, Bash no imprime un mensaje de advertencia si se realiza un intento de usar una asignación de vector compuesto entrecomillada como un argumento para @code{declare}, convierte los errores de expansión de palabra en errores no fatales que hacen fallar a la actual instrucción (el comportamiento por defecto es convertirlos en errores fatales que hacen que el intérprete se cierre), y no restablece el estado del bucle cuando se ejecuta una función del intérprete (esto permite que @code{break} o @code{continue} en una función del intérprete afecten a los bucles en el contexto del llamador).

source: If set, Bash saves the positional parameters to BASH_ARGV and BASH_ARGC before they are used, regardless of whether or not extended debugging mode is enabled.
es: Si está habilitada, Bash guarda los parámetros posicionales de BASH_ARGV y BASH_ARGC antes de que sean usados, sin importar si está habilitado o no el modo de depuración extendido.

source: If set, Bash quotes all shell metacharacters in filenames and directory names when performing completion. If not set, Bash removes metacharacters such as the dollar sign from the set of characters that will be quoted in completed filenames when these metacharacters appear in shell variable references in words to be completed. This means that dollar signs in variable names that expand to directories will not be quoted; however, any dollar signs appearing in filenames will not be quoted, either. This is active only when bash is using backslashes to quote completed filenames. This variable is set by default, which is the default Bash behavior in versions through 4.2.
es: Si está habilitada, Bash entrecomilla todos los metacaracteres del intérprete en nombres de archivo y nombre de directorio al realizar la compleción. Si no está habilitada, Bash elimina metacaracteres como el símbolo de dólar del conjunto de caracteres que será entrecomillado en los nombres de archivo completados cuando estos metacaracteres aparezcan en referencias de variables del intérprete en palabras que deben ser completadas. Esto significa que los símbolos de dólar en nombres de variable que expanden a directorios no serán entrecomillados; sin embargo, cualquier signo de dólar que aparezca en nombres de archivo no será entrecomillado, tampoco. Esto está activado solo cuando bash está usando barras invertidas para entrecomillar nombres de archivo completados. Esta variable está habilitada por defecto, que es el comportamiento habitual de Bash en versiones a partir de la 4.2.

source: If set, Bash replaces directory names with the results of word expansion when performing filename completion. This changes the contents of the readline editing buffer. If not set, Bash attempts to preserve what the user typed.
es: Si está establecida, Bash reemplaza los nombres de directorio con los resultados de la expansión de palabra al realizar la compleción de nombre de archivo. Esto cambia los contenidos del búfer de edición de readline. Si no está establecida, Bash trata de preservar lo que el usuario tecleó.

source: If set, Bash attempts spelling correction on directory names during word completion if the directory name initially supplied does not exist.
es: Si está establecida, Bash intenta la corrección de escritura en nombres de directorios durante la compleción de palabras si el nombre del directorio proporcionado inicialmente no existe.

source: If set, Bash includes filenames beginning with a `.' in the results of filename expansion. The filenames @samp{.} and @samp{..} must always be matched explicitly, even if @code{dotglob} is set.
es: Si está establecida, Bash incluye los nombres que empiezan por un `.' en los resultados de la expansión de nombre de archivo. Los nombres de archivo @samp{.} y @samp{..} siempre tienen que ser coincididos expl@'icitamente, incluso si está habilitada @code{dotglob}.

source: If this is set, a non-interactive shell will not exit if it cannot execute the file specified as an argument to the @code{exec} builtin command. An interactive shell does not exit if @code{exec} fails.
es: Si esto está establecido, un intérprete no interactivo no se cerrará si no puede ejecutar el archivo especificado como un argumento para la instrucción integrada @code{exec}. No se cierra un intérprete interactivo si @code{exec} falla.

source: If set, aliases are expanded as described below under Aliases, @ref{Aliases}. This option is enabled by default for interactive shells.
es: Si está establecida, los aliases son expandidos como se describe abajo en Aliases, @ref{Aliases}. Esta opción está habilitada por defecto para intérpretes interactivos.

source: If set at shell invocation, arrange to execute the debugger profile before the shell starts, identical to the @option{--debugger} option. If set after invocation, behavior intended for use by debuggers is enabled:
es: Si se habilita durante la invocación del intérprete, dispone ejecutar el perfil del depurador antes de que se inicie el intérprete, idéntica a la opción @option{--debugger}. Si se habilita tras la invocación, se habilita el comportamiento pensando para el uso de depuradores:

source: The @option{-F} option to the @code{declare} builtin (@pxref{Bash Builtins}) displays the source file name and line number corresponding to each function name supplied as an argument.
es: La opción @option{-F} para la instrucción integrada @code{declare}(@pxref{Instrucciones Integradas de Bash}) muestra el nombre de archivo fuente y el número de línea correspondiente a cada nombre de función proporcionado como argumento.

source: If the command run by the @code{DEBUG} trap returns a non-zero value, the next command is skipped and not executed.
es: Si la instrucción ejecutada por la trap @code{DEBUG} devuelve un valor distinto a cero, se salta el siguiente comando y no se ejecuta.

source: If the command run by the @code{DEBUG} trap returns a value of 2, and the shell is executing in a subroutine (a shell function or a shell script executed by the @code{.} or @code{source} builtins), the shell simulates a call to @code{return}.
es: Si la instrucción ejecutada por la trap @code{DEBUG} devuelve un valor de 2, y el intérprete se está ejecutando en una subrutina (una función del intérprete o un guion del intérprete ejecutado por las instrucciones integradas @code{.} o @code{source}), el intérprete simula una llamada a @code{return}.

source: @code{BASH_ARGC} and @code{BASH_ARGV} are updated as described in their descriptions (@pxref{Bash Variables}).
es: @code{BASH_ARGC} y @code{BASH_ARGV} son actualizados según lo descrito en sus descripciones (@pxref{Variables de Bash}).

source: Function tracing is enabled: command substitution, shell functions, and subshells invoked with @code{( @var{command} )} inherit the @code{DEBUG} and @code{RETURN} traps.
es: Se habilita el rastreo de funciones: la sustitución de instrucciones, las funciones del intérprete y los subintérpretes invocados con @code{( @var{instrucción} )} heredan las trap @code{DEBUG} y @code{RETURN}.

source: Error tracing is enabled: command substitution, shell functions, and subshells invoked with @code{( @var{command} )} inherit the @code{ERR} trap.
es: El rastreo de errores es habilitado: la sustitución de instrucciones, las funciones del intérprete y los subintérpretes invocados con @code{( @var{instrucción} )} heredan la trap @code{ERR}.

source: If set, the extended pattern matching features described above (@pxref{Pattern Matching}) are enabled.
es: Si está habilitada, son habilitadas las funcionalidades extendidas de coincidencia de patrones descritas más arriba (@pxref{Coincidencia de Patrones}).

source: If set, @code{$'@var{string}'} and @code{$"@var{string}"} quoting is performed within @code{$@{@var{parameter}@}} expansions enclosed in double quotes. This option is enabled by default.
es: Si está habilitada, el entrecomillado @code{$'@var{cadena}'} and @code{$"@var{cadena}"} es realizado dentro de expresiones @code{$@{@var{parámetro}@}} encerradas en comillas dobles. Esta opción está habilitada por defecto.

source: If set, patterns which fail to match filenames during filename expansion result in an expansion error.
es: Si está habilitada, los patrones que no consigan coincidir con nombres de archivo durante la expansión de nombre de archivo producen un error de expansión.
