Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Any element of an array may be referenced using @code{$@{@var{name}[@var{subscript}]@}}. The braces are required to avoid conflicts with the shell's filename expansion operators. If the @var{subscript} is @samp{@@} or @samp{*}, the word expands to all members of the array @var{name}. These subscripts differ only when the word appears within double quotes. If the word is double-quoted, @code{$@{@var{name}[*]@}} expands to a single word with the value of each array member separated by the first character of the @env{IFS} variable, and @code{$@{@var{name}[@@]@}} expands each element of @var{name} to a separate word. When there are no array members, @code{$@{@var{name}[@@]@}} expands to nothing. If the double-quoted expansion occurs within a word, the expansion of the first parameter is joined with the beginning part of the original word, and the expansion of the last parameter is joined with the last part of the original word. This is analogous to the expansion of the special parameters @samp{@@} and @samp{*}. @code{$@{#@var{name}[@var{subscript}]@}} expands to the length of @code{$@{@var{name}[@var{subscript}]@}}. If @var{subscript} is @samp{@@} or @samp{*}, the expansion is the number of elements in the array. If the @var{subscript} used to reference an element of an indexed array evaluates to a number less than zero, it is interpreted as relative to one greater than the maximum index of the array, so negative indices count back from the end of the array, and an index of -1 refers to the last element.
es: Se puede referenciar cualquier elemento de un vector usando @code{$@{@var{nombre}[@var{subíndice}]@}}. Las llaves se requieren para evitar conflictos con los operadores de expansión de nombre de archivo del intérprete. Si @var{subíndice} es @samp{@@} o @samp{*}, la palabra se expande a todos los miembros del vector @var{nombre}. Estos subíndices difieren solo cuando la palabra aparece dentro de comillas dobles. Si la palabra está entre comillas dobles, @code{$@{@var{nombre}[*]@}} se expande a una única palabra con el valor de cada miembro del vector separado por el primer carácter de la variable @env{IFS}, y @code{$@{@var{nombre}[@@]@}} expande cada elemento de @var{nombre} a una palabra separada. Cuando no hay miembros del vector, @code{$@{@var{nombre}[@@]@}} se expande a nada. Si la expansión entre comillas dobles ocurre dentro de una palabra, la expansión del primer parámetro se une con la parte inicial de la palabra original, y la expansión del último parámetro se une con la última parte de la palabra original. Esto es análogo a la expansión de los parámetros especiales @samp{@@} y @samp{*}. @code{$@{#@var{nombre}[@var{subíndice}]@}} se expande a la longitud de @code{$@{@var{nombre}[@var{subíndice}]@}}. Si @var{subíndice} es @samp{@@} o @samp{*}, la expansión es el número de elementos del vector. Si el @var{subíndice} usado para referenciar un elemento de un vector indexado evalúa a un número menor que cero, se interpreta como relativo a uno mayor que el índice máximo del vector, de forma que los índices negativos cuentan hacia tras desde el final del vector y un índice de -1 hace referencia al último elemento.

source: Referencing an array variable without a subscript is equivalent to referencing with a subscript of 0. Any reference to a variable using a valid subscript is legal, and @code{bash} will create an array if necessary.
es: Referenciar una variable de vector sin un subíndice es equivalente a referenciar con un subíndice de 0. Cualquier referencia a una variable usando un subíndice válido es legal, y @code{bash} creará un vector si es necesario.

source: An array variable is considered set if a subscript has been assigned a value. The null string is a valid value.
es: Una variable de vector se considera establecida si se ha asignado un valor a un subíndice. La cadena nula es un valor válido.

source: It is possible to obtain the keys (indices) of an array as well as the values. $@{!@var{name}[@@]@} and $@{!@var{name}[*]@} expand to the indices assigned in array variable @var{name}. The treatment when in double quotes is similar to the expansion of the special parameters @samp{@@} and @samp{*} within double quotes.
es: Es posible obtener las claves (índices) de un vector así como los valores. $@{!@var{nombre}[@@]@} y $@{!@var{nombre}[*]@} se expanden a los índices asignados en una variable de vector @var{nombre}. El tratamiento en comillas dobles es similar a la expansión de los parámetros especiales @samp{@@} y @samp{*} dentro de comillas dobles.

source: The @code{unset} builtin is used to destroy arrays. @code{unset @var{name}[@var{subscript}]} destroys the array element at index @var{subscript}. Negative subscripts to indexed arrays are interpreted as described above. Unsetting the last element of an array variable does not unset the variable. @code{unset @var{name}}, where @var{name} is an array, removes the entire array. A subscript of @samp{*} or @samp{@@} also removes the entire array.
es: La instrucción integrada @code{unset} se usa para destruir vectores. @code{unset @var{nombre}[@var{subíndice}]} destruye el elemento de vector en el índice @var{subíndice}. Los subíndices negativos para vectores indexados se interpretan como se describe arriba. Eliminar el último elemento de una variable de vecor no elimina la variable. @code{unset @var{nombre}}, donde @var{nombre} es un vector, elimina el vector completo. Un subíndice de @samp{*} o @samp{@@} también elimina el vector completo.

source: When using a variable name with a subscript as an argument to a command, such as with @code{unset}, without using the word expansion syntax described above, the argument is subject to the shell's filename expansion. If filename expansion is not desired, the argument should be quoted.
es: Al usar un nombre de variable con un sub@'indice como argumento para una instrucción, como con @code{unset}, sin usar la sintaxis de expansión de palabra descrita anteriormente, el argumento está sujeto a la expansión de nombre de archivo del intérprete. Si no se desea la expansión de nombre de archivo, el argumento deber@'ia ser entrecomillado.

source: The @code{declare}, @code{local}, and @code{readonly} builtins each accept a @option{-a} option to specify an indexed array and a @option{-A} option to specify an associative array. If both options are supplied, @option{-A} takes precedence. The @code{read} builtin accepts a @option{-a} option to assign a list of words read from the standard input to an array, and can read values from the standard input into individual array elements. The @code{set} and @code{declare} builtins display array values in a way that allows them to be reused as input.
es: Cada una de las instrucciones integradas @code{declare}, @code{local} y @code{readonly} aceptan una opción @option{-a} para especificar un vector indexado y una opción @option{-A} para especificar un vector asociativo. Si se proporcionan ambas opciones, @option{-A} toma precedencia. La instrucción integrada @code{read} acepta una opción @option{-a} para asignar una lista de palabras leídas de la entrada estándar a un vector, y puede leer valores de la entrada estándar en elementos de vector individuales. Las instrucciones integradas @code{set} y @code{declare} muestran valores de vector de una forma que permiten que sean reutilizados como entrada.

source: directory stack
es: pila de directorio

source: Directory Stack Builtins
es: Instrucciones Integradas de la Pila de Directorios

source: Bash builtin commands to manipulate the directory stack.
es: Las instrucciones integradas de Bash para manipular la pila de directorio.

source: The directory stack is a list of recently-visited directories. The @code{pushd} builtin adds directories to the stack as it changes the current directory, and the @code{popd} builtin removes specified directories from the stack and changes the current directory to the directory removed. The @code{dirs} builtin displays the contents of the directory stack. The current directory is always the "top" of the directory stack.
es: La pila de directorios es una lista de directorios visitados recientemente. La instrucción integrada @code{pushd} añade directorios a la pila mientras cambia el directorio actual, y la instrucción integrada @code{popd} elimina los directorios especificados de la pila y cambia el directorio actual al directorio eliminado. La instrucción integrada @code{dirs} muestra los contenidos de la pila de directorios. El directorio actual es siempre el «superior» de la pila de directorios.

source: The contents of the directory stack are also visible as the value of the @env{DIRSTACK} shell variable.
es: Los contenidos de la pila de directorios también son visibles como el valor de la variable del intérprete @env{DIRSTACK}.

source: Display the list of currently remembered directories. Directories are added to the list with the @code{pushd} command; the @code{popd} command removes directories from the list. The current directory is always the first directory in the stack.
es: Muestra la lista de los directorios actualmente recordados. Los directorios son añadidos a la lista con la instrucción @code{pushd}; la instrucción @code{popd} elimina directorios de la lista. El directorio actual es siempre el primer directorio en la pila.

source: Clears the directory stack by deleting all of the elements.
es: Limpia la pila de directorios eliminando todos los elementos.

source: Produces a listing using full pathnames; the default listing format uses a tilde to denote the home directory.
es: Produce un listado usando nombres de ruta completos; el formato de listado predeterminado usa una virgulilla para denotar el directorio principal.

source: Causes @code{dirs} to print the directory stack with one entry per line.
es: Hace que @code{dirs} imprima la pila de directorios con una entrada por línea.

source: Causes @code{dirs} to print the directory stack with one entry per line, prefixing each entry with its index in the stack.
es: Hace que @code{dirs} imprima la pila de directorios con una entrada por línea, prefijando cada entrada con su índice en la pila.

source: Displays the @var{N}th directory (counting from the left of the list printed by @code{dirs} when invoked without options), starting with zero.
es: Muestra el directorio número @var{N} (contando desde la izquierda de la lista imprimida por @code{dirs} cuando es llamado sin opciones), empezando por cero.

source: Displays the @var{N}th directory (counting from the right of the list printed by @code{dirs} when invoked without options), starting with zero.
es: Muestra el directorio número @var{N} (contando desde la derecha de la lista imprimida por @code{dirs} cuando es llamado sin opciones), empezando por cero.

source: When no arguments are given, @code{popd} removes the top directory from the stack and performs a @code{cd} to the new top directory. The elements are numbered from 0 starting at the first directory listed with @code{dirs}; that is, @code{popd} is equivalent to @code{popd +0}.
es: Cuando no se pasan argumentos, @code{popd} elimina el directorio superior de la pila y realiza un @code{cd} al nuevo directorio superior. Los elementos están numerados desde 0 empezando por el primer directorio listado con @code{dirs}; esto es, @code{popd} es equivalente a @code{popd +0}.

source: Suppresses the normal change of directory when removing directories from the stack, so that only the stack is manipulated.
es: Suprime el cambio de directorio normal al eliminar directorios de la pila, de forma que solo se manipula la pila.

source: Removes the @var{N}th directory (counting from the left of the list printed by @code{dirs}), starting with zero.
es: Elimina el directorio número @var{N} (contando desde la izquierda de la lista imprimida por @code{dirs}), empezando por cero.

source: Removes the @var{N}th directory (counting from the right of the list printed by @code{dirs}), starting with zero.
es: Elimina el directorio número @var{N} (contando desde la derecha de la lista imprimida por @code{dirs}), empezando por cero.

source: Save the current directory on the top of the directory stack and then @code{cd} to @var{dir}. With no arguments, @code{pushd} exchanges the top two directories and makes the new top the current directory.
es: Guarda el directorio actual en la parte superior de la pila de directorios y después hace un @code{cd} a @var{dir}. Sin argumentos, @code{pushd} intercambia los dos directorios superiores y convierte el nuevo superior en el directorio actual.

source: Suppresses the normal change of directory when rotating or adding directories to the stack, so that only the stack is manipulated.
es: Suprime el cambio normal de directorio al rotar o añadir directorios a la pila, de forma que solo se manipula la pila.

source: Brings the @var{N}th directory (counting from the left of the list printed by @code{dirs}, starting with zero) to the top of the list by rotating the stack.
es: Trae el directorio número @var{N} (contando desde la izquierda de la lista imprimida por @code{dirs}, empezando por cero) a la parte superior de la lista rotando la pila.

source: Brings the @var{N}th directory (counting from the right of the list printed by @code{dirs}, starting with zero) to the top of the list by rotating the stack.
es: Trae el directorio número @var{N} (contando desde la derecha de la lista imprimida por @code{dirs}, empezando por cero) a la parte superior de la lista rotando la pila.

source: Makes @var{dir} be the top of the stack, making it the new current directory as if it had been supplied as an argument to the @code{cd} builtin.
es: Hace que @var{dir} sea el superior de la pila, volviéndolo el nuevo directorio actual como si hubiera sido proporcionado como un argumento para la instrucción integrada @code{cd}.

source: prompting
es: prompt

source: The value of the variable @env{PROMPT_COMMAND} is examined just before Bash prints each primary prompt. If @env{PROMPT_COMMAND} is set and has a non-null value, then the value is executed just as if it had been typed on the command line.
es: El valor de la variable @env{PROMPT_COMMAND} es examinado justo antes de que Bash imprima cada prompt primario. Si @env{PROMPT_COMMAND} está asignada y tiene un valor no nulo, entonces se ejecuta el valor justo como si hubiera sido tecleado en la línea de órdenes.

source: In addition, the following table describes the special characters which can appear in the prompt variables @env{PS0}, @env{PS1}, @env{PS2}, and @env{PS4}:
es: Además, la siguiente tabla describe los caracteres especiales que pueden aparecer en las variables de prompt @env{PS0}, @env{PS1}, @env{PS2} y @env{PS4}:

source: A bell character.
es: Un carácter de timbre.

source: The date, in "Weekday Month Date" format (e.g., "Tue May 26").
es: La fecha, en formato "DíaSemana Mes Día" (p. ej. "Mar May 26").

source: \D@{@var{format}@}
es: \D@{@var{formato}@}

source: The @var{format} is passed to @code{strftime}(3) and the result is inserted into the prompt string; an empty @var{format} results in a locale-specific time representation. The braces are required.
es: El @var{formato} es pasado a @code{strftime}(3) y el resultado es insertado en la cadena del prompt; un @var{formato} vacío resulta en una representación del tiempo específica de región. Se requieren las llaves.

source: An escape character.
es: Un carácter de escape.

source: The hostname, up to the first `.'.
es: El nombre del anfitrión, hasta el primer `.'.

source: The hostname.
es: El nombre del anfitrión.

source: The number of jobs currently managed by the shell.
es: El número de tareas actualmente gestionadas por el intérprete.

source: The basename of the shell's terminal device name.
es: El nombre base del nombre de dispositivo de la terminal del intérprete.

source: A newline.
es: Una nueva línea.

source: A carriage return.
es: Un retorno de carro.

source: The name of the shell, the basename of @code{$0} (the portion following the final slash).
es: El nombre del intérprete, el nombre base de @code{$0} (la porción que sigue a la última barra).

source: The time, in 24-hour HH:MM:SS format.
es: La hora, en formato HH:MM:SS de 24 horas.

source: The time, in 12-hour HH:MM:SS format.
es: La hora, en formato HH:MM:SS de 12 horas.

source: The time, in 12-hour am/pm format.
es: La hora, en formato am/pm de 12 horas.

source: The time, in 24-hour HH:MM format.
es: La hora, en formato HH:MM de 24 horas.

source: The username of the current user.
es: El nombre de usuario del usuario actual.

source: The version of Bash (e.g., 2.00)
es: La versión de Bash (p. ej., 2.00)

source: The release of Bash, version + patchlevel (e.g., 2.00.0)
es: La publicación de Bash, versión + nivel de parche (p. ej., 2.00.0)

source: The current working directory, with @env{$HOME} abbreviated with a tilde (uses the @env{$PROMPT_DIRTRIM} variable).
es: El directorio de trabajo actual, con @env{$HOME} abreviado con una virgulilla (usa la variable @env{$PROMPT_DIRTRIM}).

source: The basename of @env{$PWD}, with @env{$HOME} abbreviated with a tilde.
es: El nombre base de @env{$PWD}, con @env{$HOME} abreviado con una virgulilla.

source: The history number of this command.
es: El número de historial de esta instrucción.

source: The command number of this command.
es: El número de instrucción de esta instrucción.

source: If the effective uid is 0, @code{#}, otherwise @code{$}.
es: @code{#} si el uid efectivo es 0, sino @code{$}.

source: The character whose ASCII code is the octal value @var{nnn}.
es: El carácter cuyo código ASCII es el valor octal @var{nnn}.

source: A backslash.
es: Una barra invertida.

source: Begin a sequence of non-printing characters. This could be used to embed a terminal control sequence into the prompt.
es: Empieza una secuencia de caracteres no imprimibles. Esto podría usarse para incrustar una secuencia de control de terminal en el prompt.

source: End a sequence of non-printing characters.
es: Termina una secuencia de caracteres no imprimibles.

source: The command number and the history number are usually different: the history number of a command is its position in the history list, which may include commands restored from the history file (@pxref{Bash History Facilities}), while the command number is the position in the sequence of commands executed during the current shell session.
es: El número de instrucción y el número de historial son normalmente diferentes: el número de historial de una instrucción es su posición en la lista del historial, que puede incluir instrucciones recuperadas del archivo del historial (@pxref{Servicios del Historial de Bash}), mientras que el número de instrucción es la posición en la secuencia de instrucciones ejecutada durante la sesión actual del intérprete.

source: After the string is decoded, it is expanded via parameter expansion, command substitution, arithmetic expansion, and quote removal, subject to the value of the @code{promptvars} shell option (@pxref{The Shopt Builtin}).
es: Después de que la cadena es decodificada, se expande a través de la expansión de parámetro, sustitución de instrucción, expansión aritmética y eliminación de comillas, sujeta al valor de la opción del intérprete @code{promptvars} (@pxref{La Instrucción Integrada Shopt}).

source: restricted shell
es: intérprete restringido

source: If Bash is started with the name @code{rbash}, or the @option{--restricted} or @option{-r} option is supplied at invocation, the shell becomes restricted. A restricted shell is used to set up an environment more controlled than the standard shell. A restricted shell behaves identically to @code{bash} with the exception that the following are disallowed or not performed:
es: Si Bash se inicia con el nombre @code{rbash}, o la opción @option{--restricted} o @option{-r} se proporciona en la llamada, el intérprete se vuelve restringido. Un intérprete restringido se usa para establecer un entorno más controlado que el intérprete estándar. Un intérprete restringido se comporta idénticamente a @code{bash} con la excepción de que lo siguiente es rechazado o no es realizado:

source: Changing directories with the @code{cd} builtin.
es: Cambiar directorios con la instrucción integrada @code{cd}.

source: Setting or unsetting the values of the @env{SHELL}, @env{PATH}, @env{ENV}, or @env{BASH_ENV} variables.
es: Establecer o eliminar los valores de las variables @env{SHELL}, @env{PATH}, @env{ENV} o @env{BASH_ENV}.

source: Specifying command names containing slashes.
es: Especificar nombres de instrucciones que contienen barras.

source: Specifying a filename containing a slash as an argument to the @code{.} builtin command.
es: Especificar un nombre de archivo que contiene una barra como un argumento para la instrucción integrada @code{.}.

source: Specifying a filename containing a slash as an argument to the @option{-p} option to the @code{hash} builtin command.
es: Especificar un nombre de archivo que contiene una barra como un argumento para la opción @option{-p} de la opción integrada @code{hash}.

source: Importing function definitions from the shell environment at startup.
es: Importar definiciones de función del entorno del intérprete durante el inicio.

source: Parsing the value of @env{SHELLOPTS} from the shell environment at startup.
es: Analizar el valor de @env{SHELLOPTS} desde el entorno del intérprete al inicio.

source: Redirecting output using the @samp{>}, @samp{>|}, @samp{<>}, @samp{>&}, @samp{&>}, and @samp{>>} redirection operators.
es: Redirigir salida usando los operadores de redirección @samp{>}, @samp{>|}, @samp{<>}, @samp{>&}, @samp{&>} y @samp{>>}.

source: Using the @code{exec} builtin to replace the shell with another command.
es: Usar la instrucción integrada @code{exec} para reemplazar el intérprete con otra instrucción.

source: Adding or deleting builtin commands with the @option{-f} and @option{-d} options to the @code{enable} builtin.
es: Añadir o eliminar instrucciones integradas con las opciones @option{-f} y @option{-d} de la instrucción integrada @code{enable}.

source: Using the @code{enable} builtin command to enable disabled shell builtins.
es: Usar la instrucción integrada @code{enable} para habilitar instrucciones integradas deshabilitadas.

source: Specifying the @option{-p} option to the @code{command} builtin.
es: Especificar la opción @option{-p} para la instrucción integrada @code{command}.

source: Turning off restricted mode with @samp{set +r} or @samp{set +o restricted}.
es: Desactivar el modo restringido con @samp{set +r} o @samp{set +o restricted}.

source: These restrictions are enforced after any startup files are read.
es: Estas restricciones son impuestas tras leerse los archivos de inicio.

source: When a command that is found to be a shell script is executed (@pxref{Shell Scripts}), @code{rbash} turns off any restrictions in the shell spawned to execute the script.
es: Cuando se ejecuta una instrucción que resulta ser un guion del intérprete (@pxref{Guiones del Intérprete}), @code{rbash} desactiva cualquier restricción en el intérprete creado para ejecutar el guion.

source: POSIX Mode
es: Modo POSIX

source: Starting Bash with the @option{--posix} command-line option or executing @samp{set -o posix} while Bash is running will cause Bash to conform more closely to the @sc{posix} standard by changing the behavior to match that specified by @sc{posix} in areas where the Bash default differs.
es: Empezar Bash con la opción de línea de órdenes @option{--posix} o ejecutar @samp{set -o posix} mientras Bash está corriendo hará que Bash se adhiera más fielmente al estándar @sc{posix} cambiando el comportamiento para cumplir el especificado por @sc{posix} en áreas donde lo predeterminado de Bash difiera.
