Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: cat list | parallel "do-something1 @{@} config-@{@} ; do-something2 < @{@}" | process-output
es: cat lista | parallel "haz-algo1 @{@} config-@{@} ; haz-algo2 < @{@}" | procesa-salida

source: Parallel provides a built-in mechanism to remove filename extensions, which lends itself to batch file transformations or renaming:
es: Parallel proporciona un mecanismo integrado para eliminar las extensiones de nombre de archivo, que se presta a transformaciones o renombraciones de archivos en lote:

source: This will recompress all files in the current directory with names ending in .gz using bzip2, running one job per CPU (-j+0) in parallel. (We use @code{ls} for brevity here; using @code{find} as above is more robust in the face of filenames containing unexpected characters.) Parallel can take arguments from the command line; the above can also be written as
es: Esto volverá a comprimir todos los archivos en el directorio actual con nombres acabados en .gz usando bzip2, ejecutando una tarea por CPU (-j+0) en paralelo. (Usamos @code{ls} por brevedad aquí; usar @code{find} como antes es más robusto de cara a nombres de archivo que contienen caracteres inesperados.) Parallel puede tomar argumentos de la línea de instrucciones; lo anterior puede ser también escrito como

source: If a command generates output, you may want to preserve the input order in the output. For instance, the following command
es: Si una instrucción genera salida, puede que quieras preservar el orden de entrada en la salida. Por ejemplo, la siguiente instrucción

source: will display as output the traceroute invocation that finishes first. Adding the @option{-k} option
es: mostrará como salida la llamada a traceroute que finalice primero. Añadiendo la opción @option{-k}

source: will ensure that the output of @code{traceroute foss.org.my} is displayed first.
es: asegurará que la salida de @code{traceroute foss.org.my} sea mostrada primero.

source: Finally, Parallel can be used to run a sequence of shell commands in parallel, similar to @samp{cat file | bash}. It is not uncommon to take a list of filenames, create a series of shell commands to operate on them, and feed that list of commands to a shell. Parallel can speed this up. Assuming that @file{file} contains a list of shell commands, one per line,
es: Finalmente, Parallel se puede usar para ejecutar una secuencia de instrucciones del intérprete en paralelo, similar a @samp{cat file | bash}. No es raro tomar una lista de nombres de archivo, crear conjuntos de instrucciones del intérprete para operar sobre ellos y surtir de esa línea de instrucciones a un intérprete. Parallel puede acelerar esto. Asumiendo que @file{archivo} contiene una lista de instrucciones del intérprete, una por línea,

source: parallel -j 10 < file
es: parallel -j 10 < archivo

source: will evaluate the commands using the shell (since no explicit command is supplied as an argument), in blocks of ten shell jobs at a time.
es: evaluará las instrucciones usando el intérprete (ya que no se ha proporcionado ninguna instrucción explícita como argumento), en bloques de diez tareas del intérprete cada vez.

source: shell function
es: función del intérprete

source: functions, shell
es: funciones, intérprete

source: Shell functions are a way to group commands for later execution using a single name for the group. They are executed just like a "regular" command. When the name of a shell function is used as a simple command name, the list of commands associated with that function name is executed. Shell functions are executed in the current shell context; no new process is created to interpret them.
es: Las funciones del intérprete son una forma de agrupar instrucciones para su posterior ejecución usando un único nombre para el grupo. Son ejecutadas como una instrucción «normal». Cuando se usa el nombre de una función del intérprete como un nombre de instrucción simple, se ejecuta la lista de instrucciones asociada con ese nombre de función. Las funciones del intérprete son ejecutadas en el contexto actual del intérprete; ningún nuevo proceso es creado para interpretarlas.

source: Functions are declared using this syntax:
es: Las funciones se declaran usando esta sintaxis:

source: @var{name} () @var{compound-command} [ @var{redirections} ]
es: @var{nombre} () @var{instrucción-compuesta} [ @var{redirecciones} ]

source: or
es: o

source: function @var{name} [()] @var{compound-command} [ @var{redirections} ]
es: function @var{nombre} [()] @var{instrucción-compuesta} [ @var{redirecciones} ]

source: This defines a shell function named @var{name}. The reserved word @code{function} is optional. If the @code{function} reserved word is supplied, the parentheses are optional. The @var{body} of the function is the compound command @var{compound-command} (@pxref{Compound Commands}). That command is usually a @var{list} enclosed between @{ and @}, but may be any compound command listed above, with one exception: If the @code{function} reserved word is used, but the parentheses are not supplied, the braces are required. @var{compound-command} is executed whenever @var{name} is specified as the name of a command. When the shell is in @sc{posix} mode (@pxref{Bash POSIX Mode}), @var{name} may not be the same as one of the special builtins (@pxref{Special Builtins}). Any redirections (@pxref{Redirections}) associated with the shell function are performed when the function is executed.
es: Esto define una función del intérprete llamada @var{nombre}. La palabra reservada @code{function} es opcional. Si se proporciona la palabra reservada @code{function}, los paréntesis son opcionales. El @var{cuerpo} de la función es la instrucción compuesta @var{instrucción-compuesta} (@pxref{Instrucciones Compuestas}). Esa instrucción es normalmente una @var{lista} encerrada entre @{ y @}, pero puede ser cualquier instrucción compuesta listada anteriormente, con una excepción: si se usa la palabra reservada @code{function}, pero no se proporcionan los paréntesis, las llaves son requeridas. @var{instrucción-compuesta} es ejecutada cada vez que @var{nombre} es especificado como el nombre de una instrucción. Cuando el intérprete está en modo @sc{posix} (@pxref{Modo POSIX de Bash}), @var{nombre} no puede ser el mismo que una de las instrucciones integradas especiales (@pxref{Instrucciones Integradas Especiales}). Todas las (@pxref{Redirecciones}) asociadas con la función del intérprete son realizadas cuando se ejecuta la función.

source: A function definition may be deleted using the @option{-f} option to the @code{unset} builtin (@pxref{Bourne Shell Builtins}).
es: Una definición de función puede ser eliminada usando la opción @option{-f} con la instrucción integrada @code{unset} (@pxref{Instrucciones Integradas del Bourne Shell}).

source: The exit status of a function definition is zero unless a syntax error occurs or a readonly function with the same name already exists. When executed, the exit status of a function is the exit status of the last command executed in the body.
es: El estado de salida de una definición de función es cero a no ser que ocurra un error de sintaxis o una función de solo lectura con el mismo nombre ya exista. Cuando se ejecuta, el estado de salida de una función es el estado de salida de la última instrucción ejecutada en el cuerpo.

source: Note that for historical reasons, in the most common usage the curly braces that surround the body of the function must be separated from the body by @code{blank}s or newlines. This is because the braces are reserved words and are only recognized as such when they are separated from the command list by whitespace or another shell metacharacter. Also, when using the braces, the @var{list} must be terminated by a semicolon, a @samp{&}, or a newline.
es: Tenga en cuenta que por razones históricas, en el modo más usual las llaves que rodean el cuerpo de la función tienen que estar separadas del cuerpo por @code{blanco}s o nuevas líneas. Esto es porque las llaves son palabras reservadas que solo son reconocidas como tales cuando están separadas de la lista de instrucciones por espacios en blanco u otros metacaracteres del intérprete. Además, al usar llaves, la @var{lista} debe terminar en un punto y coma, un @samp{&} o una nueva línea.

source: When a function is executed, the arguments to the function become the positional parameters during its execution (@pxref{Positional Parameters}). The special parameter @samp{#} that expands to the number of positional parameters is updated to reflect the change. Special parameter @code{0} is unchanged. The first element of the @env{FUNCNAME} variable is set to the name of the function while the function is executing.
es: Cuando se ejecuta una función, los argumentos para la función se convierten en los parámetros posicionales durante su ejecución (@pxref{Parámetros Posicionales}). El parámetro especial @samp{#} que se expande al número de parámetros posicionales se actualiza para reflejar el cambio. El parámetro especial @code{0} no es modificado. El primer elemento de la variable @env{FUNCNAME} es establecido al nombre de la función durante la ejecución de la función.

source: All other aspects of the shell execution environment are identical between a function and its caller with these exceptions: the @env{DEBUG} and @env{RETURN} traps are not inherited unless the function has been given the @code{trace} attribute using the @code{declare} builtin or the @code{-o functrace} option has been enabled with the @code{set} builtin, (in which case all functions inherit the @env{DEBUG} and @env{RETURN} traps), and the @env{ERR} trap is not inherited unless the @code{-o errtrace} shell option has been enabled. @xref{Bourne Shell Builtins}, for the description of the @code{trap} builtin.
es: Todos los otros aspectos del entorno de ejecución del intérprete son idénticos entre una función y su ejecutor con estas excepciones: las traps @env{DEBUG} y @env{RETURN} no se heredan a no ser que se le haya dado a la función el atributo @code{trace} usando la instrucción integrada @code{declare} o la opción @code{-o functrace} haya sido habilitada con la instrucción integrada @code{set}, (en cuyo caso todas las funciones heredan las traps @env{DEBUG} y @env{RETURN}), y la trap @env{ERR} no se hereda a no ser que la opción del intérprete @code{-o errtrace} haya sido habilitada. @xref{Instrucciones Integradas del Bourne Shell}, para la decripción de la instrucción integrada @code{trap}.

source: The @env{FUNCNEST} variable, if set to a numeric value greater than 0, defines a maximum function nesting level. Function invocations that exceed the limit cause the entire command to abort.
es: La variable @env{FUNCNEST}, si está establecida a un valor numérico mayor que 0, define el nivel máximo de anidamiento de funciones. Las llamadas de funciones que exceden el límite hacen que la instrucción completa se aborte.

source: If the builtin command @code{return} is executed in a function, the function completes and execution resumes with the next command after the function call. Any command associated with the @code{RETURN} trap is executed before execution resumes. When a function completes, the values of the positional parameters and the special parameter @samp{#} are restored to the values they had prior to the function's execution. If a numeric argument is given to @code{return}, that is the function's return status; otherwise the function's return status is the exit status of the last command executed before the @code{return}.
es: Si la instrucción integrada @code{return} se ejecuta en una función, la función finaliza y la ejecución se reanuda con la siguiente instrucción después de la llamada a la función. Cualquier instrucción asociada con la trap @code{RETURN} es ejecutada antes de que la ejecución se reanude. Cuando una función finaliza, los valores de los parámetros posicionales y el parámetro especial @samp{#} se restablecen a los valores que tenían antes de la ejecución de la función. Si se le pasa un argumento numérico a @code{return}, este es el estado de retorno de la función; si no, el estado de retorno de la función es el estado de salida de la última instrucción ejecutada antes de @code{return}.

source: Variables local to the function may be declared with the @code{local} builtin. These variables are visible only to the function and the commands it invokes. This is particularly important when a shell function calls other functions.
es: Las variables locales a la función pueden ser declaradas con la instrucción integrada @code{local}. Estas variables son solo visibles para la función y las instrucciones que invoca. Esto es especialmente importante cuando una función del intérprete llama a otras funciones.

source: Local variables "shadow" variables with the same name declared at previous scopes. For instance, a local variable declared in a function hides a global variable of the same name: references and assignments refer to the local variable, leaving the global variable unmodified. When the function returns, the global variable is once again visible.
es: Las variables locales variables @guillemetleft{}sombra@guillemetright{} con el mismo nombre declarado en diferentes alcances. Por ejemplo, una variable local declarada en una función esconde una variable global del mismo nombre: referencias y asignaciones se refieren a la variable local, dejando la variable global sin modificar. Cuando la función retorna, la variable global es visible de nuevo.

source: The shell uses @var{dynamic scoping} to control a variable's visibility within functions. With dynamic scoping, visible variables and their values are a result of the sequence of function calls that caused execution to reach the current function. The value of a variable that a function sees depends on its value within its caller, if any, whether that caller is the "global" scope or another shell function. This is also the value that a local variable declaration "shadows", and the value that is restored when the function returns.
es: El intérprete usa el @var{alcance dinámico} para controlar la visibilidad de una variables dentro de funciones. Con el alcance dinámico, las variables visibles y sus valores son un resultado de la secuencia de llamadas de función que hicieron que la ejecución llegara a la ubicación actual. El valor de una variable que una función ve depende de su valor dentro de su ejecutor, si existe, si el ejecutor es el alcance @guillemetleft{}global@guillemetright{} u otra función del intérprete. Esto también es el valor a la que una declaración de variable local hace @guillemetleft{}sombra@guillemetright{} y el valor que es restablecido cuando la función retorna.

source: For example, if a variable @var{var} is declared as local in function @var{func1}, and @var{func1} calls another function @var{func2}, references to @var{var} made from within @var{func2} will resolve to the local variable @var{var} from @var{func1}, shadowing any global variable named @var{var}.
es: Por ejemplo, si una variable @var{var} se declara como local en función @var{func1}, y @var{func1} llama a otra función @var{func2}, las referencias a @var{var} hechas desde dentro de @var{func2} resolverán a la variable local @var{var} de @var{func1}, haciendo sombra a cualquier variable global llamada @var{var}.

source: The following script demonstrates this behavior. When executed, the script displays
es: El siguiente guion demuestra este comportamiento. Al ser ejecutado, el guion muestra

source: The @code{unset} builtin also acts using the same dynamic scope: if a variable is local to the current scope, @code{unset} will unset it; otherwise the unset will refer to the variable found in any calling scope as described above. If a variable at the current local scope is unset, it will remain so until it is reset in that scope or until the function returns. Once the function returns, any instance of the variable at a previous scope will become visible. If the unset acts on a variable at a previous scope, any instance of a variable with that name that had been shadowed will become visible.
es: La instrucción integrada @code{unset} también actúa usando el mismo alcance dinámico: si una variable es local al actual alcance, @code{unset} la eliminará; de lo contrario, la eliminación se referirá a la variable encontrada en cualquier alcance de llamada descrito arriba. Si una variable en el alcance local actual se elimina, permanecerá as@'i hasta que sea restablecida en ese alcance o hasta que la función retorne. Una vez que la función retorna cualquier instancia de la variable en el alcance anterior se vuelve invisible. Si la eliminación actúa sobre una variable en un alcance anterior, cualquier instancia de una variable con ese nombre a la que se ha hecho sombra se volverá invisible.

source: Function names and definitions may be listed with the @option{-f} option to the @code{declare} (@code{typeset}) builtin command (@pxref{Bash Builtins}). The @option{-F} option to @code{declare} or @code{typeset} will list the function names only (and optionally the source file and line number, if the @code{extdebug} shell option is enabled). Functions may be exported so that subshells automatically have them defined with the @option{-f} option to the @code{export} builtin (@pxref{Bourne Shell Builtins}).
es: Los nombres y definiciones de funciones pueden ser listados con la opción @option{-f} para la instrucción integrada @code{declare} (@code{typeset}) (@pxref{Instrucciones Integradas de Bash}). La opción @option{-F} para @code{declare} o @code{typeset} listará solo los nombres de funciones (y opcionalmente el archivo fuente y el número de línea, si la opción del intérprete @code{extdebug} está habilitada). Las funciones pueden ser importadas para que los subintérpretes las tengan definidas automáticamente con la opción @option{-f} para la instrucción integrada @code{export} (@pxref{Instrucciones Integradas del Intérprete}).

source: Functions may be recursive. The @code{FUNCNEST} variable may be used to limit the depth of the function call stack and restrict the number of function invocations. By default, no limit is placed on the number of recursive calls.
es: Las funciones pueden ser recursivas. La variable @code{FUNCNEST} se puede usar para limitar la profundidad de la pila de llamadas y restringir el número de llamadas de función. Por defecto, no hay límite en el número de llamadas recursivas.

source: parameters
es: parámetros

source: variable, shell
es: variable, intérprete

source: shell variable
es: variable del intérprete

source: Positional Parameters
es: Parámetros Posicionales

source: The shell's command-line arguments.
es: Los argumentos de línea de órdenes del intérprete.

source: Special Parameters
es: Parámetros Especiales

source: Parameters denoted by special characters.
es: Parámetros denotados por caracteres especiales.

source: A @var{parameter} is an entity that stores values. It can be a @code{name}, a number, or one of the special characters listed below. A @var{variable} is a parameter denoted by a @code{name}. A variable has a @var{value} and zero or more @var{attributes}. Attributes are assigned using the @code{declare} builtin command (see the description of the @code{declare} builtin in @ref{Bash Builtins}).
es: Un @var{parámetro} es una entidad que almacena valores. Puede ser un @code{nombre}, un número o uno de los caracteres especiales listados más abajo. Una @var{variable} es un parámetro denotado por un @code{nombre}. Una variable tiene un @var{valor} y cero o más @var{atributos}. Los atributos son asignados usando la instrucción integrada @code{declare} (consulte la descripción de la instrucción integrada @code{declare} en @ref{Instrucciones Integradas de Bash}).

source: A parameter is set if it has been assigned a value. The null string is a valid value. Once a variable is set, it may be unset only by using the @code{unset} builtin command.
es: Un parámetro está establecido si se le ha asignado un valor. La cadena nula es un valor válido. Una vez que se asigne una variable, solo puede ser eliminada usando la instrucción integrada @code{unset}.

source: A variable may be assigned to by a statement of the form
es: Se puede asignar a una variable con una declaración de la forma

source: @var{name}=[@var{value}]
es: @var{nombre}=[@var{valor}]

source: If @var{value} is not given, the variable is assigned the null string. All @var{value}s undergo tilde expansion, parameter and variable expansion, command substitution, arithmetic expansion, and quote removal (detailed below). If the variable has its @code{integer} attribute set, then @var{value} is evaluated as an arithmetic expression even if the @code{$((@dots{}))} expansion is not used (@pxref{Arithmetic Expansion}). Word splitting is not performed, with the exception of @code{"$@@"} as explained below. Filename expansion is not performed. Assignment statements may also appear as arguments to the @code{alias}, @code{declare}, @code{typeset}, @code{export}, @code{readonly}, and @code{local} builtin commands (@var{declaration} commands). When in @sc{posix} mode (@pxref{Bash POSIX Mode}), these builtins may appear in a command after one or more instances of the @code{command} builtin and retain these assignment statement properties.
es: Si no se da @var{valor}, se asigna la cadena nula a la variable. Todos los @var{valor}es experimentan la expansión de virgulilla, la expansión de parámetros y de variables, sustitución de instrucciones, expansión aritmética y eliminación de comillas (detallada a continuación). Si la variable tiene establecido su atributo @code{integer}, entonces el @var{valor} es evaluado como una expansión aritmética incluso si no es usada la expansión @code{$((@dots{}))} (@pxref{Expansión Aritmética}). No se realiza la separación de palabras, con la excepción de @code{"$@@"} como se explica más abajo. No se realiza la expansión de nombre de archivo. Las declaraciones de asignaciones pueden aparecer también como argumentos para las instrucciones integradas @code{alias}, @code{declare}, @code{typeset}, @code{export}, @code{readonly} y @code{local} (instrucciones de @var{declaración}). Durante modo @sc{posix} (@pxref{Modo POSIX de Bash}), estas instrucciones integradas pueden aparecer en una instrucción después de una o más instancias de la instrucción integrada @code{command} y mantener estas propiedades de declaración de asignación.
