Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: Otherwise, roughly speaking, the shell reads its input and divides the input into words and operators, employing the quoting rules to select which meanings to assign various words and characters.
es: De lo contrario, básicamente, el intérprete lee su entrada y divide la entrada en palabras y operadores, empleando las reglas de entrecomillado para elegir qué significados asignar a varias palabras y caracteres.

source: The shell then parses these tokens into commands and other constructs, removes the special meaning of certain words or characters, expands others, redirects input and output as needed, executes the specified command, waits for the command's exit status, and makes that exit status available for further inspection or processing.
es: El intérprete entonces transforma estos símbolos en instrucciones y otras construcciones, elimina el significado especial de ciertas palabras o caracteres, expande otros, redirige entrada y salida según sea necesario, ejecuta la instrucción especificada, espera el estado de salida de la instrucción y deja disponible ese estado de salida para inspección o procesamiento posterior.

source: The following is a brief description of the shell's operation when it reads and executes a command. Basically, the shell does the following:
es: Lo siguiente es una breve descripción del funcionamiento del intérprete cuando lee y ejecuta una instrucción. Básicamente, el intérprete hace lo siguiente:

source: Reads its input from a file (@pxref{Shell Scripts}), from a string supplied as an argument to the @option{-c} invocation option (@pxref{Invoking Bash}), or from the user's terminal.
es: Lee su entrada de un archivo (@pxref{Guiones del Intérprete}), de una cadena proporcionada como un argumento para la opción de llamada @option{-c} (@pxref{Llamando a Bash}) o de la terminal del usuario.

source: Breaks the input into words and operators, obeying the quoting rules described in @ref{Quoting}. These tokens are separated by @code{metacharacters}. Alias expansion is performed by this step (@pxref{Aliases}).
es: Divide la entrada en palabras y operadores, atendiendo a las reglas de entrecomillado descritas en @ref{Entrecomillado}. Estos símbolos son separados por @code{metacaracteres}. La expansión de alias se realiza por este paso (@pxref{Aliases}).

source: Parses the tokens into simple and compound commands (@pxref{Shell Commands}).
es: Transforma estos símbolos en instrucciones simples y compuestas (@pxref{Instrucciones del Intérprete}).

source: Performs the various shell expansions (@pxref{Shell Expansions}), breaking the expanded tokens into lists of filenames (@pxref{Filename Expansion}) and commands and arguments.
es: Realiza las distintas expansiones del intérprete (@pxref{Expansiones del Intérprete}), dividiendo los símbolos expandidos en listas de nombres de archivo (@pxref{Expansión de Nombre de Archivo} e instrucciones y argumentos.

source: Performs any necessary redirections (@pxref{Redirections}) and removes the redirection operators and their operands from the argument list.
es: Realiza cualquier redirección necesaria (@pxref{Redirecciones}) y elimina los operadores de redirección y sus operandos de la lista de argumentos.

source: Executes the command (@pxref{Executing Commands}).
es: Ejecuta la instrucción (@pxref{Ejecutando Instrucciones}).

source: Optionally waits for the command to complete and collects its exit status (@pxref{Exit Status}).
es: Opcionalmente espera a que la instrucción termine y recoge su estado de salida (@pxref{Estado de Salida}).

source: quoting
es: entrecomillado

source: Escape Character
es: Carácter de Escape

source: How to remove the special meaning from a single character.
es: Cómo eliminar el significado especial de un carácter simple.

source: Single Quotes
es: Comillas Simples

source: How to inhibit all interpretation of a sequence of characters.
es: Cómo inhibir toda interpretación de una secuencia de caracteres.

source: Double Quotes
es: Comillas Dobles

source: How to suppress most of the interpretation of a sequence of characters.
es: Cómo suprimir la mayor parte de la interpretación de una secuencia de caracteres.

source: ANSI-C Quoting
es: Entrecomillado ANSI-C

source: How to expand ANSI-C sequences in quoted strings.
es: Cómo expandir secuencias de ANSI-C en cadenas entrecomilladas.

source: Locale Translation
es: Traducción de Localización

source: How to translate strings into different languages.
es: Cómo traducir cadenas a diferentes idiomas.

source: Quoting is used to remove the special meaning of certain characters or words to the shell. Quoting can be used to disable special treatment for special characters, to prevent reserved words from being recognized as such, and to prevent parameter expansion.
es: El entrecomillado se usa para eliminar el significado especial para el intérprete de ciertos caracteres o palabras. El entrecomillado se puede usar para deshabilitar el tratamiento especial de caracteres especiales, para evitar que se reconozcan palabras reservadas como tales y para evitar la expansión de parámetro.

source: Each of the shell metacharacters (@pxref{Definitions}) has special meaning to the shell and must be quoted if it is to represent itself. When the command history expansion facilities are being used (@pxref{History Interaction}), the @var{history expansion} character, usually @samp{!}, must be quoted to prevent history expansion. @xref{Bash History Facilities}, for more details concerning history expansion.
es: Cada uno de los metacaracteres del intérprete (@pxref{Definiciones}) tiene un significado especial para el intérprete y debe ser entrecomillado si se representa a sí mismo. Cuando se usan las facilidades de expansión del historial de instrucciones (@pxref{Interacción con el Historial}), el carácter de @var{expansión de historial}, normalmente @samp{!}, debe entrecomillarse para evitar la expansión de historial. @xref{Servicios del Historial de Bash}, para más detalles sobre la expansión de historial.

source: There are three quoting mechanisms: the @var{escape character}, single quotes, and double quotes.
es: Hay tres mecanismos de entrecomillado: el @var{carácter de escape}, comillas simples y comillas dobles.

source: A non-quoted backslash @samp{\} is the Bash escape character. It preserves the literal value of the next character that follows, with the exception of @code{newline}. If a @code{\newline} pair appears, and the backslash itself is not quoted, the @code{\newline} is treated as a line continuation (that is, it is removed from the input stream and effectively ignored).
es: La barra invertida sin entrecomillar @samp{\} es el carácter de escape de Bash. Preserva el valor literal del siguiente carácter que lo sigue, con la excepción de @code{nueva línea}. Si aparece una pareja @code{\nueva línea} y la barra invertida en sí no está entrecomillada, la @code{\nueva línea} se trata como una continuación de línea (es decir, es eliminada del flujo de entrada y es efectivamente ignorada).

source: Enclosing characters in single quotes (@samp{'}) preserves the literal value of each character within the quotes. A single quote may not occur between single quotes, even when preceded by a backslash.
es: Encerrar caracteres en comillas simples (@samp{'}) preserva el valor literal de cada carácter dentro de las comillas. Una comilla simple no puede encontrarse entre comillas simples, incluso precedida de una barra invertida.

source: Enclosing characters in double quotes (@samp{"}) preserves the literal value of all characters within the quotes, with the exception of @samp{$}, @samp{`}, @samp{\}, and, when history expansion is enabled, @samp{!}. When the shell is in @sc{posix} mode (@pxref{Bash POSIX Mode}), the @samp{!} has no special meaning within double quotes, even when history expansion is enabled. The characters @samp{$} and @samp{`} retain their special meaning within double quotes (@pxref{Shell Expansions}). The backslash retains its special meaning only when followed by one of the following characters: @samp{$}, @samp{`}, @samp{"}, @samp{\}, or @code{newline}. Within double quotes, backslashes that are followed by one of these characters are removed. Backslashes preceding characters without a special meaning are left unmodified. A double quote may be quoted within double quotes by preceding it with a backslash. If enabled, history expansion will be performed unless an @samp{!} appearing in double quotes is escaped using a backslash. The backslash preceding the @samp{!} is not removed.
es: Encerrar caracteres en comillas dobles (@samp{"}) preserva el valor literal de todos los caracteres entre las comillas, con la excepción de @samp{$}, @samp{`}, @samp{\} y, cuando está activada la expansión de historial, @samp{!}. Cuando el intérprete está en modo @sc{posix} (@pxref{Modo POSIX de Bash}), el @samp{!} no tiene un significado especial entre comillas dobles, incluso cuando está activada la expansión de historial. Los caracteres @samp{$} y @samp{`} conservan su significado especial dentro de comillas dobles (@pxref{Expansiones del Intérprete}). La barra invertida solo conserva su significado especial seguido por uno de los siguientes caracteres: @samp{$}, @samp{`}, @samp{"}, @samp{\} o @code{nueva línea}. Dentro de comillas dobles, las barras invertidas que son seguidas por uno de estos caracteres son eliminadas. Las barras invertidas precediendo caracteres sin un significado especial no se modifican. Una comilla doble puede ser entrecomillada dentro de comillas dobles precediéndola con una barra invertida. Si está habilitada, la expansión del historial se realizará a no ser que se escape un @samp{!} que aparezca entre comillas dobles con una barra invertida. La barra invertida que precede al @samp{!} no es eliminada.

source: The special parameters @samp{*} and @samp{@@} have special meaning when in double quotes (@pxref{Shell Parameter Expansion}).
es: Los parámetros especiales @samp{*} y @samp{@@} tienen significado especial entre comillas dobles (@pxref{Expansión de Parámetros del Intérprete}).

source: quoting, ANSI
es: entrecomillado, ANSI

source: Words of the form @code{$'@var{string}'} are treated specially. The word expands to @var{string}, with backslash-escaped characters replaced as specified by the ANSI C standard. Backslash escape sequences, if present, are decoded as follows:
es: Las palabras de forma @code{$'@var{cadena}'} se tratan de forma especial. La palabra se expande a @var{cadena}, con los caracteres escapados por barras invertidas reemplazados como se especifica en el estándar ANSI C. Si están presentes, las secuencias de escape de barras invertidas se decodifican así:

source: alert (bell)
es: alerta (timbre)

source: backspace
es: retroceso

source: an escape character (not ANSI C)
es: un carácter de escape (no ANSI C)

source: form feed
es: salto de página

source: newline
es: nueva línea

source: carriage return
es: retorno de carro

source: horizontal tab
es: tabulación horizontal

source: vertical tab
es: tabulación vertical

source: backslash
es: barra invertida

source: single quote
es: comilla simple

source: double quote
es: comilla doble

source: question mark
es: símbolo de interrogación de cierre

source: the eight-bit character whose value is the octal value @var{nnn} (one to three octal digits)
es: el carácter de ocho bits cuyo valor es el valor octal @var{nnn} (de uno a tres dígitos octales).

source: the eight-bit character whose value is the hexadecimal value @var{HH} (one or two hex digits)
es: el carácter de ocho bits cuyo valor es el valor hexadecimal @var{HH} (uno o dos dígitos hexadecimales)

source: the Unicode (ISO/IEC 10646) character whose value is the hexadecimal value @var{HHHH} (one to four hex digits)
es: el carácter Unicode (ISO/IEC 10646) cuyo valor es el valor hexadecimal @var{HHHH} (de uno a cuatro dígitos hexadecimales)

source: the Unicode (ISO/IEC 10646) character whose value is the hexadecimal value @var{HHHHHHHH} (one to eight hex digits)
es: el carácter Unicode (ISO/IEC 10646) cuyo valor es el valor hexadecimal @var{HHHHHHHH} (de uno a ocho dígitos hexadecimales)

source: a control-@var{x} character
es: un catácter control-@var{x}

source: The expanded result is single-quoted, as if the dollar sign had not been present.
es: El resultado expandido es entrecomillado con una comilla, como si el símbolo de dolar no hubiera estado presente.

source: Locale-Specific Translation
es: Traducción de Región Específica

source: localization
es: localización

source: internationalization
es: internacionalización

source: native languages
es: idiomas nativos

source: translation, native languages
es: traducción, idiomas nativos

source: A double-quoted string preceded by a dollar sign (@samp{$}) will cause the string to be translated according to the current locale. If the current locale is @code{C} or @code{POSIX}, the dollar sign is ignored. If the string is translated and replaced, the replacement is double-quoted.
es: Una cadena entre comillas dobles precedida del signo de dolar (@samp{$}) hará que la cadena sea traducida según la configuración regional actual. Si la configuración regional actual es @code{C} o @code{POSIX}, se ignora el signo de dolar. Si la cadena se traduce y reemplaza, el remplazo está entre comillas dobles.

source: Some systems use the message catalog selected by the @env{LC_MESSAGES} shell variable. Others create the name of the message catalog from the value of the @env{TEXTDOMAIN} shell variable, possibly adding a suffix of @samp{.mo}. If you use the @env{TEXTDOMAIN} variable, you may need to set the @env{TEXTDOMAINDIR} variable to the location of the message catalog files. Still others use both variables in this fashion: @env{TEXTDOMAINDIR}/@env{LC_MESSAGES}/LC_MESSAGES/@env{TEXTDOMAIN}.mo.
es: Algunos sistemas usan el catálogo de mensajes elegido por la variable del intérprete @env{LC_MESSAGES}. Otros crean el nombre del catálogo de mensajes desde el valor de la variable del intérprete @env{TEXTDOMAIN}, posiblemente añadiendo un sufijo de @samp{.mo}. Si usa la variable @env{TEXTDOMAIN}, puede que necesite establecer la variable @env{TEXTDOMAINDIR} a la ubicación del archivo de catálogo de mensajes. Otros usan todavía ambas variables de esta forma: @env{TEXTDOMAINDIR}/@env{LC_MESSAGES}/LC_MESSAGES/@env{TEXTDOMAIN}.mo.

source: comments, shell
es: comentarios, intérprete

source: In a non-interactive shell, or an interactive shell in which the @code{interactive_comments} option to the @code{shopt} builtin is enabled (@pxref{The Shopt Builtin}), a word beginning with @samp{#} causes that word and all remaining characters on that line to be ignored. An interactive shell without the @code{interactive_comments} option enabled does not allow comments. The @code{interactive_comments} option is on by default in interactive shells. @xref{Interactive Shells}, for a description of what makes a shell interactive.
es: En un intérprete no interactivo o un intérprete interactivo en que la opción @code{interactive_comments} para la instrucción integrada @code{shopt} está activada (@pxref{La Instrucción Integrada Shopt}), una palabra que empieza por @samp{#} hace que esa palabra y todos los caracteres restantes en esa línea sean ignorados. Un intérprete interactivo sin la opción @code{interactive_comments} activada no permite comentarios. La opción @code{interactive_comments} está activada por defecto en intérpretes interactivos. @xref{Intérpretes Interactivos}, para una descripción de qué hace a un intérprete interactivo.

source: commands, shell
es: instrucciones, intérprete

source: A simple shell command such as @code{echo a b c} consists of the command itself followed by arguments, separated by spaces.
es: Una instrucción simple del intérprete como @code{echo a b c} consta de la instrucción en sí seguida por argumentos, separados por espacios.

source: More complex shell commands are composed of simple commands arranged together in a variety of ways: in a pipeline in which the output of one command becomes the input of a second, in a loop or conditional construct, or in some other grouping.
es: Las instrucciones del intérprete más complejas están compuestas de instrucciones simples organizadas conjuntamente de diferentes maneras: en una tubería en que la salida de una instrucción se convierte en la entrada de una segunda, en un bucle o instrucción condicional o en alguna otra agrupación.

source: Simple Commands
es: Instrucciones Simples

source: The most common type of command.
es: El tipo de instrucción más común.

source: Pipelines
es: Tuberías

source: Connecting the input and output of several commands.
es: Conectando la entrada y la salida de varias instrucciones.

source: Lists
es: Listas

source: How to execute commands sequentially.
es: Cómo ejecutar instrucciones secuencialmente.

source: Compound Commands
es: Instrucciones Compuestas

source: Shell commands for control flow.
es: Instrucciones del intérprete para el control del flujo.

source: Coprocesses
es: Coprocesos

source: Two-way communication between commands.
es: Comunicación bidireccional entre instrucciones.

source: Running commands in parallel.
es: Ejecutando instrucciones en paralelo.

source: commands, simple
es: instrucciones, simple

source: A simple command is the kind of command encountered most often. It's just a sequence of words separated by @code{blank}s, terminated by one of the shell's control operators (@pxref{Definitions}). The first word generally specifies a command to be executed, with the rest of the words being that command's arguments.
es: Una instrucción simple es el tipo de instrucción encontrado más a menudo. Es solo una secuencia de palabras separadas por @code{blanco}s, terminada en uno de los operadores de control del intérprete (@pxref{Definiciones}). La primera palabra especifica generalmente una instrucción para que sea ejecutada, siendo el resto de las palabras los argumentos de esa instrucción.

source: The return status (@pxref{Exit Status}) of a simple command is its exit status as provided by the @sc{posix} 1003.1 @code{waitpid} function, or 128+@var{n} if the command was terminated by signal @var{n}.
es: El estado de retorno (@pxref{Estado de Salida}) de una instrucción simple es su estado de salida tal como estipula la función @sc{posix} 1003.1 @code{waitpid} o 128+@var{n} si la instrucción fue terminada por la señal @var{n}.

source: pipeline
es: tubería

source: commands, pipelines
es: instrucciones, tubería

source: A @code{pipeline} is a sequence of one or more commands separated by one of the control operators @samp{|} or @samp{|&}.
es: Una @code{tubería} es una secuencia de una o más instrucciones separadas por uno de los operadores de control @samp{|} o @samp{|&}.

source: command timing
es: cronometraje de instrucción

source: The format for a pipeline is
es: El formato para una tubería es

source: [time [-p]] [!] @var{command1} [ | or |& @var{command2} ] @dots{}
es: [time [-p]] [!] @var{instrucción1} [ | o |& @var{instrucción2} ] @dots{}

source: The output of each command in the pipeline is connected via a pipe to the input of the next command. That is, each command reads the previous command's output. This connection is performed before any redirections specified by the command.
es: La salida de cada instrucción en la tubería es conectada por medio de una tubería a la entrada de la siguiente instrucción. Es decir, cada instrucción lee la salida de la anterior instrucción. Esta conexión se realiza antes de cualquier redirección especificada por la instrucción.

source: If @samp{|&} is used, @var{command1}'s standard error, in addition to its standard output, is connected to @var{command2}'s standard input through the pipe; it is shorthand for @code{2>&1 |}. This implicit redirection of the standard error to the standard output is performed after any redirections specified by the command.
es: Si se usa @samp{|&}, el error estándar de @var{instrucción1}, además de su salida estándar, es conectado a la entrada estándar de @var{instrucción2} a través de la tubería; es una abreviatura de @code{2>&1 |}. Esta redirección implícita del error estándar a la salida estándar es realizada después de cualquier redirección especificada por la instrucción.

source: The reserved word @code{time} causes timing statistics to be printed for the pipeline once it finishes. The statistics currently consist of elapsed (wall-clock) time and user and system time consumed by the command's execution. The @option{-p} option changes the output format to that specified by @sc{posix}. When the shell is in @sc{posix} mode (@pxref{Bash POSIX Mode}), it does not recognize @code{time} as a reserved word if the next token begins with a @samp{-}. The @env{TIMEFORMAT} variable may be set to a format string that specifies how the timing information should be displayed. @xref{Bash Variables}, for a description of the available formats. The use of @code{time} as a reserved word permits the timing of shell builtins, shell functions, and pipelines. An external @code{time} command cannot time these easily.
es: La palabra reservada @code{time} hace que sean imprimidas estadísticas temporales para la tubería una vez finalice. Las estadísticas constan actualmente del tiempo (de reloj) transcurrido y del tiempo de usuario y de sistema consumido por la ejecución de la instrucción. La opción @option{-p} cambia el formato de salida al especificado por @sc{posix}. Cuando el intérprete está en el modo @sc{posix} (@pxref{Modo POSIX de Bash}), no reconoce @code{time} como una palabra reservada si el siguiente símbolo comienza por @samp{-}. La variable @env{TIMEFORMAT} puede ser establecida a una cadena de formato que especifica cómo debe ser mostrada la información temporal. @xref{Variables de Bash}, para una descripción de los formatos disponibles. El uso de @code{time} como una palabra reservada permite el cronometraje de las instrucciones integradas del intérprete, funciones del intérprete y tuberías. Una instrucción @code{time} externa no puede cronometrar estas fácilmente.

source: When the shell is in @sc{posix} mode (@pxref{Bash POSIX Mode}), @code{time} may be followed by a newline. In this case, the shell displays the total user and system time consumed by the shell and its children. The @env{TIMEFORMAT} variable may be used to specify the format of the time information.
es: Cuando el intérprete está en modo @sc{posix} (@pxref{Modo POSIX de Bash}), @code{time} puede ser seguido por una nueva línea. En este caso, el intérprete muestra el tiempo total de usuario y de sistema consumido por el intérprete y sus hijos. La variable @env{TIMEFORMAT} puede ser usada para especificar el formato de la información temporal.

source: If the pipeline is not executed asynchronously (@pxref{Lists}), the shell waits for all commands in the pipeline to complete.
es: Si la tubería no es ejecutada asíncronamete (@pxref{Listas}), el intérprete espera a que todas las instrucciones en la tubería se completen.

source: Each command in a pipeline is executed in its own subshell, which is a separate process (@pxref{Command Execution Environment}). If the @code{lastpipe} option is enabled using the @code{shopt} builtin (@pxref{The Shopt Builtin}), the last element of a pipeline may be run by the shell process.
es: Cada instrucción en una tuber@'ia se ejecuta en su propio subintérprete, que es un proceso separado (@pxref{Entorno de Ejecución de Instrucciones}). Si la opción @code{lastpipe} está activada por medio de la instrucción integrada @code{shopt} (@pxref{La Instrucción Integrada Shopt}), el último elemento de una tuber@'ia puede ser ejecutado por el proceso del intérprete.
