Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: suspending jobs
es: suspender tareas

source: Job control refers to the ability to selectively stop (suspend) the execution of processes and continue (resume) their execution at a later point. A user typically employs this facility via an interactive interface supplied jointly by the operating system kernel's terminal driver and Bash.
es: El control de tareas se refiere a la habilidad de parar selectivamente (suspender) la ejecución de procesos y continuar (reanudar) su ejecución en un momento posterior. Un usuario emplea típicamente esta herramienta mediante una interfaz interactiva proporcionada conjuntamente por el controlador de terminal del núcleo del sistema operativo y Bash.

source: The shell associates a @var{job} with each pipeline. It keeps a table of currently executing jobs, which may be listed with the @code{jobs} command. When Bash starts a job asynchronously, it prints a line that looks like:
es: El intérprete asocia una @var{tarea} con cada tubería. Mantiene una tabla de tareas ejecutándose actualmente, que puede ser listada con la instrucción @code{jobs}. Cuando Bash inicia una tarea asíncronamente, imprime una línea con este aspecto:

source: indicating that this job is job number 1 and that the process @sc{id} of the last process in the pipeline associated with this job is 25647. All of the processes in a single pipeline are members of the same job. Bash uses the @var{job} abstraction as the basis for job control.
es: indicando que esta tarea es el número de tarea 1 y que el @sc{id} de proceso del último proceso en la tubería asociado con esta tarea es el 25647. Cada uno de los procesos en una única tubería son miembros de la misma tarea. Bash usa la abstracción @var{tarea} como la base para el control de tareas.

source: To facilitate the implementation of the user interface to job control, the operating system maintains the notion of a current terminal process group @sc{id}. Members of this process group (processes whose process group @sc{id} is equal to the current terminal process group @sc{id}) receive keyboard-generated signals such as @code{SIGINT}. These processes are said to be in the foreground. Background processes are those whose process group @sc{id} differs from the terminal's; such processes are immune to keyboard-generated signals. Only foreground processes are allowed to read from or, if the user so specifies with @code{stty tostop}, write to the terminal. Background processes which attempt to read from (write to when @code{stty tostop} is in effect) the terminal are sent a @code{SIGTTIN} (@code{SIGTTOU}) signal by the kernel's terminal driver, which, unless caught, suspends the process.
es: Para facilitar la implementación de la interfaz de usuario para el control de tareas, el sistema operativo mantiene la noción de un @sc{id} de grupo de proceso actual de terminal. Los miembros de este grupo de proceso (procesos cuyo @sc{id} de grupo de proceso es igual al @sc{id} de grupo de proceso actual de terminal) reciben señales generadas por el teclado como @code{SIGINT}. Se dice que estos procesos están en primer plano. Los procesos en segundo plano son aquellos cuyo @sc{id} de grupo de proceso difiere del de la terminal; estos procesos son inmunes a señales generadas con el teclado. Solo se permite a los procesos en primer plano leer de o, si el usuario especifica así con @code{stty tostop}, escribir a la terminal. A los procesos en segundo plano que tratan de leer de (escribir a cuando está en efecto @code{stty tostop}) la terminal se les envía una señal @code{SIGTTIN} (@code{SIGTTOU}) por el controlador de la terminal del núcleo, que, a no ser que se atrape, suspende el proceso.

source: If the operating system on which Bash is running supports job control, Bash contains facilities to use it. Typing the @var{suspend} character (typically @samp{^Z}, Control-Z) while a process is running causes that process to be stopped and returns control to Bash. Typing the @var{delayed suspend} character (typically @samp{^Y}, Control-Y) causes the process to be stopped when it attempts to read input from the terminal, and control to be returned to Bash. The user then manipulates the state of this job, using the @code{bg} command to continue it in the background, the @code{fg} command to continue it in the foreground, or the @code{kill} command to kill it. A @samp{^Z} takes effect immediately, and has the additional side effect of causing pending output and typeahead to be discarded.
es: Si el sistema operativo en que Bash se está ejecutando soporta el control de tareas, Bash contiene herramientas para usarlo. Teclear el carácter @var{suspend} (típicamente @samp{^Z}, Control-Z) mientras está corriendo un proceso hace que el proceso se pare cuando trata de leer la entrada de la terminal y devuelva el control a Bash. El usuario entonces manipula el estado de esta tarea, usando la instrucción @code{bg} para continuarla en segundo plano, la instrucción @code{fg} para continuarla en primer plano o la instrucción @code{kill} para matarla. Un @samp{^Z} tiene efecto inmediatamente, y tiene el efecto secundario adicional de hacer que la salida pendiente y las pulsaciones adicionales sean descartadas.

source: There are a number of ways to refer to a job in the shell. The character @samp{%} introduces a job specification (@var{jobspec}).
es: Hay varias formas de hacer referencia a una tarea en el intérprete. El carácter @samp{%} introduce una especificación de tarea (@var{jobspec}).

source: Job number @code{n} may be referred to as @samp{%n}. The symbols @samp{%%} and @samp{%+} refer to the shell's notion of the current job, which is the last job stopped while it was in the foreground or started in the background. A single @samp{%} (with no accompanying job specification) also refers to the current job. The previous job may be referenced using @samp{%-}. If there is only a single job, @samp{%+} and @samp{%-} can both be used to refer to that job. In output pertaining to jobs (e.g., the output of the @code{jobs} command), the current job is always flagged with a @samp{+}, and the previous job with a @samp{-}.
es: Se puede hacer referencia al número de tarea @code{n} con @samp{%n}. Los símbolos @samp{%%} y @samp{%+} hacen referencia a la noción del intérprete de la tarea actual, que es la última tarea detenida mientras estaba en primer plano o comenzada en segundo plano. Un único @samp{%} (sin una especificación de tarea que lo acompañe) también se refiere a la tarea actual. Se puede hacer referencia a la tarea previa usando @samp{%-}. Si hay solo una única tarea, ambos @samp{%+} y @samp{%-} pueden ser usados para hacer referencia a esa tarea. En salida referente a tareas (p. ej., la salida de la instrucción @code{jobs}), la tarea actual siempre se marca con un @samp{+}, y la tarea previa con un @samp{-}.

source: A job may also be referred to using a prefix of the name used to start it, or using a substring that appears in its command line. For example, @samp{%ce} refers to a stopped @code{ce} job. Using @samp{%?ce}, on the other hand, refers to any job containing the string @samp{ce} in its command line. If the prefix or substring matches more than one job, Bash reports an error.
es: También se puede hacer referencia a una tarea usando un prefijo del nombre usado para comenzarla o usando una subcadena que aparece en su línea de instrucción. Por ejemplo, @samp{%ce} se refiere a la tarea detenida @code{ce}. Usando @samp{%?ce}, por otro lado, se refiere a cualquier tarea que contenga la cadena @samp{ce} en su línea de instrucción. Si el prefijo o la subcadena coincide con más de una tarea, Bash informa de un error.

source: Simply naming a job can be used to bring it into the foreground: @samp{%1} is a synonym for @samp{fg %1}, bringing job 1 from the background into the foreground. Similarly, @samp{%1 &} resumes job 1 in the background, equivalent to @samp{bg %1}
es: Simplemente nombrar una tarea puede hacerse para traerla a primer plano: @samp{%1} es un sinónimo de @samp{fg %1}, llevando la tarea 1 desde el segundo plano a primer plano. Similarmente, @samp{%1 &} reanuda la tarea 1 en segundo plano, equivalente a @samp{bg %1}

source: The shell learns immediately whenever a job changes state. Normally, Bash waits until it is about to print a prompt before reporting changes in a job's status so as to not interrupt any other output. If the @option{-b} option to the @code{set} builtin is enabled, Bash reports such changes immediately (@pxref{The Set Builtin}). Any trap on @code{SIGCHLD} is executed for each child process that exits.
es: El intérprete se entera inmediatamente de cuándo un tarea cambia de estado. Normalmente, Bash espera hasta que está a punto de imprimir un prompt antes de informar de cambios en un estado de tarea para no interrumpir cualquier otra salida. Si está habilitada la opción @option{-b} de la instrucción integrada @code{set}, Bash importa tales cambios inmediatamente (@pxref{La Instrucción Integrada Set}). Cualquier trap en @code{SIGCHLD} se ejecuta para cada proceso hijo que finaliza.

source: If an attempt to exit Bash is made while jobs are stopped, (or running, if the @code{checkjobs} option is enabled -- see @ref{The Shopt Builtin}), the shell prints a warning message, and if the @code{checkjobs} option is enabled, lists the jobs and their statuses. The @code{jobs} command may then be used to inspect their status. If a second attempt to exit is made without an intervening command, Bash does not print another warning, and any stopped jobs are terminated.
es: Si se realiza un intento de salir de Bash mientras las tareas están detenidas (o corriendo, si la opción @code{checkjobs} está habilitada ---vea @ref{La Instrucción Integrada Shopt}---), el intérprete imprime un mensaje de advertencia, y si la opción @code{checkjobs} está habilitada, lista las tareas y sus estados. La instrucción @code{jobs} puede ser usada entonces para inspeccionar sus estados. Si se realiza un segundo intento de salir sin una instrucción que intervenga, Bash no imprime otra advertencia, y se finalizan todas las tareas detenidas.

source: When the shell is waiting for a job or process using the @code{wait} builtin, and job control is enabled, @code{wait} will return when the job changes state. The @option{-f} option will force @code{wait} to wait until the job or process terminates before returning.
es: Cuando el intérprete está esperando a una tarea o un proceso usando la instrucción integrada @code{wait} y el control de tareas está habilitado, @code{wait} retornará cuando la tarea cambie de estado. La opción @option{-f} forzará a @code{wait} a esperar antes de retornar hasta que la tarea o el proceso finalice.

source: bg [@var{jobspec} @dots{}]
es: bg [@var{espec-tarea} @dots{}]

source: Resume each suspended job @var{jobspec} in the background, as if it had been started with @samp{&}. If @var{jobspec} is not supplied, the current job is used. The return status is zero unless it is run when job control is not enabled, or, when run with job control enabled, any @var{jobspec} was not found or specifies a job that was started without job control.
es: Reanuda cada tarea @var{espec-tarea} suspendida en segundo plano, como si hubiera sido iniciada con @samp{&}. Si no se proporciona @var{espec-tarea}, se usa la tarea actual. El estado de retorno es cero a no ser que se ejecute cuando el control de tareas no esté activado, o, cuando se ejecute con el control de tareas activado, la @var{espec-tarea} no fue encontrada o especifica una tarea que fue iniciada sin control de tareas.

source: fg [@var{jobspec}]
es: fg [@var{espec-tarea}]

source: Resume the job @var{jobspec} in the foreground and make it the current job. If @var{jobspec} is not supplied, the current job is used. The return status is that of the command placed into the foreground, or non-zero if run when job control is disabled or, when run with job control enabled, @var{jobspec} does not specify a valid job or @var{jobspec} specifies a job that was started without job control.
es: Reanuda la tarea @var{espec-tarea} en primer plano y la hace la tarea actual. Si no se proporciona @var{espec-tarea}, se usa la tarea actual. El estado de retorno es el de la instrucción ubicada en primer plano, o distinto de cero si se ejecuta cuando el control de tareas está desactivado, o, cuando el control de tareas está activado, la @var{espec-tarea} no especifica una tarea válida o @var{espec-tarea} especifica una tarea que fue iniciada sin control de tareas.

source: jobs [-lnprs] [@var{jobspec}] jobs -x @var{command} [@var{arguments}]
es: jobs [-lnprs] [@var{espec-tarea}] jobs -x @var{instrucciones} [@var{argumentos}]

source: The first form lists the active jobs. The options have the following meanings:
es: La primera forma lista las tareas activas. Las opciones tienen los siguientes significados:

source: List process @sc{id}s in addition to the normal information.
es: Lista @sc{id}s de proceso además de la información normal.

source: Display information only about jobs that have changed status since the user was last notified of their status.
es: Muestra información solo sobre tareas que han cambiado el estado desde que usuario fue notificado por última vez de su estado.

source: List only the process @sc{id} of the job's process group leader.
es: Lista solo el @sc{id} de proceso del líder de grupo de proceso de la tarea.

source: Display only running jobs.
es: Muestra solo las tareas corriendo.

source: Display only stopped jobs.
es: Muestra solo las tareas detenidas.

source: If @var{jobspec} is given, output is restricted to information about that job. If @var{jobspec} is not supplied, the status of all jobs is listed.
es: Si se pasa @var{espec-tarea}, la salida es restringida a información sobre esa tarea. Si no se proporciona @var{espec-tarea}, se lista el estado de todas las tareas.

source: If the @option{-x} option is supplied, @code{jobs} replaces any @var{jobspec} found in @var{command} or @var{arguments} with the corresponding process group @sc{id}, and executes @var{command}, passing it @var{argument}s, returning its exit status.
es: Si se proporciona la opción @option{-x}, @code{jobs} reemplaza cualquier @var{espec-tarea} encontrada en @var{instrucción} o @var{argumentos} con el @sc{id} de proceso de grupo correspondiente, y ejecuta @var{instrucción}, pasándole @var{argumento}s, devolviendo su estado de salida.

source: kill [-s @var{sigspec}] [-n @var{signum}] [-@var{sigspec}] @var{jobspec} or @var{pid} kill -l|-L [@var{exit_status}]
es: kill [-s @var{especseñ}] [-n @var{numseñ}] [-@var{especseñ}] @var{espectarea} or @var{pid} kill -l|-L [@var{estado_salida}]

source: Send a signal specified by @var{sigspec} or @var{signum} to the process named by job specification @var{jobspec} or process @sc{id} @var{pid}. @var{sigspec} is either a case-insensitive signal name such as @code{SIGINT} (with or without the @code{SIG} prefix) or a signal number; @var{signum} is a signal number. If @var{sigspec} and @var{signum} are not present, @code{SIGTERM} is used. The @option{-l} option lists the signal names. If any arguments are supplied when @option{-l} is given, the names of the signals corresponding to the arguments are listed, and the return status is zero. @var{exit_status} is a number specifying a signal number or the exit status of a process terminated by a signal. The @option{-L} option is equivalent to @option{-l}. The return status is zero if at least one signal was successfully sent, or non-zero if an error occurs or an invalid option is encountered.
es: Envía una señal especificada por @var{especseñ} o @var{numseñ} al proceso llamado por la especificación de tarea @var{jobspec} o @sc{id} de proceso @var{pid}. @var{especseñ} es o un nombre de señal independiente de mayúsculas y minúsculas como @code{SIGINT} (con o sin el prefijo @code{SIG}) o un número de señal; @var{numseñ} es un número de señal. Si no están presentes ni @var{especseñ} ni @var{numseñ}, se usa @code{SIGTERM}. La opción @option{-l} lista los nombres de señal. Si se proporcionan argumentos cuando se pasa @option{-l}, se listan los nombres de las señales correspondientes a los argumentos, y el estado de retorno es cero. @var{estado_salida} es el número que especifica un número de señal o el estado de salida de un proceso terminado por una señal. La opción @option{-L} es equivalente a @option{-l}. El estado de retorno es cero si al menos una señal fue enviada exitosamente, o distinto de cero si ocurre un error o se encuentra una opción inválida.

source: wait [-fn] [@var{jobspec} or @var{pid} @dots{}]
es: wait [-fn] [@var{espec-tarea} o @var{pid} @dots{}]

source: Wait until the child process specified by each process @sc{id} @var{pid} or job specification @var{jobspec} exits and return the exit status of the last command waited for. If a job spec is given, all processes in the job are waited for. If no arguments are given, all currently active child processes are waited for, and the return status is zero. If the @option{-n} option is supplied, @code{wait} waits for any job to terminate and returns its exit status. If the @option{-f} option is supplied, and job control is enabled, @code{wait} forces each @var{pid} or @var{jobspec} to terminate before returning its status, intead of returning when it changes status. If neither @var{jobspec} nor @var{pid} specifies an active child process of the shell, the return status is 127.
es: Espera hasta que cada proceso hijo especificado para cada @sc{id} de proceso @var{pid} o especificación de tarea @var{jobspec} finalice y devuelva el estado de salida de la última instrucción a la que esperó. Si se pasa una especificación de tarea, se esperan a todos los procesos en la tarea. Si no se pasan argumentos, se esperan a todos los procesos hijos actualmente activos, y el estado de retorno es cero. Si se proporciona la opción @option{-n}, @code{wait} espera a que cualquier tarea termine y devuelve su estado de salida. Si se proporciona la opción @option{-f} y está habilitado el control de tareas, @code{wait} fuerza a cada @var{pid} o @var{jobspec} a terminar antes de devolver su estado, en vez de retornar cuando cambia el estado. Si ni @var{jobspec} ni @var{pid} especifica un proceso hijo activo del intérprete, el estado de retorno es 127.

source: disown [-ar] [-h] [@var{jobspec} @dots{} | @var{pid} @dots{} ]
es: disown [-ar] [-h] [@var{espectarea} @dots{} | @var{pid} @dots{} ]

source: Without options, remove each @var{jobspec} from the table of active jobs. If the @option{-h} option is given, the job is not removed from the table, but is marked so that @code{SIGHUP} is not sent to the job if the shell receives a @code{SIGHUP}. If @var{jobspec} is not present, and neither the @option{-a} nor the @option{-r} option is supplied, the current job is used. If no @var{jobspec} is supplied, the @option{-a} option means to remove or mark all jobs; the @option{-r} option without a @var{jobspec} argument restricts operation to running jobs.
es: Sin opciones, elimina cada @var{espectarea} de la tabla de tareas activas. Si se pasa la opción @option{-h}, no se elimina la tarea de la tabla, pero se marca de forma que no se envíe @code{SIGHUB} a la tarea si el intérprete recibe una @code{SIGHUP}. Si no está presente @var{espectarea} y no se proporcionan ni la opción @option{-a} ni la @option{-r}, se usa la tarea actual. Si no se proporciona ninguna @var{espectarea}, la opción @option{-a} significa eliminar o marcar todas las tareas; la opción @option{-r} sin un argumento @var{espectarea} restringe la operación a tareas en ejecución.

source: Suspend the execution of this shell until it receives a @code{SIGCONT} signal. A login shell cannot be suspended; the @option{-f} option can be used to override this and force the suspension.
es: Suspende la ejecución de este intérprete hasta que recibe una señal @code{SIGCONT}. No se puede suspender un intérprete de acceso; la opción @option{-f} puede usarse para sobrescribir esto y forzar la suspensión.

source: When job control is not active, the @code{kill} and @code{wait} builtins do not accept @var{jobspec} arguments. They must be supplied process @sc{id}s.
es: Cuando no está activo el control de tareas, las instrucciones integradas @code{kill} y @code{wait} no aceptan argumentos @var{espectarea}. Deben ser @sc{id}s de procesos proporcionados.

source: This variable controls how the shell interacts with the user and job control. If this variable exists then single word simple commands without redirections are treated as candidates for resumption of an existing job. There is no ambiguity allowed; if there is more than one job beginning with the string typed, then the most recently accessed job will be selected. The name of a stopped job, in this context, is the command line used to start it. If this variable is set to the value @samp{exact}, the string supplied must match the name of a stopped job exactly; if set to @samp{substring}, the string supplied needs to match a substring of the name of a stopped job. The @samp{substring} value provides functionality analogous to the @samp{%?} job @sc{id} (@pxref{Job Control Basics}). If set to any other value, the supplied string must be a prefix of a stopped job's name; this provides functionality analogous to the @samp{%} job @sc{id}.
es: Esta variable controla cómo el intérprete interactúa con el usuario y el control de tareas. Si esta variable existe, las instrucciones simples de una palabra sin redirección son tratadas como candidatos para la reanudación de una tarea existente. No se permite ambigüedad; si hay más de una tarea que comienza por la cadena tecleada, se seleccionará la tarea más recientemente accedida. El nombre de una tarea detenida, en este contexto, es la línea de orden usada para ejecutarla. Si esta variable está establecida al valor @samp{exact}, la cadena proporcionada debe coincidir con el nombre de una tarea detenida recientemente; si establecida a @samp{substring}, la cadena proporcionada necesita coincidir con una subcadena del nombre de una tarea detenida. El valor @samp{substring} proporciona funcionalidad análoga al @sc{id} de tarea @samp{%?} (@pxref{Fundamentos del Control de Tareas}). Si está asignada con otro valor, la cadena proporcionada debe ser un prefijo de un nombre de tarea detenida; esto proporciona funcionalidad análoga al @sc{id} de tarea @samp{%}.

source: Readline, how to use
es: Readline, cómo usar

source: rluser.texi
es: rluser.es.texi

source: History, how to use
es: Historial, cómo usar

source: hsuser.texi
es: hsuser.es.texi

source: This chapter provides basic instructions for installing Bash on the various supported platforms. The distribution supports the @sc{gnu} operating systems, nearly every version of Unix, and several non-Unix systems such as BeOS and Interix. Other independent ports exist for @sc{ms-dos}, @sc{os/2}, and Windows platforms.
es: Este capítulo proporciona instrucciones básicas para instalar Bash en las distintas plataformas soportadas. La distribución soporta los sistemas operativos de @sc{gnu}, casi todas las versiones de Unix y varios sistemas no Unix como BeOS e Interix. Existen otras versiones portadas independientes para @sc{ms-dos}, @sc{os/2} y plataformas Windows.

source: Basic Installation
es: Instalación Básica

source: Installation instructions.
es: Instrucciones de instalación.

source: Compilers and Options
es: Compiladores y opciones

source: How to set special options for various systems.
es: Cómo habilitar opciones especiales para distintos sistemas.

source: Compiling For Multiple Architectures
es: Compilando para Múltiples Arquitecturas

source: How to compile Bash for more than one kind of system from the same source tree.
es: Cómo compilar Bash para más de un tipo de sistema desde el mismo árbol de fuentes.
