Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: A correctly-formed brace expansion must contain unquoted opening and closing braces, and at least one unquoted comma or a valid sequence expression. Any incorrectly formed brace expansion is left unchanged.
es: Una expansión de llaves correctamente formada debe contener llaves de apertura y de cierre sin entrecomillar, y al menos una coma sin entrecomillar o una expresión secuencial válida. Cualquier expansión de llaves formada incorrectamente se deja sin modificar.

source: A @{ or @samp{,} may be quoted with a backslash to prevent its being considered part of a brace expression. To avoid conflicts with parameter expansion, the string @samp{$@{} is not considered eligible for brace expansion, and inhibits brace expansion until the closing @samp{@}}..
es: Un @{ o @samp{,} puede ser entrecomillado con una barra invertida para evitar que sea considerado parte de la expansión de llaves. Para evitar conflictos con la expansión de parámetros, la cadena @samp{$@{} no se considera apta para la expansión de llaves e inhibe la expansión de llaves hasta el @samp{@}} de cierre.

source: This construct is typically used as shorthand when the common prefix of the strings to be generated is longer than in the above example:
es: Esta construcción se usa típicamente como atajo cuando el prefijo común de las cadenas que van a ser generadas es más largo que en el siguiente ejemplo:

source: expansion, tilde
es: expansión, virgulilla

source: If a word begins with an unquoted tilde character (@samp{~}), all of the characters up to the first unquoted slash (or all characters, if there is no unquoted slash) are considered a @var{tilde-prefix}. If none of the characters in the tilde-prefix are quoted, the characters in the tilde-prefix following the tilde are treated as a possible @var{login name}. If this login name is the null string, the tilde is replaced with the value of the @env{HOME} shell variable. If @env{HOME} is unset, the home directory of the user executing the shell is substituted instead. Otherwise, the tilde-prefix is replaced with the home directory associated with the specified login name.
es: Si una palabra comienza por un carácter de virgulilla sin entrecomillar (@samp{~}), todos los caracteres hasta la primera barra sin entrecomillar (o todos los caracteres, si no hay barra sin entrecomillar) son considerados un @var{prefijo de virgulilla}. Si ninguno de los caracteres en el prefijo de virgulilla está entrecomillado, los caracteres en el prefijo de virgulilla que siguen a la virgulilla son tratados como un posible @var{nombre de acceso}. Si este nombre de acceso es la cadena nula, la virgulilla se reemplaza por el valor de la variable @env{HOME} del intérprete. Si @env{HOME} no está establecida, se sustituye el directorio personal del usuario ejecutando el intérprete en su lugar. De lo contrario, se reemplaza el prefijo de virgulilla por el directorio personal asociado con el nombre de acceso especificado.

source: If the tilde-prefix is @samp{~+}, the value of the shell variable @env{PWD} replaces the tilde-prefix. If the tilde-prefix is @samp{~-}, the value of the shell variable @env{OLDPWD}, if it is set, is substituted.
es: Si el prefijo de virgulilla es @samp{~+}, el valor de la variable del intérprete @env{PWD} reemplaza el prefijo de virgulilla. Si el prefijo de virgulilla es @samp{~-}, se sustituye el valor de la variable @env{OLDPWD}, si está establecida.

source: If the characters following the tilde in the tilde-prefix consist of a number @var{N}, optionally prefixed by a @samp{+} or a @samp{-}, the tilde-prefix is replaced with the corresponding element from the directory stack, as it would be displayed by the @code{dirs} builtin invoked with the characters following tilde in the tilde-prefix as an argument (@pxref{The Directory Stack}). If the tilde-prefix, sans the tilde, consists of a number without a leading @samp{+} or @samp{-}, @samp{+} is assumed.
es: Si los caracteres que siguen la virgulilla en el prefijo de virgulilla constan de un número @var{N}, opcionalmente prefijado por un @samp{+} o un @samp{-}, la expansión de virgulilla se reemplaza por el elemento correspondiente de la pila de directorios, como se mostraría por la instrucción integrada @code{dirs} llamada con los caracteres que siguen a la virgulilla en el prefijo de virgulilla como un argumento (@pxref{La Pila de Directorios}). Si el prefijo de virgulilla, sin la virgulilla, consta de un número sin un @samp{+} o @samp{-} inicial, se asume @samp{+}.

source: If the login name is invalid, or the tilde expansion fails, the word is left unchanged.
es: Si el nombre de acceso es inválido, o la expansión de virgulilla falla, la palabra se deja sin modificar.

source: Each variable assignment is checked for unquoted tilde-prefixes immediately following a @samp{:} or the first @samp{=}. In these cases, tilde expansion is also performed. Consequently, one may use filenames with tildes in assignments to @env{PATH}, @env{MAILPATH}, and @env{CDPATH}, and the shell assigns the expanded value.
es: Cada asignación de variable se revisa en busca de prefijos de virgulilla sin entrecomillar que inmediatamente sigan a un @samp{:} o al primer @samp{=}. En estos casos, también es realizada la expansión de virgulilla. Consecuentemente, uno puede usar nombres de archivo con virgulillas en asignaciones a @env{PATH}, @env{MAILPATH} y @env{CDPATH}, y el intérprete asigna el valor expandido.

source: The following table shows how Bash treats unquoted tilde-prefixes:
es: La siguiente tabla muestra cómo trata Bash los prefijos de virgulilla sin entrecomillar:

source: The value of @code{$HOME}
es: El valor de @code{$HOME}

source: The subdirectory @code{foo} of the home directory of the user @code{fred}
es: El subdirectorio @code{foo} del directorio personal del usuario @code{fred}

source: The string that would be displayed by @samp{dirs +@var{N}}
es: La cadena que sería mostrada por @samp{dirs +@var{N}}

source: The string that would be displayed by @samp{dirs -@var{N}}
es: La cadena que sería mostrada por @samp{dirs -@var{N}}

source: Bash also performs tilde expansion on words satisfying the conditions of variable assignments (@pxref{Shell Parameters}) when they appear as arguments to simple commands. Bash does not do this, except for the @var{declaration} commands listed above, when in @sc{posix} mode.
es: Bash también realiza la expansión de virgulilla en palabras que satisfacen las condiciones de asignación de variables (@pxref{Parámetros del Intérprete}) cuando aparecen como argumentos de instrucciones simples. Bash no hace esto, aparte de para las instrucciones de @var{declaración} listadas arriaba, en el modo @sc{posix}

source: parameter expansion
es: expansión de parámetros

source: expansion, parameter
es: expansión, parámetro

source: The @samp{$} character introduces parameter expansion, command substitution, or arithmetic expansion. The parameter name or symbol to be expanded may be enclosed in braces, which are optional but serve to protect the variable to be expanded from characters immediately following it which could be interpreted as part of the name.
es: El carácter @samp{$} introduce la expansión de parámetros, sustitución de instrucciones o expansión aritmética. El nombre o símbolo del parámetro para ser expandido se puede encerrar en llaves, que son opcionales pero sirven para evitar que la variable se expanda de caracteres que inmediatamente lo siguen que podrían ser interpretados como parte del nombre.

source: When braces are used, the matching ending brace is the first @samp{@}} not escaped by a backslash or within a quoted string, and not within an embedded arithmetic expansion, command substitution, or parameter expansion.
es: Cuando se usan llaves, la llave de cierre coincidente es el primer @samp{@}} no escapado por una barra invertida o dentro de una cadena entrecomillada, y no dentro de una expresión aritmética, sustitución de instrucción o expansión de parámetro incrustadas.

source: The basic form of parameter expansion is $@{@var{parameter}@}. The value of @var{parameter} is substituted. The @var{parameter} is a shell parameter as described above (@pxref{Shell Parameters}) or an array reference (@pxref{Arrays}). The braces are required when @var{parameter} is a positional parameter with more than one digit, or when @var{parameter} is followed by a character that is not to be interpreted as part of its name.
es: La forma básica de expansión de parámetros es $@{@var{parámetro}@}. El valor de @var{parámetro} es sustituido. El @var{parámetro} es un parámetro del intérprete como se describe arriba (@pxref{Parámetros del Intérprete}) o una referencia de vector (@pxref{Vectores}). Las llaves son requeridas cuando @var{parámetro} es un parámetro posicional con más de un dígito, o cuando @var{parámetro} es seguido por un carácter que no está pensado para ser interpretado como parte de su nombre.

source: If the first character of @var{parameter} is an exclamation point (!), and @var{parameter} is not a @var{nameref}, it introduces a level of indirection. Bash uses the value formed by expanding the rest of @var{parameter} as the new @var{parameter}; this is then expanded and that value is used in the rest of the expansion, rather than the expansion of the original @var{parameter}. This is known as @code{indirect expansion}. The value is subject to tilde expansion, parameter expansion, command substitution, and arithmetic expansion. If @var{parameter} is a nameref, this expands to the name of the variable referenced by @var{parameter} instead of performing the complete indirect expansion. The exceptions to this are the expansions of $@{!@var{prefix}*@} and $@{!@var{name}[@@]@} described below. The exclamation point must immediately follow the left brace in order to introduce indirection.
es: Si el primer carácter de @var{parámetro} es un signo de exclamación (!) y @var{parámetro} no es un @var{nameref}, introduce un nivel de indirección. Bash usa el valor formado al expandir el resto de @var{parámetro} como el nuevo @var{parámetro}; este es luego expandido y ese valor se usa en el resto de la expansión, en vez de la expansión del @var{parámetro} original. Esto se conoce como @code{expansión indirecta}. El valor está sujeto a la expansión de virgulilla, la expansión de parámetros, la sustitución de instrucciones y la expansión aritmética. Si @var{parámetro} es un nameref, esto se expande al nombre de la variable referenciada por @var{parámetro} en vez de realizar la expansión indirecta completa. Las excepciones a esto son las expansiones de $@{!@var{prefijo}*@} y $@{!@var{nombre}[@@]@} descritas abajo. El signo de exclamación debe seguir inmediatamente a la llave izquierda para introducir la indirección.

source: In each of the cases below, @var{word} is subject to tilde expansion, parameter expansion, command substitution, and arithmetic expansion.
es: En todos los siguientes casos, @var{palabra} está sujeta a la expansión de virgulilla, expansión de parámetro, sustitución de instrucción y expansión aritmética.

source: When not performing substring expansion, using the form described below (e.g., @samp{:-}), Bash tests for a parameter that is unset or null. Omitting the colon results in a test only for a parameter that is unset. Put another way, if the colon is included, the operator tests for both @var{parameter}'s existence and that its value is not null; if the colon is omitted, the operator tests only for existence.
es: Cuando no se realiza la expansión de subcadena, usando la forma descrita abajo (p. ej., @samp{:-}), Bash comprueba por un parámetro que sea nulo o no esté establecido. Omitir los dos puntos resulta en una prueba solo para un parámetro que no esté establecido. Dicho de otra manera, si se incluyen los dos puntos, el operador comprueba la existencia de @var{parámetro} y que su valor no sea nulo; si se omiten los dos puntos, el operador solo comprueba su existencia.

source: $@{@var{parameter}:@minus{}@var{word}@}
es: $@{@var{parámetro}:@minus{}@var{palabra}@}

source: If @var{parameter} is unset or null, the expansion of @var{word} is substituted. Otherwise, the value of @var{parameter} is substituted.
es: Si @var{parámetro} no está establecido o es nulo, se sustituye por la expansión de @var{palabra}. De lo contrario, se sustituye por el valor de @var{parámetro}.

source: $@{@var{parameter}:=@var{word}@}
es: $@{@var{parámetro}:=@var{palabra}@}

source: If @var{parameter} is unset or null, the expansion of @var{word} is assigned to @var{parameter}. The value of @var{parameter} is then substituted. Positional parameters and special parameters may not be assigned to in this way.
es: Si @var{parámetro} no está establecido o es nulo, se asigna la expansión de @var{palabra} a @var{parámetro}. Se sustituye entonces el valor de @var{parámetro}. A los parámetros posicionales y parámetros especiales no se les puede asignar de esta manera.

source: $@{@var{parameter}:?@var{word}@}
es: $@{@var{parámetro}:?@var{palabra}@}

source: If @var{parameter} is null or unset, the expansion of @var{word} (or a message to that effect if @var{word} is not present) is written to the standard error and the shell, if it is not interactive, exits. Otherwise, the value of @var{parameter} is substituted.
es: Si @var{parámetro} no está establecido o es nulo, la expansión de @var{palabra} (o un mensaje al respecto si @var{palabra} no está presente) es escrita al error estándar, y el intérprete, si no es interactivo, se cierra. De lo contrario, se sustituye el valor de @var{parámetro}.

source: $@{@var{parameter}:+@var{word}@}
es: $@{@var{parámetro}:+@var{palabra}@}

source: If @var{parameter} is null or unset, nothing is substituted, otherwise the expansion of @var{word} is substituted.
es: Si @var{parámetro} es nulo o no está establecido, no se sustituye por nada; de lo contrario, se sustituye por la expansión de @var{palabra}.

source: $@{@var{parameter}:@var{offset}@}
es: $@{@var{parámetro}:@var{desplazamiento}@}

source: $@{@var{parameter}:@var{offset}:@var{length}@}
es: $@{@var{parámetro}:@var{desplazamiento}:@var{longitud}@}

source: This is referred to as Substring Expansion. It expands to up to @var{length} characters of the value of @var{parameter} starting at the character specified by @var{offset}. If @var{parameter} is @samp{@@}, an indexed array subscripted by @samp{@@} or @samp{*}, or an associative array name, the results differ as described below. If @var{length} is omitted, it expands to the substring of the value of @var{parameter} starting at the character specified by @var{offset} and extending to the end of the value. @var{length} and @var{offset} are arithmetic expressions (@pxref{Shell Arithmetic}).
es: Esto se conoce como Expansión de Subcadena. Se expande hasta @var{longitud} carácteres del valor de @var{parámetro} empezando por el carácter especificado por @var{desplazamiento}. Si @var{parámetro} es @samp{@@}, un vector indexado subindexado por @samp{@@} o @samp{*} o un nombre de vector asociativo, los resultados difieren como se describe más abajo. Si se omite @var{longitud}, se expande a la subcadena del valor de @var{parámetro} empezando en el carácter especificado por @var{desplazamiento} y extendiéndose hasta el final del valor. @var{longitud} y @var{desplazamiento} son expresiones aritméticas (@pxref{Aritmética del Intérprete}).

source: If @var{offset} evaluates to a number less than zero, the value is used as an offset in characters from the end of the value of @var{parameter}. If @var{length} evaluates to a number less than zero, it is interpreted as an offset in characters from the end of the value of @var{parameter} rather than a number of characters, and the expansion is the characters between @var{offset} and that result. Note that a negative offset must be separated from the colon by at least one space to avoid being confused with the @samp{:-} expansion.
es: Si @var{desplazamiento} se evalúa a un número menor que cero, el valor se usa como un desplazamiento en caracteres desde el final del valor de @var{parámetro}. Si @var{longitud} se evalúa a un número menor que cero, se interpreta como un desplazamiento en caracteres desde el final del valor de @var{parámetro} en vez de un número de caracteres, y la expansión equivale a los caracteres entre @var{desplazamiento} y ese resultado. Observe que un desplazamiento negativo debe ser separado de los dos puntos por al menos un espacio para evitar confusión con la expansión @samp{:-}.

source: Here are some examples illustrating substring expansion on parameters and subscripted arrays:
es: Aquí hay algunos ejemplos que ilustran la expansión de subcadenas en parámetros y vectores subindexados:

source: $ string=01234567890abcdefgh $ echo ${string:7} 7890abcdefgh $ echo ${string:7:0}
es: $ cadena=01234567890abcdefgh $ echo ${cadena:7} 7890abcdefgh $ echo ${cadena:7:0}

source: $ echo ${string:7:2} 78 $ echo ${string:7:-2} 7890abcdef $ echo ${string: -7} bcdefgh $ echo ${string: -7:0}
es: $ echo ${cadena:7:2} 78 $ echo ${cadena:7:-2} 7890abcdef $ echo ${cadena: -7} bcdefgh $ echo ${cadena: -7:0}

source: $ echo ${string: -7:2} bc $ echo ${string: -7:-2} bcdef $ set -- 01234567890abcdefgh $ echo ${1:7} 7890abcdefgh $ echo ${1:7:0}
es: $ echo ${cadena: -7:2} bc $ echo ${cadena: -7:-2} bcdef $ set -- 01234567890abcdefgh $ echo ${1:7} 7890abcdefgh $ echo ${1:7:0}

source: $ echo ${1: -7:2} bc $ echo ${1: -7:-2} bcdef $ array[0]=01234567890abcdefgh $ echo ${array[0]:7} 7890abcdefgh $ echo ${array[0]:7:0}
es: $ echo ${1: -7:2} bc $ echo ${1: -7:-2} bcdef $ vector[0]=01234567890abcdefgh $ echo ${vector[0]:7} 7890abcdefgh $ echo ${vector[0]:7:0}

source: $ echo ${array[0]:7:2} 78 $ echo ${array[0]:7:-2} 7890abcdef $ echo ${array[0]: -7} bcdefgh $ echo ${array[0]: -7:0}
es: $ echo ${vector[0]:7:2} 78 $ echo ${vector[0]:7:-2} 7890abcdef $ echo ${vector[0]: -7} bcdefgh $ echo ${vector[0]: -7:0}

source: $ echo ${array[0]: -7:2} bc $ echo ${array[0]: -7:-2} bcdef
es: $ echo ${vector[0]: -7:2} bc $ echo ${vector[0]: -7:-2} bcdef

source: If @var{parameter} is @samp{@@}, the result is @var{length} positional parameters beginning at @var{offset}. A negative @var{offset} is taken relative to one greater than the greatest positional parameter, so an offset of -1 evaluates to the last positional parameter. It is an expansion error if @var{length} evaluates to a number less than zero.
es: Si @var{parámetro} es @samp{@@}, el resultado es @var{longitud} parámetros posicionales comenzando por @var{desplazamiento}. Un @var{desplazamiento} se toma en relación a uno mayor que el parámetro posicional más grande, de manera que un desplazamiento de -1 evalúa al último parámetro posicional. Es un error de expansión si @var{longitud} evalúa a un número menor que cero.

source: The following examples illustrate substring expansion using positional parameters:
es: Los siguientes ejemplos ilustran la expansión de subcadenas usando parámetros posicionales:

source: $ echo ${@:7:2} 7 8 $ echo ${@:7:-2} bash: -2: substring expression < 0 $ echo ${@: -7:2} b c $ echo ${@:0} ./bash 1 2 3 4 5 6 7 8 9 0 a b c d e f g h $ echo ${@:0:2} ./bash 1 $ echo ${@: -7:0}
es: $ echo ${@:7:2} 7 8 $ echo ${@:7:-2} bash: -2: expresión de subcadena < 0 $ echo ${@: -7:2} b c $ echo ${@:0} ./bash 1 2 3 4 5 6 7 8 9 0 a b c d e f g h $ echo ${@:0:2} ./bash 1 $ echo ${@: -7:0}

source: If @var{parameter} is an indexed array name subscripted by @samp{@@} or @samp{*}, the result is the @var{length} members of the array beginning with @code{$@{@var{parameter}[@var{offset}]@}}. A negative @var{offset} is taken relative to one greater than the maximum index of the specified array. It is an expansion error if @var{length} evaluates to a number less than zero.
es: Si @var{parámetro} es un nombre de vector subindexado por @samp{@@} o @samp{*}, el resultado es la @var{longitud} de miembros del vector que comienzan por @code{$@{@var{parámetro}[@var{desplazamiento}]@}}. Un @var{desplazamiento} negativo se toma respecto a uno mayor que el máximo índice del vector especificado. Es un error de expansión si @var{longitud} evalúa a un número menor que cero.

source: These examples show how you can use substring expansion with indexed arrays:
es: Estos ejemplos muestran cómo puede usar la expansión de subcadenas con vectores indexados:

source: $ array=(0 1 2 3 4 5 6 7 8 9 0 a b c d e f g h) $ echo ${array[@]:7} 7 8 9 0 a b c d e f g h $ echo ${array[@]:7:2} 7 8 $ echo ${array[@]: -7:2} b c $ echo ${array[@]: -7:-2} bash: -2: substring expression < 0 $ echo ${array[@]:0} 0 1 2 3 4 5 6 7 8 9 0 a b c d e f g h $ echo ${array[@]:0:2} 0 1 $ echo ${array[@]: -7:0}
es: $ vector=(0 1 2 3 4 5 6 7 8 9 0 a b c d e f g h) $ echo ${vector[@]:7} 7 8 9 0 a b c d e f g h $ echo ${vector[@]:7:2} 7 8 $ echo ${vector[@]: -7:2} b c $ echo ${vector[@]: -7:-2} bash: -2: expresión de subcadena < 0 $ echo ${vector[@]:0} 0 1 2 3 4 5 6 7 8 9 0 a b c d e f g h $ echo ${vector[@]:0:2} 0 1 $ echo ${vector[@]: -7:0}

source: Substring expansion applied to an associative array produces undefined results.
es: La expansión de subcadena aplicada a un vector asociativo produce resultados inesperados.

source: Substring indexing is zero-based unless the positional parameters are used, in which case the indexing starts at 1 by default. If @var{offset} is 0, and the positional parameters are used, @code{$@@} is prefixed to the list.
es: La indexación de subcadenas es a partir del cero a no ser que se usen los parámetros posicionales, en cuyo caso la indexación comienza en 1 por defecto. Si @var{desplazamiento} es 0 y se usan los parámetros posicionales, se prefija @code{$@@} a la lista.

source: $@{!@var{prefix}*@}
es: $@{!@var{prefijo}*@}

source: $@{!@var{prefix}@@@}
es: $@{!@var{prefijo}@@@}

source: Expands to the names of variables whose names begin with @var{prefix}, separated by the first character of the @env{IFS} special variable. When @samp{@@} is used and the expansion appears within double quotes, each variable name expands to a separate word.
es: Se expande a los nombres de variables cuyos nombres empiezan por @var{prefijo}, separados por el primer carácter de la variable especial @env{IFS}. Cuando se usa @samp{@@} y la expansión aparece entre comillas dobles, cada nombre de variable se expande a una palabra separada.

source: $@{!@var{name}[@@]@}
es: $@{!@var{nombre}[@@]@}

source: $@{!@var{name}[*]@}
es: $@{!@var{nombre}[*]@}

source: If @var{name} is an array variable, expands to the list of array indices (keys) assigned in @var{name}. If @var{name} is not an array, expands to 0 if @var{name} is set and null otherwise. When @samp{@@} is used and the expansion appears within double quotes, each key expands to a separate word.
es: Si @var{nombre} es una variable de vector, se expande a la lista de indices de vectores (claves) asignada en @var{nombre}. Si @var{nombre} no es un vector, se expande a 0 si @var{nombre} está establecido y a nulo en caso contrario. Cuando se usa @samp{@@} y la expansión aparece entre comillas dobles, cada clave se expande a una palabra separada.

source: $@{#@var{parameter}@}
es: $@{#@var{parámetro}@}
