Repository: davidam/bashrefes
Catalog: bashref.*.po
Languages: es

source: If the redirection operator is @samp{>}, and the @code{noclobber} option to the @code{set} builtin has been enabled, the redirection will fail if the file whose name results from the expansion of @var{word} exists and is a regular file. If the redirection operator is @samp{>|}, or the redirection operator is @samp{>} and the @code{noclobber} option is not enabled, the redirection is attempted even if the file named by @var{word} exists.
es: Si el operador de redirección es @samp{>} y la opción @code{noclobber} de la instrucción integrada @code{set} ha sido habilitada, la redirección fallará si el archivo cuyo nombre deriva de la expansión de @var{palabra} existe y es un archivo normal. Si el operador de redirección es @samp{>|} o si el operador de redirección es @samp{>} y no está habilitada la opción @code{noclobber}, la redirección se intenta incluso si el archivo nombrado por @var{palabra} existe.

source: Appending Redirected Output
es: Añadiendo Salida Redirigida

source: Redirection of output in this fashion causes the file whose name results from the expansion of @var{word} to be opened for appending on file descriptor @var{n}, or the standard output (file descriptor 1) if @var{n} is not specified. If the file does not exist it is created.
es: La redirección de salida de esta manera hace que el archivo cuyo nombre deriva de la expansión de @var{palabra} sea abierto para añadir en el descriptor de archivo @var{n}, o la salida estándar (descriptor de archivo 1), si no se especifica @var{n}. Si el archivo no existe, se crea.

source: The general format for appending output is:
es: El formato general para añadir una salida es:

source: [@var{n}]>>@var{word}
es: [@var{n}]>>@var{palabra}

source: Redirecting Standard Output and Standard Error
es: Redirigiendo Error Estándar y Salida Estándar

source: This construct allows both the standard output (file descriptor 1) and the standard error output (file descriptor 2) to be redirected to the file whose name is the expansion of @var{word}.
es: Esta construcción permite que sean redirigidas tanto la salida estándar (descriptor de archivo 1) como la salida de error estándar (descriptor de archivo 2) al archivo cuyo nombre es la expansión de @var{palabra}.

source: There are two formats for redirecting standard output and standard error:
es: Hay dos formatos para redirigir error estándar y salida estándar:

source: &>@var{word}
es: &>@var{palabra}

source: and
es: y

source: >&@var{word}
es: >&@var{palabra}

source: Of the two forms, the first is preferred. This is semantically equivalent to
es: De las dos formas, se prefiere la primera. Esto es equivalente semánticamente a

source: >@var{word} 2>&1
es: >@var{palabra} 2>&1

source: When using the second form, @var{word} may not expand to a number or @samp{-}. If it does, other redirection operators apply (see Duplicating File Descriptors below) for compatibility reasons.
es: Al usar la segunda forma, puede que la @var{palabra} no se expanda a un número o a @samp{-}. Si lo hace, se aplican otros operadores de redirección (véase Duplicando Descriptores de Archivo abajo) por razones de compatibilidad.

source: Appending Standard Output and Standard Error
es: Añadiendo la Salida Estándar y el Error Estándar

source: This construct allows both the standard output (file descriptor 1) and the standard error output (file descriptor 2) to be appended to the file whose name is the expansion of @var{word}.
es: Esta construcción permite que sean añadidas tanto la salida estándar (descriptor de archivo 1) como la salida de error estándar (descriptor de archivo 2) al archivo cuyo nombre es la expansión de @var{palabra}.

source: The format for appending standard output and standard error is:
es: El formato para añadir la salida estándar y el error estándar es:

source: &>>@var{word}
es: &>>@var{palabra}

source: This is semantically equivalent to
es: Esto es equivalente semánticamente a

source: >>@var{word} 2>&1
es: >>@var{palabra} 2>&1

source: (see Duplicating File Descriptors below).
es: (véase Duplicando Descriptores de Archivo abajo).

source: Here Documents
es: Documentos Aquí

source: This type of redirection instructs the shell to read input from the current source until a line containing only @var{word} (with no trailing blanks) is seen. All of the lines read up to that point are then used as the standard input (or file descriptor @var{n} if @var{n} is specified) for a command.
es: Este tipo de redirección le ordena al intérprete leer la entrada de la fuente actual hasta que se encuentra una línea que contiene solo @var{palabra} (sin blancos al final). Todas las líneas leídas hasta ese punto son entonces usadas como la entrada estándar (o descriptor de archivo @var{n} si se especifica @var{n}) para una instrucción.

source: The format of here-documents is:
es: El formato del documento-aquí es:

source: [@var{n}]<<[@minus{}]@var{word} @var{here-document} @var{delimiter}
es: [@var{n}]<<[@minus{}]@var{palabra} @var{documento-aquí} @var{delimitador}

source: No parameter and variable expansion, command substitution, arithmetic expansion, or filename expansion is performed on @var{word}. If any part of @var{word} is quoted, the @var{delimiter} is the result of quote removal on @var{word}, and the lines in the here-document are not expanded. If @var{word} is unquoted, all lines of the here-document are subjected to parameter expansion, command substitution, and arithmetic expansion, the character sequence @code{\newline} is ignored, and @samp{\} must be used to quote the characters @samp{\}, @samp{$}, and @samp{`}.
es: No se realiza expansión de parámetro y variable, sustitución de instrucción, expansión aritmética ni expansión de nombre de archivo en @var{palabra}. Si se entrecomilla alguna parte de @var{palabra} el @var{delimitador} es el resultado de la eliminación de comillas en @var{palabra}, y no se expanden las líneas en el documento-aquí. Si @var{palabra} no está entrecomillada, todas las líneas del documento aquí están sujetas a la expansión de parámetro, sustitución de instrucción y expansión aritmética, se ignora la secuencia de caracteres @code{\nueva línea} y @samp{/} se debe usar para mencionar los caracteres @samp{\}, @samp{$} y @samp{`}.

source: If the redirection operator is @samp{<<-}, then all leading tab characters are stripped from input lines and the line containing @var{delimiter}. This allows here-documents within shell scripts to be indented in a natural fashion.
es: Si el operador de redirección es @samp{<<-}, todos los caracteres de tabulación iniciales son eliminados de las líneas de entrada y la línea que contiene @var{delimitador}. Esto permite indentar documentos-aquí en guiones de forma natural.

source: Here Strings
es: Cadenas Aquí

source: A variant of here documents, the format is:
es: Una variante de documentos aquí, el formato es:

source: [@var{n}]<<< @var{word}
es: [@var{n}]<<< @var{palabra}

source: The @var{word} undergoes tilde expansion, parameter and variable expansion, command substitution, arithmetic expansion, and quote removal. Pathname expansion and word splitting are not performed. The result is supplied as a single string, with a newline appended, to the command on its standard input (or file descriptor @var{n} if @var{n} is specified).
es: La @var{palabra} experimenta la expansión de virgulilla, expansión de parámetro y variable, sustitución de instrucción, expansión aritmética y eliminación de comillas. No se realizan la expansión de nombre de ruta ni la división de palabras. El resultado es proporcionado como una cadena única, con una nueva línea añadida, a la instrucción en su entrada estándar (o descriptor de archivo @var{n} si se especifica).

source: Duplicating File Descriptors
es: Duplicando Descriptores de Archivo

source: The redirection operator
es: El operador de redirección

source: [@var{n}]<&@var{word}
es: [@var{n}]<&@var{palabra}

source: is used to duplicate input file descriptors. If @var{word} expands to one or more digits, the file descriptor denoted by @var{n} is made to be a copy of that file descriptor. If the digits in @var{word} do not specify a file descriptor open for input, a redirection error occurs. If @var{word} evaluates to @samp{-}, file descriptor @var{n} is closed. If @var{n} is not specified, the standard input (file descriptor 0) is used.
es: se usa para duplicar descriptores de archivo de entrada. Si @var{palabra} se expande a uno o más dígitos, el descriptor de archivo denotado por @var{n} se vuelve una copia de ese descriptor de archivo. Si los dígitos en @var{palabra} no especifican un descriptor de archivo abierto para entrada, ocurre un error de redirección. Si @var{palabra} se evalúa a @samp{-}, se cierra el descriptor de archivo @var{n}. Si no se especifica @var{n}, se usa la entrada estándar (descriptor de archivo 0).

source: The operator
es: El operador

source: [@var{n}]>&@var{word}
es: [@var{n}]>&@var{palabra}

source: is used similarly to duplicate output file descriptors. If @var{n} is not specified, the standard output (file descriptor 1) is used. If the digits in @var{word} do not specify a file descriptor open for output, a redirection error occurs. If @var{word} evaluates to @samp{-}, file descriptor @var{n} is closed. As a special case, if @var{n} is omitted, and @var{word} does not expand to one or more digits or @samp{-}, the standard output and standard error are redirected as described previously.
es: se usa de forma parecida para duplicar la salida de descriptores de archivo. Si no se especifica @var{n}, se usa la salida estándar (descriptor de archivo 1). Si los dígitos en @var{palabra} no especifican un descriptor de archivo abierto para salida, ocurre un error de redirección. Si @var{palabra} se evalúa a @samp{-}, se cierra el descriptor de archivo @var{n}. Como caso especial, si se omite @var{n} y @var{palabra} no se expande a uno o más dígitos o @samp{-}, la salida estándar y el error estándar son redirigidos como se describió anteriormente.

source: Moving File Descriptors
es: Moviendo Descriptores de Archivo

source: [@var{n}]<&@var{digit}-
es: [@var{n}]<&@var{dígito}-

source: moves the file descriptor @var{digit} to file descriptor @var{n}, or the standard input (file descriptor 0) if @var{n} is not specified. @var{digit} is closed after being duplicated to @var{n}.
es: mueve el descriptor de archivo @var{dígito} al descriptor de archivo @var{n}, o a la entrada estándar (descriptor de archivo 0) si no se especifica @var{n}. @var{dígito} se cierra tras ser duplicado a @var{n}.

source: Similarly, the redirection operator
es: De forma similar, el operador de redirección

source: [@var{n}]>&@var{digit}-
es: [@var{n}]>&@var{dígito}-

source: moves the file descriptor @var{digit} to file descriptor @var{n}, or the standard output (file descriptor 1) if @var{n} is not specified.
es: mueve el descriptor de archivo @var{dígito} al descriptor de archivo @var{n}, o a la salida estándar (descriptor de archivo 1) si no se especifica @var{n}.

source: Opening File Descriptors for Reading and Writing
es: Abriendo Descriptores de Archivo para Leer y Escribir

source: [@var{n}]<>@var{word}
es: [@var{n}]<>@var{palabra}

source: causes the file whose name is the expansion of @var{word} to be opened for both reading and writing on file descriptor @var{n}, or on file descriptor 0 if @var{n} is not specified. If the file does not exist, it is created.
es: hace que el archivo cuyo nombre es la expansión de @var{palabra} sea abierto tanto para leer como para escribir en el descriptor de archivo @var{n} o en el descriptor de archivo 0 si no se especifica @var{n}. Si el archivo no existe, se crea.

source: Simple Command Expansion
es: Expansión de Instrucciones Simples

source: How Bash expands simple commands before executing them.
es: Cómo expande Bash las instrucciones simples antes de ejecutarlas.

source: Command Search and Execution
es: Búsqueda y Ejecución de Instrucciones

source: How Bash finds commands and runs them.
es: Cómo Bash busca instrucciones y las ejecuta.

source: Command Execution Environment
es: Entorno de Ejecución de Instrucciones

source: The environment in which Bash executes commands that are not shell builtins.
es: El entorno en que Bash ejecuta instrucciones que no son instrucciones integradas del intérprete.

source: Environment
es: Entorno

source: The environment given to a command.
es: El entorno dado a una instrucción.

source: Exit Status
es: Estado de Salida

source: The status returned by commands and how Bash interprets it.
es: El estado devuelto por instrucciones y cómo Bash lo interpreta.

source: Signals
es: Señales

source: What happens when Bash or a command it runs receives a signal.
es: Qué pasa cuando Bash o una instrucción que ejecuta recibe una señal.

source: command expansion
es: expansión de instrucciones

source: When a simple command is executed, the shell performs the following expansions, assignments, and redirections, from left to right.
es: Cuando se ejecuta una instrucción simple, el intérprete realiza las siguientes expansiones, asignaciones y redirecciones, de izquierda a derecha.

source: The words that the parser has marked as variable assignments (those preceding the command name) and redirections are saved for later processing.
es: Las palabras que el analizador ha marcado como asignaciones de variables (aquellas que preceden al nombre de la instrucción) y redirecciones se guardan para su tratamiento posterior.

source: The words that are not variable assignments or redirections are expanded (@pxref{Shell Expansions}). If any words remain after expansion, the first word is taken to be the name of the command and the remaining words are the arguments.
es: Las palabras que no son asignaciones de variable o redirecciones son expandidas (@pxref{Expansiones del Intérprete}). Si alguna palabra permanece tras la expansión, la primera palabra se toma como el nombre de la instrucción y las demás palabras son los argumentos.

source: Redirections are performed as described above (@pxref{Redirections}).
es: Las redirecciones se realizan como se describió anteriormente (@pxref{Redirecciones}).

source: The text after the @samp{=} in each variable assignment undergoes tilde expansion, parameter expansion, command substitution, arithmetic expansion, and quote removal before being assigned to the variable.
es: El texto después del @samp{=} en cada asignación de variable experimenta la expansión de virgulilla, expansión de parámetro, sustitución de instrucciones, expansión aritmética y eliminación de comillas antes de ser asignado a una variable.

source: If no command name results, the variable assignments affect the current shell environment. Otherwise, the variables are added to the environment of the executed command and do not affect the current shell environment. If any of the assignments attempts to assign a value to a readonly variable, an error occurs, and the command exits with a non-zero status.
es: Si no se produce un nombre de instrucción, las asignaciones de variables afectan al entorno actual del intérprete. De lo contrario, las variables son añadidas al entorno de la instrucción ejecutada y no afectan al entorno del intérprete actual. Si cualquiera de las asignaciones intenta asignar un valor a una variable de solo lectura, ocurre un error y la instrucción sale con un estado de error distinto a cero.

source: If no command name results, redirections are performed, but do not affect the current shell environment. A redirection error causes the command to exit with a non-zero status.
es: Si no se produce un nombre de instrucción, se realizan redirecciones, pero no afectan al entorno actual del intérprete. Un error de redirección hace que la instrucción se cierre con un estado distinto de cero.

source: If there is a command name left after expansion, execution proceeds as described below. Otherwise, the command exits. If one of the expansions contained a command substitution, the exit status of the command is the exit status of the last command substitution performed. If there were no command substitutions, the command exits with a status of zero.
es: Si hay un nombre de instrucción sobrante después de la expansión, la ejecución procede como se describe más adelante. De lo contrario, la instrucción finaliza. Si una de las expansiones contenía una sustitución de instrucción, el estado de salida de la instrucción es el estado de salida de la última sustitución de instrucción realizada. Si no había ninguna sustitución, la instrucción finaliza con un estado de cero.

source: command execution
es: ejecución de instrucciones

source: command search
es: búsqueda de instrucciones

source: After a command has been split into words, if it results in a simple command and an optional list of arguments, the following actions are taken.
es: Después de que una instrucción haya sido dividida en palabras, si resulta en una instrucción simple y una lista opcional de argumentos, se toman las siguientes acciones.

source: If the command name contains no slashes, the shell attempts to locate it. If there exists a shell function by that name, that function is invoked as described in @ref{Shell Functions}.
es: Si el nombre de la instrucción no contiene barras, el intérprete trata de localizarla. Si existe una función del intérprete con ese nombre, esa función se llama como se describe en @ref{Funciones del Intérprete}.

source: If the name does not match a function, the shell searches for it in the list of shell builtins. If a match is found, that builtin is invoked.
es: Si el nombre no coincide con una función, el intérprete lo busca en la lista de instrucciones integradas del intérprete. Si se encuentra una coincidencia, se llama a esa instrucción integrada.

source: If the name is neither a shell function nor a builtin, and contains no slashes, Bash searches each element of @env{$PATH} for a directory containing an executable file by that name. Bash uses a hash table to remember the full pathnames of executable files to avoid multiple @env{PATH} searches (see the description of @code{hash} in @ref{Bourne Shell Builtins}). A full search of the directories in @env{$PATH} is performed only if the command is not found in the hash table. If the search is unsuccessful, the shell searches for a defined shell function named @code{command_not_found_handle}. If that function exists, it is invoked in a separate execution environment with the original command and the original command's arguments as its arguments, and the function's exit status becomes the exit status of that subshell. If that function is not defined, the shell prints an error message and returns an exit status of 127.
es: Si el nombre no es ni una función del intérprete ni una instrucción integrada y no contiene barras, Bash busca un directorio que contenga un archivo ejecutable con ese nombre en cada elemento de @env{$PATH}. Bash usa una tabla hash para recordar los nombres de ruta completos de archivos ejecutables para evitar múltiples búsquedas @env{PATH} (vea la descripción de @code{hash} en @ref{Instrucciones Integradas del Bourne Shell}). Solo se realiza una búsqueda de los directorios en @env{$PATH} si la instrucción no se encontró en la tabla hash. Si la búsqueda es infructuosa, el intérprete busca una función del intérprete definida llamada @code{command_not_found_handle}. Si esa función existe, se llama en un entorno de ejecución separado con la instrucción original y los argumentos de la instrucción original como sus argumentos, y el estado de salida de la función se convierte en el estado de salida de ese subintérprete. Si no está definida esa función, el intérprete imprime un mensaje de error y devuelve un estado de salida de 127.

source: If the search is successful, or if the command name contains one or more slashes, the shell executes the named program in a separate execution environment. Argument 0 is set to the name given, and the remaining arguments to the command are set to the arguments supplied, if any.
es: Si la búsqueda es exitosa o si el nombre de la instrucción contiene una o más barras, el intérprete ejecuta el programa nombrado en un entorno de ejecución aislado. El argumento 0 se establece al nombre dado, y el resto de argumentos para la instrucción se establecen a los argumentos proporcionados, si hay.

source: If this execution fails because the file is not in executable format, and the file is not a directory, it is assumed to be a @var{shell script} and the shell executes it as described in @ref{Shell Scripts}.
es: Si esta ejecución falló porque el archivo no está en formato ejecutable, y el archivo no es un directorio, se toma por un @var{guion de intérprete} y el intérprete lo ejecuta como se describe en @ref{Guiones del Intérprete}.

source: If the command was not begun asynchronously, the shell waits for the command to complete and collects its exit status.
es: Si la instrucción no fue iniciada asíncronamente, el intérprete espera a que la instrucción se complete y recoge su estado de salida.

source: execution environment
es: entorno de ejecución

source: The shell has an @var{execution environment}, which consists of the following:
es: El intérprete tiene un @var{entorno de ejecución}, que consta de lo siguiente:

source: open files inherited by the shell at invocation, as modified by redirections supplied to the @code{exec} builtin
es: abre archivos heredados por el intérprete durante la llamada, como se modificaron por redirecciones proporcionadas a la instrucción integrada @code{exec}

source: the current working directory as set by @code{cd}, @code{pushd}, or @code{popd}, or inherited by the shell at invocation
es: el directorio de trabajo actual como fue establecido por @code{cd}, @code{pushd} o @code{popd}, o heredado por el intérprete durante la llamada

source: the file creation mode mask as set by @code{umask} or inherited from the shell's parent
es: el modo de máscara de creación de archivo como fue establecido por @code{umask} o heredado del padre del intérprete

source: current traps set by @code{trap}
es: traps actuales establecidas por @code{trap}

source: shell parameters that are set by variable assignment or with @code{set} or inherited from the shell's parent in the environment
es: parámetros del intérprete que son establecidos mediante asignación de variables o con @code{set} o heredados del padre del intérprete en el entorno

source: shell functions defined during execution or inherited from the shell's parent in the environment
es: funciones del intérprete definidas durante la ejecución o heredadas del padre del intérprete en el entorno

source: options enabled at invocation (either by default or with command-line arguments) or by @code{set}
es: opciones habilitadas en la llamada (o predeterminadas o con argumentos de línea de órdenes) o mediante @code{set}

source: options enabled by @code{shopt} (@pxref{The Shopt Builtin})
es: opciones habilitadas por @code{shopt} (@pxref{La Instrucción Integrada Shopt})

source: shell aliases defined with @code{alias} (@pxref{Aliases})
es: aliases del intérprete definidos con @code{alias} (@pxref{Aliases})

source: various process @sc{id}s, including those of background jobs (@pxref{Lists}), the value of @code{$$}, and the value of @env{$PPID}
es: varios @sc{id}s de procesos, incluyendo aquellos de las tareas en segundo plano (@pxref{Listas}), el valor de @code{$$} y el valor de @env{$PPID}
