Repository: davidam/bashrefes
Catalog: hsuser.*.po
Languages: es

source: Using History Interactively
es: Usando el Historial Interactivamente

source: This chapter describes how to use the @sc{gnu} History Library interactively, from a user's standpoint. It should be considered a user's guide. For information on using the @sc{gnu} History Library in other programs, see the @sc{gnu} Readline Library Manual.
es: Este capítulo describe cómo usar la @sc{gnu} History Library interactivamente, desde el punto de vista de un usuario. Debería ser considerado una guía de usuario. Para información sobre el uso de @sc{gnu} History Library en otros programas, consulta el @sc{gnu} Manual de la Readline Library.

source: This chapter describes how to use the @sc{gnu} History Library interactively, from a user's standpoint. It should be considered a user's guide. For information on using the @sc{gnu} History Library in your own programs, @pxref{Programming with GNU History}.
es: Este capítulo describe cómo usar la @sc{gnu} History Library interactivamete, desde el punto de vista del usuario. Debería ser considerada una guía de usuario. Para información sobre el uso de la @{gnu} History Library en tus propios programas, @pxref{Programando con GNU History}.

source: Bash History Facilities
es: Servicios del Historial de Bash

source: How Bash lets you manipulate your command history.
es: Cómo te permite Bash manipular tu historial de instrucciones.

source: Bash History Builtins
es: Instrucciones Integradas del Historial de Bash

source: The Bash builtin commands that manipulate the command history.
es: Las instrucciones integradas de Bash que manipulan el historial de instrucciones.

source: History Interaction
es: Interacción con el Historial

source: What it feels like using History as a user.
es: Qué se siente al usar History como usuario.

source: command history
es: historial de instrucciones

source: history list
es: lista del historial

source: When the @option{-o history} option to the @code{set} builtin is enabled (@pxref{The Set Builtin}), the shell provides access to the @dfn{command history}, the list of commands previously typed. The value of the @env{HISTSIZE} shell variable is used as the number of commands to save in a history list. The text of the last @env{$HISTSIZE} commands (default 500) is saved. The shell stores each command in the history list prior to parameter and variable expansion but after history expansion is performed, subject to the values of the shell variables @env{HISTIGNORE} and @env{HISTCONTROL}.
es: Cuando la opción @option{-o history} para la instrucción integrada @code{set} está habilitada (@pxref{La Instrucción Integrada Set}), el intérprete proporciona acceso al @dfn{historial de instrucciones}, la lista de instrucciones tecleadas anteriormente. El valor de la variable del intérprete @env{HISTSIZE} es usada como el número de instrucciones que guardar en una lista del historial. El texto de las @env{$HISTSIZE} últimas instrucciones (por defecto 500) es guardado. El intérprete almacena cada instrucción en la lista del historial antes de la expansión de parámetros y de variables, pero tras realizar la expansión de historial, sujeta a los valores de las variables del intérprete @env{HISTIGNORE} y @env{HISTCONTROL}.

source: When the shell starts up, the history is initialized from the file named by the @env{HISTFILE} variable (default @file{~/.bash_history}). The file named by the value of @env{HISTFILE} is truncated, if necessary, to contain no more than the number of lines specified by the value of the @env{HISTFILESIZE} variable. When a shell with history enabled exits, the last @env{$HISTSIZE} lines are copied from the history list to the file named by @env{$HISTFILE}. If the @code{histappend} shell option is set (@pxref{Bash Builtins}), the lines are appended to the history file, otherwise the history file is overwritten. If @env{HISTFILE} is unset, or if the history file is unwritable, the history is not saved. After saving the history, the history file is truncated to contain no more than @env{$HISTFILESIZE} lines. If @env{HISTFILESIZE} is unset, or set to null, a non-numeric value, or a numeric value less than zero, the history file is not truncated.
es: Cuando el intérprete se inicia, el historial es inicializado desde el archivo llamado por la variable @env{HISTFILE} (por defecto, @file{~/.bash_history}). El archivo llamado por el valor de @env{HISTFILE} es cortado, si es necesario, para contener nada más que el número de líneas especificado por el valor de la variable @env{HISTFILESIZE}. Cuando se cierra un intérprete con el historial habilitado, son copiadas las últimas @env{$HISTSIZE} líneas desde la lista del historial al archivo nombrado por @env{$HISTFILE}. Si está establecida (@pxref{Instrucciones Integradas de Bash}) la opción del intérprete @code{histappend}, las líneas son añadidas al archivo del historial; en caso contrario es sobreescrito el archivo del historial. Si @env{HISTFILE} está sin establecer, o si el archivo del historial no se puede escribir, no se guarda el historial. Después de guardar el historial, el archivo del historial es cortado para no contener más de @env{$HISTFILESIZE} líneas. Si @env{HISTFILESIZE} no está establecido, o está establecido a nulo, o un valor no numérico, o un valor numérico menor que cero, no se corta el archivo del historial.

source: If the @env{HISTTIMEFORMAT} is set, the time stamp information associated with each history entry is written to the history file, marked with the history comment character. When the history file is read, lines beginning with the history comment character followed immediately by a digit are interpreted as timestamps for the following history entry.
es: Si el @env{HISTTIMEFORMAT} está establecido, la información de marca de tiempo asociada con cada entrada del historial es escrita al archivo del historial, marcada con el carácter de comentario del historial. Cuando el archivo del historial es leído, las líneas que comienzan por el carácter de comentario del historial seguidas inmediatamente por un dígito son interpretadas como marcas de tiempo por la siguiente entrada del historial.

source: The builtin command @code{fc} may be used to list or edit and re-execute a portion of the history list. The @code{history} builtin may be used to display or modify the history list and manipulate the history file. When using command-line editing, search commands are available in each editing mode that provide access to the history list (@pxref{Commands For History}).
es: La instrucción integrada @code{fc} puede ser usada para listar o editar y reejecutar una porción de la lista del historial. La instrucción integrada @code{history} puede ser usada para mostrar o modificar la lista del historial y manipular el archivo del historial. Al usar la edición en línea de órdenes, están disponibles las instrucciones de búsqueda en cada modo de edición que proporciona acceso a la lista del historial (@pxref{Órdenes para el Historial}).

source: The shell allows control over which commands are saved on the history list. The @env{HISTCONTROL} and @env{HISTIGNORE} variables may be set to cause the shell to save only a subset of the commands entered. The @code{cmdhist} shell option, if enabled, causes the shell to attempt to save each line of a multi-line command in the same history entry, adding semicolons where necessary to preserve syntactic correctness. The @code{lithist} shell option causes the shell to save the command with embedded newlines instead of semicolons. The @code{shopt} builtin is used to set these options. @xref{The Shopt Builtin}, for a description of @code{shopt}.
es: El intérprete proporciona control sobre qué instrucciones son guardadas en la lista del historial. Las variables @env{HISTCONTROL} y @env{HISTIGNORE} pueden ser establecidas para hacer que el intérprete solo guarde un subconjunto de las instrucciones introducidas. La opción del intérprete @code{cmdhist}, si está habilitada, hace que el intérprete trate de guardar cada línea de una instrucción de múltiples líneas en la misma entrada del historial, añadiendo puntos y comas donde sea necesario para preservar la corrección sintáctica. La opción del intérprete @code{lithist} hace que el intérprete guarde la instrucción con nuevas líneas intercaladas en vez de puntos y comas. La opción integrada @code{shopt} es usada para habilitar estas opciones. @xref{La Instrucción Integrada Shopt}, para una descripción de @code{shopt}.

source: history builtins
es: instrucciones integradas de historial

source: Bash provides two builtin commands which manipulate the history list and history file.
es: Bash proporciona dos instrucciones integradas que manipulan la lista del historial y el archivo del historial.

source: @code{fc [-e @var{ename}] [-lnr] [@var{first}] [@var{last}]} @code{fc -s [@var{pat}=@var{rep}] [@var{command}]}
es: @code{fc [-e @var{nombre-editor}] [-lnr] [@var{primera}] [@var{última}]} @code{fc -s [@var{pat}=@var{rem}] [@var{instrucción}]}

source: The first form selects a range of commands from @var{first} to @var{last} from the history list and displays or edits and re-executes them. Both @var{first} and @var{last} may be specified as a string (to locate the most recent command beginning with that string) or as a number (an index into the history list, where a negative number is used as an offset from the current command number). If @var{last} is not specified, it is set to @var{first}. If @var{first} is not specified, it is set to the previous command for editing and @minus{}16 for listing. If the @option{-l} flag is given, the commands are listed on standard output. The @option{-n} flag suppresses the command numbers when listing. The @option{-r} flag reverses the order of the listing. Otherwise, the editor given by @var{ename} is invoked on a file containing those commands. If @var{ename} is not given, the value of the following variable expansion is used: @code{$@{FCEDIT:-$@{EDITOR:-vi@}@}}. This says to use the value of the @env{FCEDIT} variable if set, or the value of the @env{EDITOR} variable if that is set, or @code{vi} if neither is set. When editing is complete, the edited commands are echoed and executed.
es: La primera forma selecciona un rango de instrucciones desde @var{primera} hasta @var{última} de la lista del historial y lo muestra o edita y vuelve a ejecutarlo. Tanto @var{primera} como @var{última} pueden ser especificadas como cadenas (para ubicar la instrucción más reciente que comienza por esa cadena) o como números (un índice en la lista del historial, donde se usa un número negativo como desplazamiento del número de instrucción actual). Si @var{última} no es especificada, es establecida a @var{primera}. Si @var{primera} no es especificada, es establecida a la anterior instrucción para editar y @minus{}16 para listar. Si se pasa la bandera @option{-l}, la instrucciones son listadas en la salida estándar. La bandera @option{-n} suprime los números de instrucciones cuando se listan. La opción @option{-r} invierte el orden del listado. De lo contrario, el editor pasado por @var{nombre-editor} es llamado en un sobre archivo que contiene esas instrucciones. Si no se pasa @var{nombre-editor}, se usa el valor de la siguiente expansión de variable: @code{$@{FCEDIT:-$@{EDITOR:-vi@}@}}. Esto dice que se use el valor de la variable @env{FCEDIT} si está establecida, o el valor de la variable @env{EDITOR} si este está establecido, o @code{vi} si ninguno está establecido. Cuando está completada la edición, las instrucciones editadas son mostradas y ejecutadas.

source: In the second form, @var{command} is re-executed after each instance of @var{pat} in the selected command is replaced by @var{rep}. @var{command} is intepreted the same as @var{first} above.
es: En la segunda forma, @var{instrucción} se vuelve a ejecutar después de que cada instancia de @var{pat} en la instrucción seleccionada es reemplazada por @var{rem}. @var{instrucción} se interpreta igual que @var{primera} arriba.

source: A useful alias to use with the @code{fc} command is @code{r='fc -s'}, so that typing @samp{r cc} runs the last command beginning with @code{cc} and typing @samp{r} re-executes the last command (@pxref{Aliases}).
es: Un alias útil para usar con la instrucción @code{fc} es @code{r='fc -s}, para que teclear @samp{r cc} ejecuta la última instrucción que comienza por @code{cc} y teclear @samp{r} vuelva a ejecutar la última instrucción (@pxref{Aliases}).

source: history [@var{n}] history -c history -d @var{offset} history -d @var{start}-@var{end} history [-anrw] [@var{filename}] history -ps @var{arg}
es: history [@var{n}] history -c history -d @var{desplazamiento} history -d @var{inicio}-@var{fin} history [-anrw] [@var{nombre-de-archivo}] history -ps @var{arg}

source: With no options, display the history list with line numbers. Lines prefixed with a @samp{*} have been modified. An argument of @var{n} lists only the last @var{n} lines. If the shell variable @env{HISTTIMEFORMAT} is set and not null, it is used as a format string for @var{strftime} to display the time stamp associated with each displayed history entry. No intervening blank is printed between the formatted time stamp and the history line.
es: Sin opciones muestra la lista del historial con números de línea. Las líneas prefijadas con un @samp{*} han sido modificadas. Un argumento de @var{n} lista solo las últimas @var{n} líneas. Si la variable del intérprete @env{HISTTIMEFORMAT} está establecida y no es nula, es usada como una cadena de formato por @var{strfttime} para mostrar la marca temporal asociada con cada entrada de historial mostrada. Ningún vacío intermedio es mostrado entre la marca temporal formateada y la línea del historial.

source: Options, if supplied, have the following meanings:
es: Las opciones, si se proporcionan, tienen los siguientes significados:

source: Clear the history list. This may be combined with the other options to replace the history list completely.
es: Limpia la lista del historial. Esto puede ser combinado con las otras opciones para reemplazar la lista del historial completamente.

source: -d @var{offset}
es: -d @var{desplazamiento}

source: Delete the history entry at position @var{offset}. If @var{offset} is positive, it should be specified as it appears when the history is displayed. If @var{offset} is negative, it is interpreted as relative to one greater than the last history position, so negative indices count back from the end of the history, and an index of @samp{-1} refers to the current @code{history -d} command.
es: Elimina la entrada del historial en la posición @var{desplazamiento}. Si @var{desplazamiento} es positivo, debería ser especificado como si apareciera cuando se muestra el historial. Si @var{desplazamiento} es negativo, se interpreta como relativo a uno mayor que la última posición del historial, de forma que los índices negativos cuentan hacia atrás desde el final del historial, y un índice de @samp{-1} se refiere a la actual instrucción @code{history -d}.

source: -d @var{start}-@var{end}
es: -d @var{inicio}-@var{fin}

source: Delete the history entries between positions @var{start} and @var{end}, inclusive. Positive and negative values for @var{start} and @var{end} are interpreted as described above.
es: Elimina las entradas del historial entre las posiciones @var{inicio} y @var{fin}, inclusivas. Los valores positivos y negativos para @var{start} y @var{end} se interpretan como se explica arriba.

source: Append the new history lines to the history file. These are history lines entered since the beginning of the current Bash session, but not already appended to the history file.
es: Añade las nuevas líneas de historial al archivo del historial. Estas son líneas de historial introducidas desde el comienzo de la actual sesión de Bash, pero no añadidas aún al archivo del historial.

source: Append the history lines not already read from the history file to the current history list. These are lines appended to the history file since the beginning of the current Bash session.
es: Añade las líneas del historial no cargadas aún del archivo del historial a la lista actual del historial. Estas son líneas añadidas al archivo del historial desde el comienzo de la actual sesión de Bash.

source: Read the history file and append its contents to the history list.
es: Lee el archivo del historial y añade su contenido a la lista del historial.

source: Write out the current history list to the history file.
es: Escribe entera la lista del historial actual al archivo del historial.

source: Perform history substitution on the @var{arg}s and display the result on the standard output, without storing the results in the history list.
es: Realiza una sustitución de historial en @var{arg}s y muestra el resultado en la salida estándar, sin guardar los resultados en la lista del historial.

source: The @var{arg}s are added to the end of the history list as a single entry.
es: Los @var{arg}s son añadidos al final de la lista del historial como una única entrada.

source: When any of the @option{-w}, @option{-r}, @option{-a}, or @option{-n} options is used, if @var{filename} is given, then it is used as the history file. If not, then the value of the @env{HISTFILE} variable is used.
es: Cuando alguna de las opciones @option{-w}, @option{-r}, @option{-a} o @option{-n} es usada, si se pasa @var{nombre-de-archivo}, entonces este es usado como el archivo del historial. Si no, es usado el valor de la variable @env{HISTFILE}.

source: History Expansion
es: Expansión del Historial

source: history expansion
es: expansión del historial

source: The History library provides a history expansion feature that is similar to the history expansion provided by @code{csh}. This section describes the syntax used to manipulate the history information.
es: La librería History proporciona una funcionalidad de expansión de historial que es similar a la expansión de historial proporcionada por @code{csh}. Esta sección describe la sintaxis usada para manipular la información del historial.

source: History expansions introduce words from the history list into the input stream, making it easy to repeat commands, insert the arguments to a previous command into the current input line, or fix errors in previous commands quickly.
es: Las expansiones del historial introducen palabras desde la lista del historial al flujo de entrada, facilitando repetir instrucciones, insertar los argumentos para una instrucción anterior en la línea de entrada actual o arreglar errores en las instrucciones anteriores rápidamente.

source: History expansion is performed immediately after a complete line is read, before the shell breaks it into words, and is performed on each line individually. Bash attempts to inform the history expansion functions about quoting still in effect from previous lines.
es: La expansión de historial se realiza inmediatamente después de que sea leída una línea completa, antes de que el intérprete la divida en palabras y se realiza en cada línea de forma individual. Bash trata de informar a las funciones de expansión de historial sobre el antrecomillado aún en efecto de líneas anteriores.

source: History expansion takes place in two parts. The first is to determine which line from the history list should be used during substitution. The second is to select portions of that line for inclusion into the current one. The line selected from the history is called the @dfn{event}, and the portions of that line that are acted upon are called @dfn{words}. Various @dfn{modifiers} are available to manipulate the selected words. The line is broken into words in the same fashion that Bash does, so that several words surrounded by quotes are considered one word. History expansions are introduced by the appearance of the history expansion character, which is @samp{!} by default.
es: La expansión del historial tiene lugar en dos partes. La primera es para determinar qué línea de la lista del historial debería ser usada durante la sustitución. La segunda es para seleccionar porciones de esa línea para la inclusión en la actual. La línea seleccionada del historial es llamada el @dfn{evento}, y las porciones de esa línea sobre las que se actúa son llamadas @dfn{palabras}. Varios @dfn{modificadores} están disponibles para manipular las palabras seleccionadas. La línea es dividida en palabras de la misma forma que hace Bash, para que varias palabras rodeadas por comillas sean consideradas una palabras. Las expansiones del historial son introducidas por la aparición del carácter de expansión de historial, que es @samp{!} por defecto.

source: History expansion implements shell-like quoting conventions: a backslash can be used to remove the special handling for the next character; single quotes enclose verbatim sequences of characters, and can be used to inhibit history expansion; and characters enclosed within double quotes may be subject to history expansion, since backslash can escape the history expansion character, but single quotes may not, since they are not treated specially within double quotes.
es: La expansión de historial implementa convenciones de entrecomillado del estilo del intérprete: una barra invertida puede ser usada para eliminar el tratamiento especial del siguiente carácter; las comillas simples rodean secuencias literales de caracteres y pueden ser usadas para inhibir la expansión de historial; y los caracteres rodeados por comillas dobles pueden estar sujetos a la expansión de carácter de historial, pero no las comillas dobles, puesto que no son tratadas de forma especial entre comillas dobles.

source: When using the shell, only @samp{\} and @samp{'} may be used to escape the history expansion character, but the history expansion character is also treated as quoted if it immediately precedes the closing double quote in a double-quoted string.
es: Al usar el intérprete, solo @samp{\} y @samp{'} pueden ser usados para escapar el carácter de expansión del historial, pero el carácter de expansión del historial también es tratado como entrecomillado si precede inmediatamente a la comillas dobles de cierre en una cadena entrecomillada con comillas dobles.
