Repository: davidam/bashrefes
Catalog: hsuser.*.po
Languages: es

source: Several shell options settable with the @code{shopt} builtin (@pxref{The Shopt Builtin}) may be used to tailor the behavior of history expansion. If the @code{histverify} shell option is enabled, and Readline is being used, history substitutions are not immediately passed to the shell parser. Instead, the expanded line is reloaded into the Readline editing buffer for further modification. If Readline is being used, and the @code{histreedit} shell option is enabled, a failed history expansion will be reloaded into the Readline editing buffer for correction. The @option{-p} option to the @code{history} builtin command may be used to see what a history expansion will do before using it. The @option{-s} option to the @code{history} builtin may be used to add commands to the end of the history list without actually executing them, so that they are available for subsequent recall. This is most useful in conjunction with Readline.
es: Varias opciones del intérprete que pueden ser habilitadas con la instrucción integrada @code{shopt} (@pxref{La Instrucción Integrada Shopt}) pueden ser utilizadas para adaptar el comportamiento de la expansión del historial. Si la opción del intérprete @code{histverify} está habilitada, y se está usando Readline, las sustituciones del historial no son pasadas inmediatamente al analizador del intérprete. En su lugar, la línea expandida es vuelta a cargar en el búfer de edición de Readline para su posterior modificación. Si se está usando Readline, y la opción del intérprete @code{histreedit} está habilitada, se volverá a cargar una expansión de historial fallida en el búfer de edición de Readline para su corrección. La opción @option{-p} para la instrucción integrada @code{history} puede ser usada para ver qué hará una expansión de historial antes de usarla. La opción @option{-s} para la instrucción integrada @code{history} puede ser usada para añadir instrucciones al final de la lista del historial sin realmente ejecutarlas, para que estas estén disponibles para volver a ser llamadas posteriormente. Eso tiene la mayor utilidad en conjunto con Readline.

source: The shell allows control of the various characters used by the history expansion mechanism with the @code{histchars} variable, as explained above (@pxref{Bash Variables}). The shell uses the history comment character to mark history timestamps when writing the history file.
es: El intérprete permite el control de varios caracteres usados por el mecanismo de expansión del historial con la variable @code{histchars}, como se explicó anteriormente (@pxref{Variables de Bash}). El intérprete usa el carácter de comentario del historial para señalar las marcas del tiempo al escribir el archivo del historial.

source: Event Designators
es: Designadores de Eventos

source: How to specify which history line to use.
es: Cómo especificar qué línea del historial usar.

source: Word Designators
es: Designadores de Palabras

source: Specifying which words are of interest.
es: Especificando qué palabras son de interés.

source: Modifiers
es: Modificadores

source: Modifying the results of substitution.
es: Modificando los resultados de la sustitución.

source: event designators
es: designadores de eventos

source: An event designator is a reference to a command line entry in the history list. Unless the reference is absolute, events are relative to the current position in the history list.
es: Un designador de evento es una referencia a una línea de entrada en la lista del historial. A no ser que la referencia sea absoluta, los eventos son relativos a la actual posición en la lista del historial.

source: history events
es: eventos del historial

source: Start a history substitution, except when followed by a space, tab, the end of the line, @samp{=} or @samp{(} (when the @code{extglob} shell option is enabled using the @code{shopt} builtin).
es: Comienza una sustitución del historial, excepto cuando lo sigue un espacio, tabulación, el final de línea, @samp{=} o @samp{(} (cuando la opción del intérprete @code{extglob} es habilitada usando la instrucción integrada @code{shopt}).

source: Start a history substitution, except when followed by a space, tab, the end of the line, or @samp{=}.
es: Comienza una sustitución del historial, excepto cuando lo sigue un espacio, tabulación, el final de línea o @samp{=}.

source: Refer to command line @var{n}.
es: Alude a la línea de instrucción @var{n}.

source: Refer to the command @var{n} lines back.
es: Alude a la instrucción @var{n} líneas atrás.

source: Refer to the previous command. This is a synonym for @samp{!-1}.
es: Alude a la instrucción anterior. Esto es un sinónimo de @samp{!-1}.

source: !@var{string}
es: !@var{cadena}

source: Refer to the most recent command preceding the current position in the history list starting with @var{string}.
es: Alude a la instrucción más reciente que precede a la actual posición en la lista del historial que comienza por @var{cadena}.

source: !?@var{string}[?]
es: !?@var{cadena}[?]

source: Refer to the most recent command preceding the current position in the history list containing @var{string}. The trailing @samp{?} may be omitted if the @var{string} is followed immediately by a newline.
es: Alude a la instrucción más reciente que precede a la actual posición en la lista del historial que contiene @var{cadena}. El @samp{?} al final puede ser omitido si @var{cadena} es seguida inmediatamente por una nueva línea.

source: ^@var{string1}^@var{string2}^
es: ^@var{cadena1}^@var{cadena2}^

source: Quick Substitution. Repeat the last command, replacing @var{string1} with @var{string2}. Equivalent to @code{!!:s/@var{string1}/@var{string2}/}.
es: Sustitución rápida. Repite la última instrucción, reemplazando @var{cadena1} por @var{cadena2}. Equivalente a @code{!!:s/@var{cadena1}/@var{cadena2}/}.

source: The entire command line typed so far.
es: La línea de instrucción completa escrita hasta ahora.

source: Word designators are used to select desired words from the event. A @samp{:} separates the event specification from the word designator. It may be omitted if the word designator begins with a @samp{^}, @samp{$}, @samp{*}, @samp{-}, or @samp{%}. Words are numbered from the beginning of the line, with the first word being denoted by 0 (zero). Words are inserted into the current line separated by single spaces.
es: Los designadores de palabras son usados para seleccionar las palabras deseadas del evento. Un @samp{:} separa la especificación de evento del designador de palabra. Puede ser omitido si el designador de palabra empieza por @samp{^}, @samp{$}, @samp{*}, @samp{-} o @samp{%}. Las palabras son numeradas desde el comienzo de la línea, con la primera palabra indicada por un 0 (cero). Las palabras son insertadas en la línea actual separadas por espacios únicos.

source: For example,
es: Por ejemplo,

source: designates the preceding command. When you type this, the preceding command is repeated in toto.
es: designa la instrucción precedente. Cuando escribes esto, la instrucción precedente es repetida en su totalidad.

source: designates the last argument of the preceding command. This may be shortened to @code{!$}.
es: designa el último argumento de la instrucción precedente. Esto puede ser acortado a @code{!$}.

source: designates the second argument of the most recent command starting with the letters @code{fi}.
es: designa el segundo argumento de la instrucción más reciente que comienza por las letras @code{fi}.

source: Here are the word designators:
es: Aquí están los designadores de palabras:

source: 0 (zero)
es: 0 (cero)

source: The @code{0}th word. For many applications, this is the command word.
es: La palabra número @code{0}. Para muchas aplicaciones, esto es la palabra de instrucción.

source: The @var{n}th word.
es: La palabra número @var{n}.

source: The first argument; that is, word 1.
es: El primer argumento, es decir, palabra 1.

source: The last argument.
es: El último argumento.

source: The word matched by the most recent @samp{?@var{string}?} search.
es: La palabra que coincide con la búsqueda @samp{?@var{string}?} más reciente.

source: A range of words; @samp{-@var{y}} abbreviates @samp{0-@var{y}}.
es: Un rango de palabras; @samp{-@var{y}} abrevia a @samp{0-@var{y}}.

source: All of the words, except the @code{0}th. This is a synonym for @samp{1-$}. It is not an error to use @samp{*} if there is just one word in the event; the empty string is returned in that case.
es: Todas las palabras, excepto la número @code{0}. Esto es un sinónimo de @samp{1-$}. No es incorrecto usar @samp{*} si solo hay una palabra en el evento; la cadena vacía es devuelta en ese caso.

source: Abbreviates @samp{@var{x}-$}
es: Abrevia @samp{@var{x}-$}

source: Abbreviates @samp{@var{x}-$} like @samp{@var{x}*}, but omits the last word.
es: Abrevia @samp{@var{x}-$} como @samp{@var{x}*}, pero omite la última palabra.

source: If a word designator is supplied without an event specification, the previous command is used as the event.
es: Si se proporciona un designador de palabra sin una especificación de evento, la anterior instrucción es usada como el evento.

source: After the optional word designator, you can add a sequence of one or more of the following modifiers, each preceded by a @samp{:}.
es: Después del designador de palabra opcional, puedes añadir una secuencia de uno o más de los siguientes modificadores, cada uno precedido por un @samp{:}.

source: Remove a trailing pathname component, leaving only the head.
es: Elimina un componente de nombre de ruta al final, dejando solo la cabeza.

source: Remove all leading pathname components, leaving the tail.
es: Elimina todos los componentes de ruta iniciales, dejando la cola.

source: Remove a trailing suffix of the form @samp{.@var{suffix}}, leaving the basename.
es: Elimina un sufijo al final de la forma de @samp{.@var{sufijo}}, dejando el nombre base.

source: Remove all but the trailing suffix.
es: Elimina todo excepto el sufijo al final.

source: Print the new command but do not execute it.
es: Imprime la nueva instrucción pero no la ejecuta.

source: Quote the substituted words, escaping further substitutions.
es: Entrecomilla las palabras sustituidas, escapando sustituciones adicionales.

source: Quote the substituted words as with @samp{q}, but break into words at spaces, tabs, and newlines.
es: Entrecomilla las palabras sustituidas como con @samp{q}, pero divide las palabras por espacios, tabulaciones y nuevas líneas.

source: s/@var{old}/@var{new}/
es: s/@var{viejo}/@var{nuevo}/

source: Substitute @var{new} for the first occurrence of @var{old} in the event line. Any delimiter may be used in place of @samp{/}. The delimiter may be quoted in @var{old} and @var{new} with a single backslash. If @samp{&} appears in @var{new}, it is replaced by @var{old}. A single backslash will quote the @samp{&}. The final delimiter is optional if it is the last character on the input line.
es: Sustituye @var{nuevo} por la primera ocurrencia de @var{viejo} en la línea de evento. Cualquier delimitador puede ser usado en lugar de @samp{/}. El delimitador puede ser entrecomillado en @var{viejo} y @var{nuevo} con una única barra invertida. Si @samp{&} aparece en @var{nuevo}, es reemplazado por @var{viejo}. Usa única barra invertida entrecomillará el @samp{&}. El delimitador final es opcional si es el último carácter en la línea de entrada.

source: Repeat the previous substitution.
es: Repite la sustitución anterior.

source: Cause changes to be applied over the entire event line. Used in conjunction with @samp{s}, as in @code{gs/@var{old}/@var{new}/}, or with @samp{&}.
es: Hace que los cambios sean aplicados sobre la línea de evento completa. Usado en conjunto con @samp{s}, como en @code{gs/@var{viejo}/@var{nuevo}/}, o con @samp{&}.

source: Apply the following @samp{s} modifier once to each word in the event.
es: Aplica el siguiente modificador @samp{s} una vez para cada palabra en el evento.
