Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: Toggle overwrite mode. With an explicit positive numeric argument, switches to overwrite mode. With an explicit non-positive numeric argument, switches to insert mode. This command affects only @code{emacs} mode; @code{vi} mode does overwrite differently. Each call to @code{readline()} starts in insert mode.
es: Alterna el modo de sobrescritura. Con un argumento numérico positivo explícito, cambia al modo de sobrescritura. Con un argumento no positivo explícito, cambia al modo de inserción. Esta orden solo afecta al modo @code{emacs}; el modo @code{vi} sobrescribe de forma diferente. Cada llamada a @code{readline()} empieza en modo de inserción.

source: In overwrite mode, characters bound to @code{self-insert} replace the text at point rather than pushing the text to the right. Characters bound to @code{backward-delete-char} replace the character before point with a space.
es: En el modo de sobrescritura, los caracteres asociados a @code{self-insert} reemplazan el texto en el punto en vez de empujar el texto a la derecho. Los caracteres asociados a @code{backward-delete-char} reemplazan el carácter antes del punto con un espacio.

source: By default, this command is unbound.
es: Por defecto, esta orden no está asociada.

source: Killing And Yanking
es: Cortar y Pegar

source: Kill the text from point to the end of the line.
es: Corta el texto desde punto hasta el final de la línea.

source: Kill backward from the cursor to the beginning of the current line.
es: Corta atrás desde el cursor hasta el principio de la línea actual.

source: Kill all characters on the current line, no matter where point is. By default, this is unbound.
es: Corta todos los caracteres en la línea actual, no importa dónde esté el punto. Por defecto, esto está sin asociar.

source: Kill from point to the end of the current word, or if between words, to the end of the next word. Word boundaries are the same as @code{forward-word}.
es: Corta desde el punto hasta el final de la palabra actual, o si está entre palabras, hasta el final de la siguiente palabra. Los límites de palabra son los mismos que con @code{forward-word}.

source: backward-kill-word (M-@key{DEL})
es: backward-kill-word (M-@key{SUPR})

source: Kill the word behind point. Word boundaries are the same as @code{backward-word}.
es: Corta la palabra antes del punto. Los límites de palabra son los mismos que con @code{backward-word}.

source: Kill from point to the end of the current word, or if between words, to the end of the next word. Word boundaries are the same as @code{shell-forward-word}.
es: Corta desde el punto hasta el final de la palabra actual o, cuando entre palabras, hasta el final de la siguiente palabra. Los límites de palabra son los mismos que con @code{shell-forward-word}.

source: Kill the word behind point. Word boundaries are the same as @code{shell-backward-word}.
es: Corta la palabra antes del punto. Los límites de palabra son los mismos que los de @code{shell-backward-word}.

source: Kill the word behind point, using white space as a word boundary. The killed text is saved on the kill-ring.
es: Corta la palabra antes del punto, usando el espacio en blanco como un límite de palabra. El texto cortado se guarda en el anillo de corte.

source: Kill the word behind point, using white space and the slash character as the word boundaries. The killed text is saved on the kill-ring.
es: Corta la palabra antes del punto, usando el espacio en blanco y el carácter de barra como los límites de palabra. El texto cortado se guarda en el anillo de corte.

source: Delete all spaces and tabs around point. By default, this is unbound.
es: Elimina todos los espacios y tabulaciones alrededor del punto. Por defecto, esto está sin asociar.

source: Kill the text in the current region. By default, this command is unbound.
es: Corta el texto en la región actual. Por defecto, esta orden está sin asociar.

source: Copy the text in the region to the kill buffer, so it can be yanked right away. By default, this command is unbound.
es: Copia el texto de la región al búfer de corte, para que pueda ser pegado inmediatamente. Por defecto, esta orden está sin asignar.

source: Copy the word before point to the kill buffer. The word boundaries are the same as @code{backward-word}. By default, this command is unbound.
es: Copia la palabra antes del punto al búfer de corte. Los límites de palabra son los mismos que los de @code{backward-word}. Por defecto, esta orden no está asociada.

source: Copy the word following point to the kill buffer. The word boundaries are the same as @code{forward-word}. By default, this command is unbound.
es: Copia la palabra que sigue al punto al búfer de corte. Los límites de palabra son los mismos que los de @code{backward-word}. Por defecto, esta orden no está asociada.

source: Yank the top of the kill ring into the buffer at point.
es: Pega lo superior del anillo de corte en el búfer en el punto.

source: Rotate the kill-ring, and yank the new top. You can only do this if the prior command is @code{yank} or @code{yank-pop}.
es: Rota el kill-ring y pega lo que hay nuevo arriba. Solo puede hacer esto si la anterior orden es @code{yank} o @code{yank-pop}.

source: Specifying Numeric Arguments
es: Especificando Argumentos Numéricos

source: Add this digit to the argument already accumulating, or start a new argument. @kbd{M--} starts a negative argument.
es: Añade este dígito al argumento que ya se esté acumulando o empieza un nuevo argumento. @kbd{M--} empieza un argumento negativo.

source: This is another way to specify an argument. If this command is followed by one or more digits, optionally with a leading minus sign, those digits define the argument. If the command is followed by digits, executing @code{universal-argument} again ends the numeric argument, but is otherwise ignored. As a special case, if this command is immediately followed by a character that is neither a digit nor minus sign, the argument count for the next command is multiplied by four. The argument count is initially one, so executing this function the first time makes the argument count four, a second time makes the argument count sixteen, and so on. By default, this is not bound to a key.
es: Esto es otro modo de especificar un argumento. Si esta orden es seguida de uno o más dígitos, opcionalmente con un signo de menos inicial, esos dígitos definen el argumento. Si la orden es seguida por dígitos, ejecutar @code{universal-argument} de nuevo acaba el argumento numérico, pero es ignorado de lo contrario. Como caso especial, si esta orden es inmediatamente seguida por un carácter que no es un dígito ni un signo de menos, la cuenta de argumentos para la siguiente instrucción se multiplica por cuatro. La cuenta de argumentos es inicialmente uno, así que ejecutar esta función la primera vez hace la cuenta de argumentos cuatro, una segunda vez hace la cuenta de argumentos dieciséis y así sucesivamente. Por defecto, no está asociada a una tecla.

source: Letting Readline Type For You
es: Dejar a Readline Escribir por Usted

source: Attempt to perform completion on the text before point. The actual completion performed is application-specific.
es: Trata de realizar una compleción en el texto antes del punto. La compleción real realizada es especifica de la aplicación.

source: Bash attempts completion treating the text as a variable (if the text begins with @samp{$}), username (if the text begins with @samp{~}), hostname (if the text begins with @samp{@@}), or command (including aliases and functions) in turn. If none of these produces a match, filename completion is attempted.
es: Bash intenta la compleción tratando el texto como una variable (si el texto empieza por @samp{$}), nombre de usuario (si el texto empieza por @samp{~}), nombre de anfitrión (si el texto empieza por @samp{@@}) o instrucción (incluyendo aliases y funciones) en orden. Si ninguna de estas produce una coincidencia, se intenta la compleción de nombre de archivo.

source: The default is filename completion.
es: Lo predeterminado es la compleción de nombre de archivo.

source: List the possible completions of the text before point. When displaying completions, Readline sets the number of columns used for display to the value of @code{completion-display-width}, the value of the environment variable @env{COLUMNS}, or the screen width, in that order.
es: Lista las posibles compleciones del texto antes del punto. Al mostrar compleciones, Readline establece el número de columnas usadas para mostrar el valor de @code{completion-display-width}, el valor de la variable de entorno @env{COLUMNS} o la anchura de la pantalla, en ese orden.

source: Insert all completions of the text before point that would have been generated by @code{possible-completions}.
es: Inserta todas las compleciones de texto antes del punto que habrían sido generadas por @code{possible-completions}.

source: Similar to @code{complete}, but replaces the word to be completed with a single match from the list of possible completions. Repeated execution of @code{menu-complete} steps through the list of possible completions, inserting each match in turn. At the end of the list of completions, the bell is rung (subject to the setting of @code{bell-style}) and the original text is restored. An argument of @var{n} moves @var{n} positions forward in the list of matches; a negative argument may be used to move backward through the list. This command is intended to be bound to @key{TAB}, but is unbound by default.
es: Similar a @code{complete}, pero reemplaza la palabra que se va a completar con una única coincidencia de la lista de posibles compleciones. La ejecución repetida de @code{menu-complete} recorre la lista de posibles compleciones, insertando cada coincidencia en orden. Al final de la lista de compleciones, suena el timbre (sujeto al ajuste de @code{bell-style}) y se restablece el texto original. Un argumento de @var{n} se mueve @var{n} posiciones adelante en la lista de coincidencias; un argumento negativo se puede usar para moverse atrás a través de la lista. Esta instrucción está pensada para ser asociada a @key{TAB}, pero por defecto no está asociada.

source: Identical to @code{menu-complete}, but moves backward through the list of possible completions, as if @code{menu-complete} had been given a negative argument.
es: Idéntica a @code{menu-complete}, pero se mueve atrás a través de la lista de posibles compleciones, como si a @code{menu-complete} se le hubiera dado un argumento negativo.

source: Deletes the character under the cursor if not at the beginning or end of the line (like @code{delete-char}). If at the end of the line, behaves identically to @code{possible-completions}. This command is unbound by default.
es: Elimina el carácter bajo el cursor si no está al principio o al final de la línea (como @code{delete-char}). Si está al final de la línea, se comporta de forma idéntica a @code{possible-completions}. Esta orden está sin asignar por defecto.

source: Attempt filename completion on the text before point.
es: Intenta la compleción de nombre de archivo en el texto antes del punto.

source: List the possible completions of the text before point, treating it as a filename.
es: Lista las posibles compleciones del texto antes del punto, tratándolo como un nombre de archivo.

source: Attempt completion on the text before point, treating it as a username.
es: Intenta la compleción en el texto antes del punto, tratándolo como un nombre de archivo.

source: List the possible completions of the text before point, treating it as a username.
es: Lista las posibles compleciones del texto antes del punto, tratándolo como un nombre de usuario.

source: Attempt completion on the text before point, treating it as a shell variable.
es: Intenta la compleción en el texto antes del punto, tratándolo como una variable del intérprete.

source: List the possible completions of the text before point, treating it as a shell variable.
es: Lista las posibles compleciones del texto antes del punto, tratándolo como una variable del intérprete.

source: Attempt completion on the text before point, treating it as a hostname.
es: Intenta la compleción del texto antes del punto, tratándolo como un nombre de anfitrión.

source: List the possible completions of the text before point, treating it as a hostname.
es: Lista las posibles compleciones del texto antes del punto, tratándolo como un nombre de anfitrión.

source: Attempt completion on the text before point, treating it as a command name. Command completion attempts to match the text against aliases, reserved words, shell functions, shell builtins, and finally executable filenames, in that order.
es: Intenta la compleción en el texto antes del punto, tratándolo como un nombre de instrucción. La compleción de instrucciones trata de hacer coincidir el texto con aliases, palabras reservadas, funciones del intérprete, instrucciones integradas del intérprete y finalmente nombres de archivo ejecutables, en ese orden.

source: List the possible completions of the text before point, treating it as a command name.
es: Lista las posibles compleciones del texto antes del punto, tratándolo como un nombre de orden.

source: Attempt completion on the text before point, comparing the text against lines from the history list for possible completion matches.
es: Intenta la compleción del texto antes del punto, comparándo el texto con líneas de la lista del historial en busca de posibles coincidencias de compleción.

source: Attempt menu completion on the text before point, comparing the text against lines from the history list for possible completion matches.
es: Intenta la compleción de menú en el texto antes del punto, comparando el texto con las líneas de la lista del historial en busca de posibles coincidencias de compleción.

source: Perform filename completion and insert the list of possible completions enclosed within braces so the list is available to the shell (@pxref{Brace Expansion}).
es: Realiza la compleción de nombre de archivo e inserta la lista de compleciones posibles entre llaves para que la lista esté disponible para el intérprete (@pxref{Expansión de Llaves}).

source: Begin saving the characters typed into the current keyboard macro.
es: Empieza a guardar los caracteres escritos en la macro actual de teclado.

source: Stop saving the characters typed into the current keyboard macro and save the definition.
es: Deja de guardar los caracteres escritos en la macro actual de teclado y guarda la definición.

source: Re-execute the last keyboard macro defined, by making the characters in the macro appear as if typed at the keyboard.
es: Vuelve a ejecutar la última macro de teclado definida, haciendo que los caracteres en la macro aparezcan como si fueran teclados en el teclado.

source: Print the last keboard macro defined in a format suitable for the @var{inputrc} file.
es: Imprime la última macro de teclado definida en un forma compatible con el archivo @var{inputrc}.

source: Some Miscellaneous Commands
es: Algunas Órdenes Variadas

source: Read in the contents of the @var{inputrc} file, and incorporate any bindings or variable assignments found there.
es: Lee en el contenido del archivo @var{inputrc} e incorpora las asociaciones o asignaciones de variable encontradas ahí.

source: Abort the current editing command and ring the terminal's bell (subject to the setting of @code{bell-style}).
es: Aborta la orden que se está editando actualmente y suena el timbre de la terminal (sujeto al ajuste de @code{bell-style}).

source: If the metafied character @var{x} is upper case, run the command that is bound to the corresponding metafied lower case character. The behavior is undefined if @var{x} is already lower case.
es: Si el carácter metaficado @var{x} está en mayúscula, ejecuta la instrucción que está asociada al carácter metaficado correspondiente en minúscula. El comportamiento no está definido si @var{x} ya está en minúscula.

source: Metafy the next character typed. This is for keyboards without a meta key. Typing @samp{@key{ESC} f} is equivalent to typing @kbd{M-f}.
es: Metafica el siguiente carácter escrito. Esto es para teclados sin una tecla meta. Escribir @samp{@key{ESC} f} es equivalente a teclear @kbd{M-f}.

source: Incremental undo, separately remembered for each line.
es: Deshacer incremental, recordado separadamente para cada línea.

source: Undo all changes made to this line. This is like executing the @code{undo} command enough times to get back to the beginning.
es: Deshace todos los cambios hechos a esta línea. Esto es como ejecutar la orden @code{undo} las veces suficientes para volver al comienzo.

source: Perform tilde expansion on the current word.
es: Realiza la expansión de virgulilla en la palabra actual.

source: Set the mark to the point. If a numeric argument is supplied, the mark is set to that position.
es: Establece la marca en el punto. Si se proporciona un argumento numérico, la marca se establece en esa posición.

source: Swap the point with the mark. The current cursor position is set to the saved position, and the old cursor position is saved as the mark.
es: Intercambia el punto con la marca. La posición del cursor actual se establece a la posición guardada, y la posición antigua del cursor se guarda como la marca.

source: A character is read and point is moved to the next occurrence of that character. A negative count searches for previous occurrences.
es: Un carácter es leído, y el punto se mueve a la siguiente ocurrencia de ese carácter. Una cuenta negativa busca ocurrencias previas.

source: A character is read and point is moved to the previous occurrence of that character. A negative count searches for subsequent occurrences.
es: Un carácter es leído, y el punto se mueve a la anterior ocurrencia de ese carácter. Una cuenta negativa busca ocurrencias posteriores.

source: Read enough characters to consume a multi-key sequence such as those defined for keys like Home and End. Such sequences begin with a Control Sequence Indicator (CSI), usually ESC-[. If this sequence is bound to "\e[", keys producing such sequences will have no effect unless explicitly bound to a readline command, instead of inserting stray characters into the editing buffer. This is unbound by default, but usually bound to ESC-[.
es: Lee suficientes caracteres para consumir una secuencia multitecla como aquellas definidas por teclas como Inicio y Fin. Estas secuencias comienzan con un Indicador de Secuencia de Control (ISC), normalmente ESC-[. Si esta secuencia está asociada a "\e[", las teclas que produzcan tales secuencias no tendrán efecto a no ser que sean específicamente asociadas a una orden readline, en vez de insertar caracteres inconexos en el búfer de edición. Esto está sin asociar por defecto, pero normalmente asociado a ESC-[.

source: Without a numeric argument, the value of the @code{comment-begin} variable is inserted at the beginning of the current line. If a numeric argument is supplied, this command acts as a toggle: if the characters at the beginning of the line do not match the value of @code{comment-begin}, the value is inserted, otherwise the characters in @code{comment-begin} are deleted from the beginning of the line. In either case, the line is accepted as if a newline had been typed.
es: Sin un argumento numérico, el valor de la variable @code{comment-begin} se inserta al comienzo de la línea actual. Si se proporciona un argumento numérico, esta orden actúa como un centinela: si los caracteres al comienzo de la línea no coinciden con el valor de @code{comment-begin}, el valor es insertado; de lo contrario, los caracteres en @code{comment-begin} son eliminados del comienzo de la línea. En ambos casos, la línea se acepta como si se hubiera tecleado una nueva línea.

source: The default value of @code{comment-begin} causes this command to make the current line a shell comment. If a numeric argument causes the comment character to be removed, the line will be executed by the shell.
es: El valor predeterminado de @code{comment-begin} hace que esta orden haga la línea actual un comentario del intérprete. Si un argumento numérico hace que el carácter de comentario sea eliminado, el línea será ejecutada por el intérprete.

source: Print all of the functions and their key bindings to the Readline output stream. If a numeric argument is supplied, the output is formatted in such a way that it can be made part of an @var{inputrc} file. This command is unbound by default.
es: Imprime todas las funciones y sus asociaciones de teclas en el flujo de salida de Readline. Si se proporciona un argumento numérico, la salida se formatea en una forma que se puede hacer parte de un archivo @var{inputrc}. Esta orden está sin asociar por defecto.

source: Print all of the settable variables and their values to the Readline output stream. If a numeric argument is supplied, the output is formatted in such a way that it can be made part of an @var{inputrc} file. This command is unbound by default.
es: Imprime todas las variables que pueden ser establecidas y sus valores al flujo de salida de Readline. Si se proporciona un argumento numérico, la salida se formatea de una forma que se puede hacer parte de un archivo @var{inputrc}. Esta orden está sin asociar por defecto.

source: Print all of the Readline key sequences bound to macros and the strings they output. If a numeric argument is supplied, the output is formatted in such a way that it can be made part of an @var{inputrc} file. This command is unbound by default.
es: Imprime todas las secuencias de teclas de Readline asociadas a macros y las cadenas que producen. Si se proporciona un argumento numérico, la salida se formatea de una forma que se puede hacer parte de un archivo @var{inputrc}. Esta orden está sin asociar por defecto.

source: The word before point is treated as a pattern for pathname expansion, with an asterisk implicitly appended. This pattern is used to generate a list of matching file names for possible completions.
es: La palabra antes del punto se trata como un patrón para la expansión de nombre de patrón, con un asterisco añadido implícitamente. Este patrón se usa para generar una lista de nombres de archivos coincidentes para posibles compleciones.

source: The word before point is treated as a pattern for pathname expansion, and the list of matching file names is inserted, replacing the word. If a numeric argument is supplied, a @samp{*} is appended before pathname expansion.
es: La palabra antes del punto se trata como un patrón para la compleción de nombre de archivo, y es insertada la lista de nombres de archivos coincidentes, reemplazando la palabra. Si se proporciona un argumento numérico, se añade un @samp{*} antes de la expansión de nombre de archivo.

source: The list of expansions that would have been generated by @code{glob-expand-word} is displayed, and the line is redrawn. If a numeric argument is supplied, a @samp{*} is appended before pathname expansion.
es: Se muestra la lista de expansiones que han sido generadas por @code{glob-expand-word}, y se vuelve a dibujar la línea. Si se proporciona un argumento numérico, se añade un @samp{*} antes de la expansión de nombre de ruta.

source: Display version information about the current instance of Bash.
es: Muestra la información de versión de la instancia actual de Bash.

source: Expand the line as the shell does. This performs alias and history expansion as well as all of the shell word expansions (@pxref{Shell Expansions}).
es: Expande la línea como hace el intérprete. Esto realiza la expansión de alias y de historial así como todas las expansiones de palabra del intérprete (@pxref{Expansiones del Intérprete}).

source: Perform history expansion on the current line.
es: Realiza la expansión de historial en la línea actual.
