Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: If set to @samp{on}, completed names which are symbolic links to directories have a slash appended (subject to the value of @code{mark-directories}). The default is @samp{off}.
es: Si está puesta en @samp{on}, se añade una barra a los nombres completados que son enlaces simbólicos a directorios (sujeto al valor de @code{mark-directories}). Por defecto es @samp{off}.

source: This variable, when set to @samp{on}, causes Readline to match files whose names begin with a @samp{.} (hidden files) when performing filename completion. If set to @samp{off}, the leading @samp{.} must be supplied by the user in the filename to be completed. This variable is @samp{on} by default.
es: Esta variable, cuando es puesta en @samp{on}, hace que Readline coincida los archivos cuyos nombres comiencen por un @samp{.} (archivos ocultos) al realizar compleción de nombre de archivo. Si está puesta en @samp{off}, se debe proporcionar el @samp{.} inicial por el usuario en el nombre de archivo a ser completado. Esta variable está en @samp{on} por defecto.

source: If set to @samp{on}, menu completion displays the common prefix of the list of possible completions (which may be empty) before cycling through the list. The default is @samp{off}.
es: Si está puesta en @samp{on}, la compleción de menú muestra el prefijo común de la lista de posibles compleciones (que puede ser vacía) antes de iterar sobre la lista. Por defecto es @samp{off}.

source: If set to @samp{on}, Readline will display characters with the eighth bit set directly rather than as a meta-prefixed escape sequence. The default is @samp{off}, but Readline will set it to @samp{on} if the locale contains eight-bit characters.
es: Si está puesta en @samp{on}, Readline mostrará caracteres con el octavo bit establecido directamente en vez de como una secuencia de escape prefijada con meta. El valor predeterminado es @samp{off}, pero Readline lo pondrá en @samp{on} si la configuración regional contiene caracteres de ocho bits.

source: If set to @samp{on}, Readline uses an internal @code{more}-like pager to display a screenful of possible completions at a time. This variable is @samp{on} by default.
es: Si está puesta en @samp{on} Readline usa un paginador interno parecido a @code{more} para mostrar una pantalla completa de posibles compleciones cada vez. Esta variable está en @samp{on} por defecto.

source: If set to @samp{on}, Readline will display completions with matches sorted horizontally in alphabetical order, rather than down the screen. The default is @samp{off}.
es: Si está puesta en @samp{on}, Readline mostrará compleciones con coincidencias ordenadas horizontalmente en orden alfabético, en vez de pantalla abajo. Por defecto es @samp{off}.

source: If set to @samp{on}, Readline will undo all changes to history lines before returning when @code{accept-line} is executed. By default, history lines may be modified and retain individual undo lists across calls to @code{readline}. The default is @samp{off}.
es: Si está puesta en @samp{on}, Readline deshará todos los cambios a las líneas del historial antes de retornar cuando se ejecute @code{accept-line}. Por defecto, las líneas del historial pueden ser modificadas y conservar listas de deshacer entre llamadas a @code{readline}. Lo predeterminado es @samp{off}.

source: This alters the default behavior of the completion functions. If set to @samp{on}, words which have more than one possible completion cause the matches to be listed immediately instead of ringing the bell. The default value is @samp{off}.
es: Esto altera el comportamiento predeterminado de las funciones de compleción. Si está puesto en @samp{on}, palabras que tengan más de una posible compleción hacen que las coincidencias sean listadas inmediatamente en vez de sonar el timbre. El valor predeterminado es @samp{off}.

source: This alters the default behavior of the completion functions in a fashion similar to @var{show-all-if-ambiguous}. If set to @samp{on}, words which have more than one possible completion without any possible partial completion (the possible completions don't share a common prefix) cause the matches to be listed immediately instead of ringing the bell. The default value is @samp{off}.
es: Esto altera el comportamiento predeterminado de las funciones de compleción en un estilo similar al de @var{show-all-if-ambiguous}. Si está puesto en @samp{on}, las palabras que tienen más de una posible compleción sin una posible compleción parcial (las posibles compleciones no comparten un prefijo común) hacen que las coincidencias sean mostradas inmediatamente en vez de sonar el timbre. El valor predeterminado es @samp{off}.

source: If set to @samp{on}, add a string to the beginning of the prompt indicating the editing mode: emacs, vi command, or vi insertion. The mode strings are user-settable (e.g., @var{emacs-mode-string}). The default value is @samp{off}.
es: Si está puesta en @samp{on}, añade una cadena al comienzo del prompt indicando el modo de edición: emacs, orden vi o inserción vi Las cadenas de modo se pueden establecer por el usuario (p. ej., @var{emacs-mode-string}). El valor predeterminado es @samp{off}.

source: If set to @samp{on}, this alters the default completion behavior when inserting a single match into the line. It's only active when performing completion in the middle of a word. If enabled, readline does not insert characters from the completion that match characters after point in the word being completed, so portions of the word following the cursor are not duplicated. For instance, if this is enabled, attempting completion when the cursor is after the @samp{e} in @samp{Makefile} will result in @samp{Makefile} rather than @samp{Makefilefile}, assuming there is a single possible completion. The default value is @samp{off}.
es: Si está puesta en @samp{on}, esto altera el comportamiento predeterminado de compleción al insertar una única coincidencia en la línea. Solo está activa al realizar compleciones en mitad de palabra. Si está habilitada, readline no inserta caracteres desde la compleción que modifican caracteres después del punto en la palabra que está siendo completada, así que las partes de la palabra que siguen al cursor no se duplican. Por ejemplo, si esto está habilitado, intentar la compleción cuando el cursor está después de la @samp{e} en @samp{Makefile} reultará en @samp{Makefile} en vez de @samp{Makefilefile}, asumiendo que hay una única compleción posible. El valor predeterminado es @samp{off}

source: If the @var{show-mode-in-prompt} variable is enabled, this string is displayed immediately before the last line of the primary prompt when vi editing mode is active and in command mode. The value is expanded like a key binding, so the standard set of meta- and control prefixes and backslash escape sequences is available. Use the @samp{\1} and @samp{\2} escapes to begin and end sequences of non-printing characters, which can be used to embed a terminal control sequence into the mode string. The default is @samp{(cmd)}.
es: Si la variable @var{show-mode-in-prompt} está habilitada, esta cadena se muestra inmediatamente antes de la última línea del prompt primario cuando está activado el modo de edición de vi y está en modo comando. El valor se expande como una asociación de teclas, de forma que está disponible el conjunto estándar de prefijos meta- y de control y secuencias de barras invertidas de escape. Use los escapes @samp{\1} y @samp{\2} para empezar y terminar secuencias de caracteres no imprimibles, que pueden ser usados para encerrar una secuencia de control de terminal en la cadena de modo. Lo predeterminado es @samp{(cmd)}.

source: If the @var{show-mode-in-prompt} variable is enabled, this string is displayed immediately before the last line of the primary prompt when vi editing mode is active and in insertion mode. The value is expanded like a key binding, so the standard set of meta- and control prefixes and backslash escape sequences is available. Use the @samp{\1} and @samp{\2} escapes to begin and end sequences of non-printing characters, which can be used to embed a terminal control sequence into the mode string. The default is @samp{(ins)}.
es: Si la variable @var{show-mode-in-prompt} está habilitada, esta cadena se muestra inmediatamente antes de la última línea del prompt primario cuando está activado el modo de edición de vi y está en modo de inserción. El valor se expande como una asociación de teclas, de forma que está disponible el conjunto estándar de prefijos meta- y de control y secuencias de barras invertidas de escape. Use los escapes @samp{\1} y @samp{\2} para empezar y terminar secuencias de caracteres no imprimibles, que pueden ser usados para encerrar una secuencia de control de terminal en la cadena de modo. Lo predeterminado es @samp{(ins)}.

source: If set to @samp{on}, a character denoting a file's type is appended to the filename when listing possible completions. The default is @samp{off}.
es: Si está puesta en @samp{on}, se añade un carácter que denota el tipo de un archivo al nombre de archivo durante el listado de posibles compleciones. Por defecto es @samp{off}.

source: Key Bindings
es: Asociaciones de Teclas

source: The syntax for controlling key bindings in the init file is simple. First you need to find the name of the command that you want to change. The following sections contain tables of the command name, the default keybinding, if any, and a short description of what the command does.
es: La sintaxis para controlar las asociaciones de teclas en el archivo de inicialización es sencilla. Primero necesita encontrar el nombre de la orden que quiere cambiar. Las siguientes secciones contienen tablas del nombre de orden, la asociación de teclado predeterminada, si hay, y una descripción corta de lo que hace la orden.

source: Once you know the name of the command, simply place on a line in the init file the name of the key you wish to bind the command to, a colon, and then the name of the command. There can be no space between the key name and the colon -- that will be interpreted as part of the key name. The name of the key can be expressed in different ways, depending on what you find most comfortable.
es: Una vez que sepa el nombre de la orden, simplemente ubique en una línea en el archivo de inicialización el nombre de la tecla que desea asociar la orden, dos puntos y el nombre de la orden. No puede haber espacio entre el nombre de la tecla y los dos puntos, que serán interpretados como parte del nombre de la tecla. El nombre de la tecla se puede expresar de diferentes formas, dependiendo de lo que encuentre más cómodo.

source: In addition to command names, readline allows keys to be bound to a string that is inserted when the key is pressed (a @var{macro}).
es: Además de nombres de órdenes, readline permite que sean asociadas teclas a una cadena que se inserta cuando la tecla se pulsa (una @var{macro}).

source: The @w{@code{bind -p}} command displays Readline function names and bindings in a format that can put directly into an initialization file. @xref{Bash Builtins}.
es: La instrucción @w{@code{bind -p}} muestra los nombres de funciones y las asociaciones de Readline en un formato que se puede poner directamente en un archivo de inicialización. @xref{Instrucciones Integradas de Bash}.

source: @var{keyname}: @var{function-name} or @var{macro}
es: @var{nombre-de-tecla}: @var{nombre-de-función} o @var{macro}

source: @var{keyname} is the name of a key spelled out in English. For example:
es: @var{nombre-de-tecla} es el nombre de una tecla enunciada en inglés. Por ejemplo:

source: In the example above, @kbd{C-u} is bound to the function @code{universal-argument}, @kbd{M-DEL} is bound to the function @code{backward-kill-word}, and @kbd{C-o} is bound to run the macro expressed on the right hand side (that is, to insert the text @samp{> output} into the line).
es: En el ejemplo anterior, @kbd{C-u} está asociada a la función @code{universal-argument}, @kbd{M-SUPR} está asociada a la función @code{backward-kill-word} y @kbd{C-o} está asociada a ejecutar la macro expresada en el lado derecho (es decir, a insertar el texto @samp{> output} en la línea).

source: A number of symbolic character names are recognized while processing this key binding syntax: @var{DEL}, @var{ESC}, @var{ESCAPE}, @var{LFD}, @var{NEWLINE}, @var{RET}, @var{RETURN}, @var{RUBOUT}, @var{SPACE}, @var{SPC}, and @var{TAB}.
es: Un número de nombres de caracteres simbólicos se reconocen al procesar esta sintaxis de asociación de teclas: @var{DEL}, @var{ESC}, @var{ESCAPE}, @var{LFD}, @var{NEWLINE}, @var{ENT}, @var{RETURN}, @var{RUBOUT}, @var{SPACE}, @var{SPC}, and @var{TAB}.

source: "@var{keyseq}": @var{function-name} or @var{macro}
es: "@var{secteclas}": @var{nombre-de-función} o @var{macro}

source: @var{keyseq} differs from @var{keyname} above in that strings denoting an entire key sequence can be specified, by placing the key sequence in double quotes. Some @sc{gnu} Emacs style key escapes can be used, as in the following example, but the special character names are not recognized.
es: @var{secteclas} difiere de @var{nombre-de-tecla} anterior en que las cadenas denotan una secuencia de teclas entera que puede ser especificada, ubicando la secuencia de teclas en comillas dobles. Se pueden usar algunas secuencias de escape de teclas estilo Emacs, como en el siguiente ejemplo, pero no se reconocen los nombres de caracteres especiales.

source: "\C-u": universal-argument "\C-x\C-r": re-read-init-file "\e[11~": "Function Key 1"
es: "\C-u": universal-argument "\C-x\C-r": re-read-init-file "\e[11~": "Tecla de Función 1"

source: In the above example, @kbd{C-u} is again bound to the function @code{universal-argument} (just as it was in the first example), @samp{@kbd{C-x} @kbd{C-r}} is bound to the function @code{re-read-init-file}, and @samp{@key{ESC} @key{[} @key{1} @key{1} @key{~}} is bound to insert the text @samp{Function Key 1}.
es: En el ejemplo anterior, @kbd{C-u} está de nuevo asociada a la función @code{universal-argument} (como estaba en el primer ejemplo), @samp{@kbd{C-x} @kbd{C-r}} está asociada a la función @code{re-read-init-file} y @samp{@key{ESC} @key{[} @key{1} @key{1} @key{~}} está asociada a insertar el texto @samp{Tecla de Función 1}.

source: The following @sc{gnu} Emacs style escape sequences are available when specifying key sequences:
es: Las siguientes secuencias de escape estilo @sc{gnu} Emacs están disponibles al especificar secuencias de caracteres:

source: control prefix
es: prefijo control

source: meta prefix
es: prefijo meta

source: an escape character
es: un carácter de escape

source: backslash
es: barra invertida

source: @key{"}, a double quotation mark
es: @key{"}, un símbolo de comilla doble

source: @key{'}, a single quote or apostrophe
es: @key{'}, una comilla simple o apóstrofo

source: In addition to the @sc{gnu} Emacs style escape sequences, a second set of backslash escapes is available:
es: Además de las secuencias de escape estilo @sc{gnu} Emacs, está disponible un segundo conjunto de secuencias de escape:

source: alert (bell)
es: alerta (timbre)

source: backspace
es: retroceso

source: delete
es: eliminar

source: form feed
es: salto de página

source: newline
es: nueva línea

source: carriage return
es: retorno de carro

source: horizontal tab
es: tabulación horizontal

source: vertical tab
es: tabulación vertical

source: the eight-bit character whose value is the octal value @var{nnn} (one to three digits)
es: la secuencia de caracteres de ocho bits cuyo valor es el valor octal @var{nnn} (de uno a tres dígitos)

source: the eight-bit character whose value is the hexadecimal value @var{HH} (one or two hex digits)
es: el carácter de ocho bits cuyo valor es el valor hexadecimal @var{HH} (uno o dos dígitos hexadecimales)

source: When entering the text of a macro, single or double quotes must be used to indicate a macro definition. Unquoted text is assumed to be a function name. In the macro body, the backslash escapes described above are expanded. Backslash will quote any other character in the macro text, including @samp{"} and @samp{'}. For example, the following binding will make @samp{@kbd{C-x} \} insert a single @samp{\} into the line:
es: Al introducir el texto de una macro, las comillas simples o dobles se deben usar para indicar una definición de macro. Se asume que el texto sin entrecomillar es un nombre de función. En el cuerpo de la macro, los escapes de barra invertida descritos arriba son expandidos. La barra invertida entrecomillará cualquier otro carácter en el texto de la macro, incluyendo a @samp{"} y @samp{'}. Por ejemplo, la siguiente asociación hará que @samp{@kbd{C-x} \} inserte una única @samp{\} en la línea:

source: Readline implements a facility similar in spirit to the conditional compilation features of the C preprocessor which allows key bindings and variable settings to be performed as the result of tests. There are four parser directives used.
es: Readline implementa una herramienta similar en espíritu a las funcionalidades condicionales de compilación del preprocesador C que permiten que asociaciones de teclas y ajustes de variables se realicen como el resultado de comprobaciones. Hay cuatro directivas del analizador usadas.

source: The @code{$if} construct allows bindings to be made based on the editing mode, the terminal being used, or the application using Readline. The text of the test, after any comparison operator, extends to the end of the line; unless otherwise noted, no characters are required to isolate it.
es: La construcción @code{$if} permite que se hagan asociaciones basadas en el modo de edición, la terminal que está siendo usada o las aplicaciones que usan Readline. El texto de la comprobación, después de cualquier operador de comparación, se extiende hasta el final de la línea; a no ser que se especifique lo contrario, no se requieren caracteres para aislarlo.

source: The @code{mode=} form of the @code{$if} directive is used to test whether Readline is in @code{emacs} or @code{vi} mode. This may be used in conjunction with the @samp{set keymap} command, for instance, to set bindings in the @code{emacs-standard} and @code{emacs-ctlx} keymaps only if Readline is starting out in @code{emacs} mode.
es: La forma @code{modo=} de la directiva @code{$if} se usa para comprobar si Readline está en el modo @code{emacs} o @code{vi}. Esto puede ser usado en conjunto con la orden @samp{set keymap}, por ejemplo, para establecer asociaciones en los mapas de teclas @code{emacs-standard} y @code{emacs-ctlx} solo si Readline está empezando en modo @code{emacs}.

source: The @code{term=} form may be used to include terminal-specific key bindings, perhaps to bind the key sequences output by the terminal's function keys. The word on the right side of the @samp{=} is tested against both the full name of the terminal and the portion of the terminal name before the first @samp{-}. This allows @code{sun} to match both @code{sun} and @code{sun-cmd}, for instance.
es: La forma @code{term=} puede ser usada para incluir asociaciones de teclas específicas de la terminal, quizá para asociar la salida de secuencias de teclas por las teclas de función de la terminal. La palabra al lado izquierdo del @samp{=} se comprueba sobre tanto el nombre completo de la terminal como la porción del nombre de la terminal antes del primer @samp{-}. Esto permite que @code{sun} coincida tanto con @code{sun} y @code{sub-cmd}, por ejemplo.

source: The @code{version} test may be used to perform comparisons against specific Readline versions. The @code{version} expands to the current Readline version. The set of comparison operators includes @samp{=} (and @samp{==}), @samp{!=}, @samp{<=}, @samp{>=}, @samp{<}, and @samp{>}. The version number supplied on the right side of the operator consists of a major version number, an optional decimal point, and an optional minor version (e.g., @samp{7.1}). If the minor version is omitted, it is assumed to be @samp{0}. The operator may be separated from the string @code{version} and from the version number argument by whitespace. The following example sets a variable if the Readline version being used is 7.0 or newer:
es: La prueba @code{version} puede usarse para realizar comparaciones entre versiones espec@'ificas de Readline. La @code{version} se expande a la actual versión de Readline. El conjunto de operadores de comparación incluye @samp{=} (y @samp{==}), @samp{!=}, @samp{<=}, @samp{>=}, @samp{<} y @samp{>}. El número de versión proporcionado en el lado izquierdo del operador consiste en un número de versión mayor, un punto decimal opcional y una versión menor opcional (p. ej., @samp{7.1}). Si se omite la versión menor, se asume que es @samp{0}. El operador puede separarse de la cadena @code{version} y del argumento de número de versión mediante espacio en blanco. El siguiente ejemplo asigna una variable si la versión de Readline usada es la 7.0 o una más nueva:

source: The @var{application} construct is used to include application-specific settings. Each program using the Readline library sets the @var{application name}, and you can test for a particular value. This could be used to bind key sequences to functions useful for a specific program. For instance, the following command adds a key sequence that quotes the current or previous word in Bash:
es: La construcción @var{application} se usa para incluir ajustes específicos de aplicación. Cada programa usando la librería Readline asigna el @var{nombre de aplicación}, y puede comprobar por un valor particular. Esto se podría usar para asociar secuencias de teclas a funciones útiles para un programa específico. Por ejemplo, la siguiente orden añade una secuencia que entrecomilla la palabra actual o previa en Bash:

source: $if Bash # Quote the current or previous word "\C-xq": "\eb\"\ef\"" $endif
es: $if Bash # Entrecomilla la palabra actual o previa "\C-xq": "\eb\"\ef\"" $endif

source: The @var{variable} construct provides simple equality tests for Readline variables and values. The permitted comparison operators are @samp{=}, @samp{==}, and @samp{!=}. The variable name must be separated from the comparison operator by whitespace; the operator may be separated from the value on the right hand side by whitespace. Both string and boolean variables may be tested. Boolean variables must be tested against the values @var{on} and @var{off}. The following example is equivalent to the @code{mode=emacs} test described above:
es: La construcción @var{variable} proporciona simples comprobaciones de igualdad para las variables y los valores de Readline. Los operadores de comparación permitidos son @samp{=}, @samp{==} y @samp{!=}. El nombre de variable debe estar separado por el operador de comparación por espacio en blanco; el operador puede separarse del valor de la derecha con un espacio en blanco. Tanto las variables de cadena y las booleanas pueden ser comprobadas. Las variables booleanas pueden ser comprobadas con los valores @var{on} y @var{off}. El siguiente ejemplo es equivalente a la comprobación @code{mode=emacs} descrita anteriormente:

source: This command, as seen in the previous example, terminates an @code{$if} command.
es: Esta instrucción, como se vio en el ejemplo anterior, termina una orden @code{$if}.

source: Commands in this branch of the @code{$if} directive are executed if the test fails.
es: Las órdenes en esta rama de la directiva @code{$if} son ejecutadas si falla la comprobación.
