Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: Command Line Editing
es: Edición en Línea de Órdenes

source: This chapter describes the basic features of the @sc{gnu} command line editing interface.
es: Este capítulo describe las funcionalidades básicas de la interfaz de edición en línea de órdenes de @sc{gnu}.

source: Command line editing is provided by the Readline library, which is used by several different programs, including Bash. Command line editing is enabled by default when using an interactive shell, unless the @option{--noediting} option is supplied at shell invocation. Line editing is also used when using the @option{-e} option to the @code{read} builtin command (@pxref{Bash Builtins}). By default, the line editing commands are similar to those of Emacs. A vi-style line editing interface is also available. Line editing can be enabled at any time using the @option{-o emacs} or @option{-o vi} options to the @code{set} builtin command (@pxref{The Set Builtin}), or disabled using the @option{+o emacs} or @option{+o vi} options to @code{set}.
es: La edición de línea de órdenes está proporcionada por la biblioteca Readline, que es usada por varios programas diferentes, incluido Bash. La edición de línea de órdenes es habilitada por defecto cuando se usa un intérprete interactivo, a no ser que se proporcione la opción @option{--noediting} en la llamada al intérprete. La edición de línea también se usa al usar la opción @option{-e} para la instrucción integrada @code{read} (@pxref{Instrucciones Integradas de Bash}). Por defecto, las órdenes de edición de línea son similares a las de Emacs. También está disponible una edición de línea estilo vi. La edición de línea puede ser habilitada en cualquier momento usando las opciones @option{-o emacs} o @option{-o vi} para la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}) o deshabilitada usando las opciones @option{+o emacs} o @option{+o vi} para @code{set}.

source: Introduction and Notation
es: Introducción y Notación

source: Notation used in this text.
es: Notación usada en este texto.

source: Readline Interaction
es: Interacción con Readline

source: The minimum set of commands for editing a line.
es: El conjunto mínimo de instrucciones para editar una línea.

source: Readline Init File
es: Archivo de Inicialización de Readline

source: Customizing Readline from a user's view.
es: Personalizando Readline desde la vista del usuario.

source: Bindable Readline Commands
es: Órdenes Asociables de Readline

source: A description of most of the Readline commands available for binding
es: Una descripción de la mayoría de las órdenes de Readline disponibles para asociar

source: Readline vi Mode
es: Modo vi de Readline

source: A short description of how to make Readline behave like the vi editor.
es: Una descripción corta de cómo hacer que Readline se comporte como el editor vi.

source: * Programmable Completion:: How to specify the possible completions for a specific command. * Programmable Completion Builtins:: Builtin commands to specify how to complete arguments for a particular command. * A Programmable Completion Example:: An example shell function for generating possible completions.
es: * Compleción Programable:: Cómo especificar las posibles compleciones para una instrucción específica. * Instrucciones Integradas de Compleción Programables:: Instrucciones integradas para especificar cómo completar argumentos para una instrucción específica. * Un Ejemplo de Compleción Programable:: Una función del intérprete de ejemplo para generar posibles compleciones.

source: Introduction to Line Editing
es: Introducción a la Edición de Línea

source: The following paragraphs describe the notation used to represent keystrokes.
es: Los siguientes párrafos describen la notación usada para representar pulsaciones de teclas.

source: The text @kbd{C-k} is read as `Control-K' and describes the character produced when the @key{k} key is pressed while the Control key is depressed.
es: El texto @kbd{C-k} se lee como `Control-K' y describe el carácter producido cuando se pulsa la tecla @key{k} mientras se oprime la tecla Control.

source: The text @kbd{M-k} is read as `Meta-K' and describes the character produced when the Meta key (if you have one) is depressed, and the @key{k} key is pressed. The Meta key is labeled @key{ALT} on many keyboards. On keyboards with two keys labeled @key{ALT} (usually to either side of the space bar), the @key{ALT} on the left side is generally set to work as a Meta key. The @key{ALT} key on the right may also be configured to work as a Meta key or may be configured as some other modifier, such as a Compose key for typing accented characters.
es: El texto @kbd{M-k} se lee como `Meta-K' y describe el carácter producido cuando la tecla Meta (si tiene una) se oprime y se pulsa la tecla @key{k}. La tecla Meta está etiquetada como @key{ALT} en muchos teclados. En teclados con dos teclas etiquetadas como @key{ALT} (normalmente a ambos lados de la barra espaciadora), el @key{ALT} en el lado izquierdo está generalmente establecido para funcionar como tecla Meta. La tecla @key{ALT} en el derecho también puede ser configurado para funcionar como una tecla Meta o puede ser configurado como algún otro modificador, como la tecla Compose para escribir caracteres acentuados.

source: If you do not have a Meta or @key{ALT} key, or another key working as a Meta key, the identical keystroke can be generated by typing @key{ESC} @emph{first}, and then typing @key{k}. Either process is known as @dfn{metafying} the @key{k} key.
es: Si no tiene un tecla Meta o @key{ALT}, u otra tecla funcionando como una tecla Meta, se puede generar la misma pulsación escribiendo @key{ESC} @emph{primero} y después escribiendo @key{k}. Este proceso se conoce como @dfn{metaficar} la tecla @key{k}.

source: The text @kbd{M-C-k} is read as `Meta-Control-k' and describes the character produced by @dfn{metafying} @kbd{C-k}.
es: El texto @kbd{M-C-k} se lee como `Meta-Control-k' y describe el carácter producido al @dfn{metaficar} @kbd{C-k}.

source: In addition, several keys have their own names. Specifically, @key{DEL}, @key{ESC}, @key{LFD}, @key{SPC}, @key{RET}, and @key{TAB} all stand for themselves when seen in this text, or in an init file (@pxref{Readline Init File}). If your keyboard lacks a @key{LFD} key, typing @key{C-j} will produce the desired character. The @key{RET} key may be labeled @key{Return} or @key{Enter} on some keyboards.
es: Además, varias teclas tienen sus propios nombres. Específicamente, @key{SUPR}, @key{ESC}, @key{LFD}, @key{SPC}, @key{ENT} y @key{TAB} todas se representan a sí mismas al ser vistas en este texto o en un archivo de inicialización (@pxref{Archivo de Inicialización de Readline}). Su su teclado carece de una tecla @key{LFD}, teclear @key{C-j} producirá el carácter deseado. La tecla @key{ENT} puede estar etiquetada como @key{Retorno} o @key{Entrar} en algunos teclados.

source: interaction, readline
es: interacción, readline

source: Often during an interactive session you type in a long line of text, only to notice that the first word on the line is misspelled. The Readline library gives you a set of commands for manipulating the text as you type it in, allowing you to just fix your typo, and not forcing you to retype the majority of the line. Using these editing commands, you move the cursor to the place that needs correction, and delete or insert the text of the corrections. Then, when you are satisfied with the line, you simply press @key{RET}. You do not have to be at the end of the line to press @key{RET}; the entire line is accepted regardless of the location of the cursor within the line.
es: Normalmente durante una sesión interactiva escribe una larga línea de texto, para darse cuenta de que la primera palabra en la línea está mal escrita. La biblioteca Readline le proporciona un conjunto de órdenes para manipular el texto a medida que lo escribe, permitiéndole solo arreglar su errata, y no forzarle a volver a escribir la mayor parte de la línea. Usando estas órdenes de edición, mueve el cursor al lugar que necesita corrección y elimina o inserta el texto de las correcciones. Entonces, cuando está satisfecho con la línea, simplemente pulsa @key{ENT}. No tiene que estar al final de la línea para pulsar @key{ENT}; se acepta la línea completa independientemente de la ubicación del cursor dentro de la línea.

source: Readline Bare Essentials
es: Mínimos Esenciales de Readline

source: The least you need to know about Readline.
es: Lo mínimo que necesita saber sobre Readline.

source: Readline Movement Commands
es: Órdenes de Movimiento de Readline

source: Moving about the input line.
es: Moverse por la línea de entrada.

source: Readline Killing Commands
es: Órdenes de Cortar de Readline

source: How to delete text, and how to get it back!
es: Cómo eliminar texto, ¡y cómo recuperarlo!

source: Readline Arguments
es: Argumentos de Readline

source: Giving numeric arguments to commands.
es: Pasando argumentos numéricos a órdenes.

source: Searching
es: Búsqueda

source: Searching through previous lines.
es: Busca a través de líneas anteriores.

source: notation, readline
es: notación, readline

source: command editing
es: edición de órdenes

source: editing command lines
es: editando líneas de órdenes

source: In order to enter characters into the line, simply type them. The typed character appears where the cursor was, and then the cursor moves one space to the right. If you mistype a character, you can use your erase character to back up and delete the mistyped character.
es: Para introducir caracteres en la línea, simplemente escríbalos. El carácter escrito aparece donde estaba el cursor, y entonces el cursor se mueve un carácter a la derecha. Si escribió mal un carácter, puede usar su carácter de borrado para volver atrás y borrar el carácter mal escrito.

source: Sometimes you may mistype a character, and not notice the error until you have typed several other characters. In that case, you can type @kbd{C-b} to move the cursor to the left, and then correct your mistake. Afterwards, you can move the cursor to the right with @kbd{C-f}.
es: Algunas veces puede escribir mal un carácter, y no darse cuenta del error hasta haber escrito varios otros caracteres. En ese caso, puede pulsar @kbd{C-b} para mover el cursor a la izquierda y, después, corregir su fallo. A continuación, puede mover el cursor a la derecha con @kbd{C-f}.

source: When you add text in the middle of a line, you will notice that characters to the right of the cursor are `pushed over' to make room for the text that you have inserted. Likewise, when you delete text behind the cursor, characters to the right of the cursor are `pulled back' to fill in the blank space created by the removal of the text. A list of the bare essentials for editing the text of an input line follows.
es: Cuando añade texto en medio de una línea, se dará cuenta de que los caracteres a la derecha del cursor son `empujados' dejar espacio al texto que ha insertado. Del mismo modo, cuando cuando borra texto antes del cursor, los caracteres a la derecha del cursor son `arrastrados atrás` para llenar el espacio en blanco creado por la eliminación del texto. A continuación, una lista de lo mínimo necesario para editar el texto de una línea de entrada.

source: Move back one character.
es: Se mueve atrás un carácter.

source: Move forward one character.
es: Se mueve un carácter adelante.

source: @key{DEL} or @key{Backspace}
es: @key{SUPR} or @key{Retroceso}

source: Delete the character to the left of the cursor.
es: Borra el carácter a la izquierda del cursor.

source: Delete the character underneath the cursor.
es: Borra el carácter bajo el cursor.

source: Printing characters
es: Imprimir caracteres

source: Insert the character into the line at the cursor.
es: Inserta el carácter en la línea en la posición del cursor.

source: @kbd{C-_} or @kbd{C-x C-u}
es: @kbd{C-_} o @kbd{C-x C-u}

source: Undo the last editing command. You can undo all the way back to an empty line.
es: Deshace la última orden de edición. Puede deshacer hacia atrás hasta una línea vacía.

source: (Depending on your configuration, the @key{Backspace} key be set to delete the character to the left of the cursor and the @key{DEL} key set to delete the character underneath the cursor, like @kbd{C-d}, rather than the character to the left of the cursor.)
es: (Dependiendo de su configuración, la tecla @key{Retroceso} está establecida para eliminar el carácter a la izquierda del cursor y la tecla @key{DEL} establecida para eliminar el carácter bajo el cursor, como @kbd{C-d}, en vez del carácter a la izquierda del cursor.)

source: The above table describes the most basic keystrokes that you need in order to do editing of the input line. For your convenience, many other commands have been added in addition to @kbd{C-b}, @kbd{C-f}, @kbd{C-d}, and @key{DEL}. Here are some commands for moving more rapidly about the line.
es: La tabla de arriba describe las pulsaciones de teclas más básicas que necesita para realizar ediciones de la línea de entrada. Para su conveniencia, se han añadido muchas otras órdenes además de @kbd{C-b}, @kbd{C-f}, @kbd{C-d} y @key{SUPR}. He aquí algunas de las órdenes para moverse más rápido por la línea.

source: Move to the start of the line.
es: Se mueve al comienzo de la línea.

source: Move to the end of the line.
es: Se mueve al final de la línea.

source: Move forward a word, where a word is composed of letters and digits.
es: Se mueve adelante una palabra, donde una palabra está compuesta de letras y dígitos.

source: Move backward a word.
es: Se mueve atrás una palabra.

source: Clear the screen, reprinting the current line at the top.
es: Limpia la pantalla, volviendo a imprimir la línea actual en lo más alto.

source: Notice how @kbd{C-f} moves forward a character, while @kbd{M-f} moves forward a word. It is a loose convention that control keystrokes operate on characters while meta keystrokes operate on words.
es: Observe como @kbd{C-f} se mueve adelante un carácter, mientras que @kbd{M-f} se mueve adelante una palabra. Es una convención informal que las pulsaciones de control operen en caracteres y las pulsaciones meta en palabras.

source: killing text
es: cortar texto

source: yanking text
es: pegar texto

source: @dfn{Killing} text means to delete the text from the line, but to save it away for later use, usually by @dfn{yanking} (re-inserting) it back into the line. (`Cut' and `paste' are more recent jargon for `kill' and `yank'.)
es: @dfn{Cortar} texto significa eliminar el texto de la línea, pero guardarlo seguidamente para un uso posterior, normalmente @dfn{pegándolo} (reinsertándolo) en la línea. (En inglés se dice `kill' para cortar y `yank' para pegar, pero `copy' y `paste' es una jerga más reciente.)

source: If the description for a command says that it `kills' text, then you can be sure that you can get the text back in a different (or the same) place later.
es: Si la descripción de una instrucción dice que `corta' texto, puede estar seguro de que puede volver a obtener el texto en un lugar diferente (o el mismo) después.

source: When you use a kill command, the text is saved in a @dfn{kill-ring}. Any number of consecutive kills save all of the killed text together, so that when you yank it back, you get it all. The kill ring is not line specific; the text that you killed on a previously typed line is available to be yanked back later, when you are typing another line.
es: Cuando usa una instrucción de cortar, el texto se guarda en un @dfn{kill-ring} [anillo de la muerte, literalmente, nosotros lo llamaremos anillo de corte]. Un número cualquiera de cortes consecutivos guarda todo el texto cortado junto, para que cuando lo pegue de nuevo lo obtenga todo. El anillo de corte no es específico para la línea; el texto que cortó en una línea escrita previamente está disponible para ser pegado después, cuando está escribiendo otra línea.

source: kill ring
es: anillo de corte

source: Here is the list of commands for killing text.
es: He aquí la lista de órdenes para cortar texto.

source: Kill the text from the current cursor position to the end of the line.
es: Corta el texto desde la posición del cursor actual hasta el final de la línea.

source: Kill from the cursor to the end of the current word, or, if between words, to the end of the next word. Word boundaries are the same as those used by @kbd{M-f}.
es: Corta desde el cursor hasta el final de la palabra actual o, si está entre palabras, hasta el final de la siguiente palabra. Los límites de palabra son los mismos usados por @kbd{M-f}.

source: M-@key{DEL}
es: M-@key{SUPR}

source: Kill from the cursor the start of the current word, or, if between words, to the start of the previous word. Word boundaries are the same as those used by @kbd{M-b}.
es: Corta desde el cursor el principio de la palabra actual o, si está entre palabras, hasta el principio de la palabra anterior. Los límites de palabra son los mismos usados por @kbd{M-b}.

source: Kill from the cursor to the previous whitespace. This is different than @kbd{M-@key{DEL}} because the word boundaries differ.
es: Corta desde el cursor hasta el espacio en blanco anterior. Esto es diferente a @kbd{M-@key{SUPR}} porque difieren los límites de palabra.

source: Here is how to @dfn{yank} the text back into the line. Yanking means to copy the most-recently-killed text from the kill buffer.
es: He aquí cómo @dfn{pegar} el texto de nuevo en la línea. Pegar significa copiar el texto más recientemente cortado del búfer de corte.

source: Yank the most recently killed text back into the buffer at the cursor.
es: Pega el texto más recientemente cortado de nuevo en el búfer en el cursor.

source: Rotate the kill-ring, and yank the new top. You can only do this if the prior command is @kbd{C-y} or @kbd{M-y}.
es: Rota el kill-ring, y pega la nueva parte superior. Solo puede hacer esto si la anterior orden es @kbd{C-y} o @kbd{M-y}.

source: You can pass numeric arguments to Readline commands. Sometimes the argument acts as a repeat count, other times it is the @i{sign} of the argument that is significant. If you pass a negative argument to a command which normally acts in a forward direction, that command will act in a backward direction. For example, to kill text back to the start of the line, you might type @samp{M-- C-k}.
es: Puede pasar argumentos numéricos a órdenes de Readline. Algunas veces el argumento actúa como una cuenta de repetición, otras veces es el @i{signo} del argumento lo importante. Si pasa un argumento negativo a una orden que normalmente actúa en una dirección hacia delante, esa orden actuará en una dirección hacia atrás. Por ejemplo, para cortar texto atrás hasta el principio de la línea, puede escribir @samp{M-- c-k}.

source: The general way to pass numeric arguments to a command is to type meta digits before the command. If the first `digit' typed is a minus sign (@samp{-}), then the sign of the argument will be negative. Once you have typed one meta digit to get the argument started, you can type the remainder of the digits, and then the command. For example, to give the @kbd{C-d} command an argument of 10, you could type @samp{M-1 0 C-d}, which will delete the next ten characters on the input line.
es: La manera general de pasar argumentos numéricos a una orden es escribir dígitos meta antes de la orden. Si el primer `dígito' escrito es un signo de menos (@samp{-}), entonces el signo del argumento será negativo. Una vez que haya escrito más de un dígito meta para empezar el argumento, puede escribir el resto de dígitos y después la instrucción. Por ejemplo, para darle a la orden @kbd{C-d} un argumento de 10, podría escribir @samp{M-1 0 C-d}, lo que eliminará los siguientes diez caracteres en la línea de entrada.

source: Searching for Commands in the History
es: Buscando Instrucciones en el Historial

source: Readline provides commands for searching through the command history
es: Readline proporciona órdenes para buscar a través del historial de instrucciones

source: (@pxref{Bash History Facilities})
es: (@pxref{Servicios del Historial de Bash})

source: for lines containing a specified string. There are two search modes: @dfn{incremental} and @dfn{non-incremental}.
es: para líneas que contienen una cadena especificada. Hay dos modos de búsqueda: @dfn{incremental} y @dfn{no incremental}.

source: Incremental searches begin before the user has finished typing the search string. As each character of the search string is typed, Readline displays the next entry from the history matching the string typed so far. An incremental search requires only as many characters as needed to find the desired history entry. To search backward in the history for a particular string, type @kbd{C-r}. Typing @kbd{C-s} searches forward through the history. The characters present in the value of the @code{isearch-terminators} variable are used to terminate an incremental search. If that variable has not been assigned a value, the @key{ESC} and @kbd{C-J} characters will terminate an incremental search. @kbd{C-g} will abort an incremental search and restore the original line. When the search is terminated, the history entry containing the search string becomes the current line.
es: Las búsquedas incrementales comienzan antes de que el usuario haya terminado de escribir la cadena de búsqueda. Al escribir cada carácter de la cadena de búsqueda, Readline muestra la siguiente entrada del historial que coincide con la cadena escrita hasta entonces. Una búsqueda incremental requiere solo tantos caracteres como sean necesarios para encontrar la entrada del historial deseada. Para buscar hacia tras en el historial una cadena concreta, escriba @kbd{C-r}. Escribir @kbd{C-s} busca hacia delante a través del historial. Los caracteres presentes en el valor de la variable @code{isearch-terminators} se usan para terminar una búsqueda incremental. Si no se ha asignado un valor a esa variable, los caracteres @key{ESC} y @kbd{C-J} terminarán una búsqueda incremental. @kbd{C-g} abortará una búsqueda incremental y restaurará la línea original. Cuando la búsqueda se termina, la entrada del historial que contiene la cadena de búsqueda se convierte en la línea actual.

source: To find other matching entries in the history list, type @kbd{C-r} or @kbd{C-s} as appropriate. This will search backward or forward in the history for the next entry matching the search string typed so far. Any other key sequence bound to a Readline command will terminate the search and execute that command. For instance, a @key{RET} will terminate the search and accept the line, thereby executing the command from the history list. A movement command will terminate the search, make the last line found the current line, and begin editing.
es: Para encontrar otras entradas coincidentes en la lista del historial, escriba @kbd{C-r} o @kbd{C-s} según sea apropiado. Esto buscará atrás o adelante en el historial la siguiente entrada que coincida con la cadena de búsqueda escrita hasta ahora. Cualquier otra secuencia de teclas asociada a una orden Readline terminará la búsqueda y ejecutará esa orden. Por ejemplo, un @key{RET} terminará la búsqueda y ejecutará la línea, ejecutándo así la instrucción de la lista del historial. Una orden de movimiento terminará la búsqueda, convertirá la última línea encontrada en la línea actual y comenzará a editar.
