Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: Readline remembers the last incremental search string. If two @kbd{C-r}s are typed without any intervening characters defining a new search string, any remembered search string is used.
es: Readline recuerda la última cadena de la búsqueda incremental. Si se teclean dos @kbd{C-r}s sin caracteres que intervienen definiendo una nueva cadena de búsqueda, se usa cualquier cadena de búsqueda recordada.

source: Non-incremental searches read the entire search string before starting to search for matching history lines. The search string may be typed by the user or be part of the contents of the current line.
es: Las búsquedas no incrementales leen la cadena de búsqueda entera antes de empezar a buscar líneas de historial coincidentes. La cadena de búsqueda puede ser escrita por el usuario o como parte de los contenidos de la línea actual.

source: initialization file, readline
es: archivo de inicialización, readline

source: Although the Readline library comes with a set of Emacs-like keybindings installed by default, it is possible to use a different set of keybindings. Any user can customize programs that use Readline by putting commands in an @dfn{inputrc} file, conventionally in his home directory. The name of this
es: Aunque la librería de Readline viene con un conjunto de atajos de teclas estilo Emacs instalado por defecto, es posible utilizar un conjunto diferente de atajos de teclas. Cualquier usuario puede personalizar los programas que usa Readline poniendo instrucciones en un archivo @dfn{inputrc}, de forma convencional en su directorio hogar. El nombre de este

source: file is taken from the value of the shell variable @env{INPUTRC}. If
es: archivo se toma del valor de la variable del intérprete @env{INPUTRC}. Si

source: file is taken from the value of the environment variable @env{INPUTRC}. If
es: el archivo se toma del valor de la variable de entorno @env{INPUTRC}. Si

source: that variable is unset, the default is @file{~/.inputrc}. If that file does not exist or cannot be read, the ultimate default is @file{/etc/inputrc}.
es: esa variable no está establecida, el predeterminado es @file{~/.inputrc}. Si ese archivo no existe o no se puede leer, el predeterminado final es @file{/etc/inputrc}.

source: When a program which uses the Readline library starts up, the init file is read, and the key bindings are set.
es: Cuando se inicia un programa que usa la librería Readline, es leído el archivo de inicialización y se establecen las asociaciones de teclas.

source: In addition, the @code{C-x C-r} command re-reads this init file, thus incorporating any changes that you might have made to it.
es: Además, la orden @code{C-x C-r} vuelve a leer este archivo de inicialización, incorporando así todos los cambios que hayas podido hacerle.

source: Readline Init File Syntax
es: Sintaxis del Archivo de Inicialización de Readline

source: Syntax for the commands in the inputrc file.
es: Sintaxis para las instrucciones en el archivo inputrc.

source: Conditional Init Constructs
es: Construcciones Condicionales de Inicialización

source: Conditional key bindings in the inputrc file.
es: Asociaciones de teclas condicionales en el archivo inputrc.

source: Sample Init File
es: Archivo Init de Muestra

source: An example inputrc file.
es: Un ejemplo de archivo inputrc.

source: There are only a few basic constructs allowed in the Readline init file. Blank lines are ignored. Lines beginning with a @samp{#} are comments. Lines beginning with a @samp{$} indicate conditional constructs (@pxref{Conditional Init Constructs}). Other lines denote variable settings and key bindings.
es: Solo hay unas pocas construcciones básicas permitidas en el archivo de inicialización de Readline. Las líneas en blanco son ignoradas. Las líneas que comienzan por @samp{#} son comentarios. Las líneas que comienzan por @samp{$} indican construcciones condicionales (@pxref{Construcciones Condicionales de Inicialización}). Otras líneas denotan ajustes de variables y asociaciones de teclas.

source: Variable Settings
es: Ajustes de Variables

source: You can modify the run-time behavior of Readline by altering the values of variables in Readline using the @code{set} command within the init file. The syntax is simple:
es: Puede modificar el comportamiento en ejecución de Readline alterando los valores de variables en Readline usando la orden @code{set} dentro del archivo de inicialización. La sintaxis es simple:

source: set @var{variable} @var{value}
es: set @var{variable} @var{valor}

source: Here, for example, is how to change from the default Emacs-like key binding to use @code{vi} line editing commands:
es: He aquí, por ejemplo, cómo cambiar del modo predeterminado de asociaciones de teclas estilo Emacs para usar las órdenes de edición de línea estilo @code{vi}:

source: Variable names and values, where appropriate, are recognized without regard to case. Unrecognized variable names are ignored.
es: Los nombres y valores de variables, donde sea apropiado, se reconocen sin importar mayúsculas y minúsculas. Los nombres de variable no reconocidos son ignorados.

source: Boolean variables (those that can be set to on or off) are set to on if the value is null or empty, @var{on} (case-insensitive), or 1. Any other value results in the variable being set to off.
es: Las variables booleanas (aquellas que pueden establecerse en «on» u «off») se establecen a «on» si el valor es nulo o vacío, @var{on} (independiente de mayúsculas y minúsculas) o 1. Cualquier otro valor hace que la variable sea asignada a «off».

source: The @w{@code{bind -V}} command lists the current Readline variable names and values. @xref{Bash Builtins}.
es: La instrucción @w{@code{bind -V}} lista los nombres y valores de variable actuales de Readline. @xref{Instrucciones Integradas de Bash}.

source: A great deal of run-time behavior is changeable with the following variables.
es: Una gran parte del comportamiento de ejecución se puede cambiar con las siguientes variables.

source: Controls what happens when Readline wants to ring the terminal bell. If set to @samp{none}, Readline never rings the bell. If set to @samp{visible}, Readline uses a visible bell if one is available. If set to @samp{audible} (the default), Readline attempts to ring the terminal's bell.
es: Controla qué sucede cuando Readline quiere sonar el timbre de la terminal. Si está puesta en @samp{none}, Readline nunca suena el timbre. Si está puesta en @samp{visible}, Readline usa un timbre visible si hay uno disponible. Si está puesta en @samp{audible} (por defecto), Readline trata de sonar el timbre de la terminal.

source: If set to @samp{on} (the default), Readline attempts to bind the control characters treated specially by the kernel's terminal driver to their Readline equivalents.
es: Si está puesta en @samp{on} (por defecto), Readline trata de asociar los caracteres de control tratados de forma especial por el controlador de la terminal del núcleo a sus equivalentes de Readline.

source: If set to @samp{on}, Readline attempts to briefly move the cursor to an opening parenthesis when a closing parenthesis is inserted. The default is @samp{off}.
es: Si está puesta en @samp{on}, Readline trata de mover el cursor brevemente a un paréntesis de apertura cuando se inserta un paréntesis de cierre. Por defecto es @samp{off}.

source: If set to @samp{on}, when listing completions, Readline displays the common prefix of the set of possible completions using a different color. The color definitions are taken from the value of the @env{LS_COLORS} environment variable. The default is @samp{off}.
es: Si está puesta en @samp{on}, al listar compleciones, Readline muestra el prefijo común del conjunto de compleciones posibles usando un color diferente. Las definiciones de color son tomadas del valor de la variable de entorno @env{LS_COLORS}. Por defecto es @samp{off}.

source: If set to @samp{on}, Readline displays possible completions using different colors to indicate their file type. The color definitions are taken from the value of the @env{LS_COLORS} environment variable. The default is @samp{off}.
es: Si está puesta en @samp{on}, Readline muestra las posibles compleciones usando diferentes colores para indicar su tipo de archivo. Las definiciones de color se toman del valor de la variable de entorno @env{LS_COLORS}. Por defecto es @samp{off}.

source: The string to insert at the beginning of the line when the @code{insert-comment} command is executed. The default value is @code{"#"}.
es: La cadena que se inserta al principio de la línea cuando se ejecuta la instrucción @code{insert-comment}. El valor predeterminado es @code{"#"}.

source: The number of screen columns used to display possible matches when performing completion. The value is ignored if it is less than 0 or greater than the terminal screen width. A value of 0 will cause matches to be displayed one per line. The default value is -1.
es: El número de columnas de pantalla usadas para mostrar posibles coincidencias al realizar la compleción. El valor es ignorado si es menor que 0 o mayor que la anchura de la pantalla de la terminal. Un valor de 0 hará que se muestre una coincidencia por línea. El valor predeterminado es -1.

source: If set to @samp{on}, Readline performs filename matching and completion in a case-insensitive fashion. The default value is @samp{off}.
es: Si está puesta en @samp{on}, Readline realiza la coincidencia de nombre de archivo y compleción sin importar mayúsculas y minúsculas. El valor predeterminado es @samp{off}.

source: If set to @samp{on}, and @var{completion-ignore-case} is enabled, Readline treats hyphens (@samp{-}) and underscores (@samp{_}) as equivalent when performing case-insensitive filename matching and completion. The default value is @samp{off}.
es: Si está puesta en @samp{on} y está habilitada @var{completion-ignore-case}, Readline trata los guiones (@samp{-}) y barras bajas (@samp{_}) como equivalentes al realizar coincidencia y compleción de nombre de archivo independientemente de mayúsculas y minúsculas. El valor predeterminado es @samp{off}.

source: The length in characters of the common prefix of a list of possible completions that is displayed without modification. When set to a value greater than zero, common prefixes longer than this value are replaced with an ellipsis when displaying possible completions.
es: La longitud en caracteres del prefijo común de una lista de posibles compleciones que se muestra sin modificación. Al establecerse a un valor mayor que cero, los prefijos comunes más largos que este valor son reemplazados con una elipsis al mostrar posibles compleciones.

source: The number of possible completions that determines when the user is asked whether the list of possibilities should be displayed. If the number of possible completions is greater than this value, Readline will ask the user whether or not he wishes to view them; otherwise, they are simply listed. This variable must be set to an integer value greater than or equal to 0. A negative value means Readline should never ask. The default limit is @code{100}.
es: El número de posibles compleciones que determina cuando el usuario es preguntado si la lista de posibilidades debería ser mostrada. Si el número de posibles compleciones es más grande que este valor, Readline preguntará al usuario si desea o no verla; de lo contrario, son simplemente listadas. A esta variable se le debe asignar un valor entero mayor o igual a 0. Un valor negativo significa que Readline nunca debería preguntar. El límite predeterminado es @code{100}.

source: If set to @samp{on}, Readline will convert characters with the eighth bit set to an @sc{ascii} key sequence by stripping the eighth bit and prefixing an @key{ESC} character, converting them to a meta-prefixed key sequence. The default value is @samp{on}, but will be set to @samp{off} if the locale is one that contains eight-bit characters.
es: Si está puesta en @samp{on}, Readline convertirá los caracteres con el octavo bit asignado a una secuencia de teclas @sc{ascii} quitando el octavo bit y prefijando un carácter @key{ESC}, convirtiéndolos en una secuencia de teclas prefijadas por meta. El valor predeterminado es @samp{on}, pero será puesto en @samp{off} si la configuración regional es una que contiene caracteres de ocho bits.

source: If set to @samp{On}, Readline will inhibit word completion. Completion characters will be inserted into the line as if they had been mapped to @code{self-insert}. The default is @samp{off}.
es: Puesta en @samp{On}, Readline inhibirá la compleción de palabra. Los caracteres de compleción serán insertados en la línea como si hubieran sido asociados a @code{self-insert}. Lo predeterminado es @samp{off}.

source: When set to @samp{on}, on operating systems that indicate they support it, readline echoes a character corresponding to a signal generated from the keyboard. The default is @samp{on}.
es: Si está puesta en @samp{on}, en sistemas operativos que indican que lo soportan, readline muestra un carácter correspondiente a una señal generada desde el teclado. Lo predeterminado es @samp{on}.

source: The @code{editing-mode} variable controls which default set of key bindings is used. By default, Readline starts up in Emacs editing mode, where the keystrokes are most similar to Emacs. This variable can be set to either @samp{emacs} or @samp{vi}.
es: La variable @code{editing-mode} controla que conjunto predeterminado de asociaciones de teclado es usado. Por defeco, Readline se inicia en el modo de edición de Emacs, donde las pulsaciones de teclado son lo más similar a Emacs. Esta variable puede establecerse tanto a @samp{emacs} como a @samp{vi}.

source: If the @var{show-mode-in-prompt} variable is enabled, this string is displayed immediately before the last line of the primary prompt when emacs editing mode is active. The value is expanded like a key binding, so the standard set of meta- and control prefixes and backslash escape sequences is available. Use the @samp{\1} and @samp{\2} escapes to begin and end sequences of non-printing characters, which can be used to embed a terminal control sequence into the mode string. The default is @samp{@@}.
es: Si la variable @var{show-mode-in-prompt} está habilitada, esta cadena se muestra inmediatamente antes de la última línea del prompt primario cuando está activado el modo de edición de emacs. El valor se expande como una asociación de teclas, de forma que está disponible el conjunto estándar de prefijos meta- y de control y secuencias de barras invertidas de escape. Use los escapes @samp{\1} y @samp{\2} para empezar y terminar secuencias de caracteres no imprimibles, que pueden ser usados para encerrar una secuencia de control de terminal en la cadena de modo. Lo predeterminado es @samp{@@}.

source: When set to @samp{On}, Readline will configure the terminal in a way that will enable it to insert each paste into the editing buffer as a single string of characters, instead of treating each character as if it had been read from the keyboard. This can prevent pasted characters from being interpreted as editing commands. The default is @samp{off}.
es: Cuando está puesta en @samp{On}, Readline configurará la terminal de forma que la activará para insertar cada pegada en el búfer de edición como una cadena simple de caracteres, en vez de tratar cada carácter como si hubiera sido leído del teclado. Esto puede evitar que caracteres pegados sean interpretados como ordenes de edición. Lo predeterminado es @samp{off}.

source: When set to @samp{on}, Readline will try to enable the application keypad when it is called. Some systems need this to enable the arrow keys. The default is @samp{off}.
es: Cuando está puesta en @samp{on}, Readline tratará de habilitar el teclado numérico al ser llamado. Algunos sistemas necesitan esto para activar las teclas de flechas. Lo predeterminado es @samp{off}.

source: When set to @samp{on}, Readline will try to enable any meta modifier key the terminal claims to support when it is called. On many terminals, the meta key is used to send eight-bit characters. The default is @samp{on}.
es: Cuando está puesta en @samp{on}, Readline tratará de activar cualquier tecla modificadora meta que la terminal afirme soportar cuando sea llamada. En muchas terminales, la tecla meta se usa para enviar caracteres de ocho bits. Lo predeterminado es @samp{on}.

source: If set to @samp{on}, tilde expansion is performed when Readline attempts word completion. The default is @samp{off}.
es: Si está puesta en @samp{on} se realiza la expansión de virgulilla cuando Readline intenta la compleción de palabra. Por defecto es @samp{off}.

source: If set to @samp{on}, the history code attempts to place the point (the current cursor position) at the same location on each history line retrieved with @code{previous-history} or @code{next-history}. The default is @samp{off}.
es: Si está puesta en @samp{on}, el código del historial trata de ubicar el punto (la posición del cursor actual) en la misma ubicación en cada línea del historial recuperada con @code{previous-history} o @code{next-history}. Por defecto es @samp{off}.

source: Set the maximum number of history entries saved in the history list. If set to zero, any existing history entries are deleted and no new entries are saved. If set to a value less than zero, the number of history entries is not limited. By default, the number of history entries is not limited. If an attempt is made to set @var{history-size} to a non-numeric value, the maximum number of history entries will be set to 500.
es: Establece el número máximo de entradas del historial guardadas en la lista del historial. Si está puesta en cero, todas las entradas del historial existentes son eliminadas y no se guarda ninguna nueva entrada. Si se le asigna un valor menor que cero, el número de entradas del historial no está limitado. Por defecto, el número de entradas del historial no está limitado. Si se realiza un intento para establecer @var{history-size} a un valor no numérico, el máximo número de entradas del historial será establecido en 500.

source: This variable can be set to either @samp{on} or @samp{off}. Setting it to @samp{on} means that the text of the lines being edited will scroll horizontally on a single screen line when they are longer than the width of the screen, instead of wrapping onto a new screen line. By default, this variable is set to @samp{off}.
es: Esta variable se puede poner en @samp{on} u @samp{off}. Ponerla en @samp{on} significa que el texto de las líneas que está siendo editado se desplazará horizontalmente en una única línea de la pantalla cuando estas no sean más largas que la altura de la pantalla, en vez de envolverla en una nueva línea de la pantalla. Por defecto, esta variable está puesta en @samp{off}.

source: If set to @samp{on}, Readline will enable eight-bit input (it will not clear the eighth bit in the characters it reads), regardless of what the terminal claims it can support. The default value is @samp{off}, but Readline will set it to @samp{on} if the locale contains eight-bit characters. The name @code{meta-flag} is a synonym for this variable.
es: Si está puesta en @samp{on}, Readline habilitará entrada de ocho bits (no eliminará el octavo bit en los caracteres que lea), sin importar lo que la terminal afirme soportar. El valor predeterminado es @samp{off}, pero Readline lo establecerá en @samp{on} si la configuración regional contiene caracteres de ocho bits. El nombre @code{meta-flag} es un sinónimo para esta variable.

source: The string of characters that should terminate an incremental search without subsequently executing the character as a command (@pxref{Searching}). If this variable has not been given a value, the characters @key{ESC} and @kbd{C-J} will terminate an incremental search.
es: La cadena de caracteres que debería terminar una búsqueda incremental sin ejecutar posteriormente el carácter como una instrucción (@pxref{Búsqueda}). Si a esta variable no se le ha dado un valor, los caracteres @key{ESC} y @kbd{C-J} terminarán una búsqueda incremental.

source: Sets Readline's idea of the current keymap for key binding commands. Built-in @code{keymap} names are @code{emacs}, @code{emacs-standard}, @code{emacs-meta}, @code{emacs-ctlx}, @code{vi}, @code{vi-move}, @code{vi-command}, and @code{vi-insert}. @code{vi} is equivalent to @code{vi-command} (@code{vi-move} is also a synonym); @code{emacs} is equivalent to @code{emacs-standard}. Applications may add additional names. The default value is @code{emacs}. The value of the @code{editing-mode} variable also affects the default keymap.
es: Ajusta la idea de Readline del mapa de teclas actual para las órdenes de asociación de teclas. Nombres integrados de @code{mapas de teclas} son @code{emacs}, @code{emacs-standard}, @code{emacs-meta}, @code{emacs-ctlx}, @code{vi}, @code{vi-move}, @code{vi-command} y @code{vi-insert}. @code{vi} es equivalente a @code{vi-command} (@code{vi-move} es también un sinónimo); @code{emacs} es equivalente a @code{emacs-standard}. Las aplicaciones pueden añadir nombres adicionales. El valor predeterminado es @code{emacs}. El valor de la variable @code{editing-mode} también afecta al mapa de teclas predeterminado.

source: Specifies the duration Readline will wait for a character when reading an ambiguous key sequence (one that can form a complete key sequence using the input read so far, or can take additional input to complete a longer key sequence). If no input is received within the timeout, Readline will use the shorter but complete key sequence. Readline uses this value to determine whether or not input is available on the current input source (@code{rl_instream} by default). The value is specified in milliseconds, so a value of 1000 means that Readline will wait one second for additional input. If this variable is set to a value less than or equal to zero, or to a non-numeric value, Readline will wait until another key is pressed to decide which key sequence to complete. The default value is @code{500}.
es: Especifica la duración que Readline esperará un carácter al leer una secuencia de teclas ambigua (una que puede formar una secuencia de teclas completa usando la entrada leída hasta entonces o pueda tomar una entrada adicional para completar una secuencia de teclas más larga). Si no se recibe entrada dentro del límite de tiempo, Readline usará la más corta pero completa secuencia de teclas. Readline usa este valor para determinar si la entrada está disponible o no en la actual fuente de entrada (@code{rl_instream} por defecto). El valor es especificado en milisegundos, así que un valor de 1000 significa que Readline esperará una entrada adicional un segundo. Si esta variable se establece a un valor menor o igual a cero o a un valor no numérico, Readline esperará hasta que se pulse otra tecla para decidir qué secuencia completar. El valor predeterminado es @code{500}.

source: If set to @samp{on}, completed directory names have a slash appended. The default is @samp{on}.
es: Si está puesta en @samp{on}, se añade una barra a los nombres de directorios completados. Por defecto es @samp{on}.

source: This variable, when set to @samp{on}, causes Readline to display an asterisk (@samp{*}) at the start of history lines which have been modified. This variable is @samp{off} by default.
es: Esta variable, cuando está puesta en @samp{on}, hace que Readline muestre un asterisco (@samp{*}) al comienzo de las líneas del historial que hayan sido modificadas. Esta variable está en @samp{off} por defecto.
