Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: Since we'd like Bash and Readline to take care of some of the other details for us, we use several other options to tell Bash and Readline what to do. The @option{-o filenames} option tells Readline that the possible completions should be treated as filenames, and quoted appropriately. That option will also cause Readline to append a slash to filenames it can determine are directories (which is why we might want to extend @code{_comp_cd} to append a slash if we're using directories found via @var{CDPATH}: Readline can't tell those completions are directories). The @option{-o nospace} option tells Readline to not append a space character to the directory name, in case we want to append to it. The @option{-o bashdefault} option brings in the rest of the "Bash default" completions -- possible completion that Bash adds to the default Readline set. These include things like command name completion, variable completion for words beginning with @samp{@{}, completions containing pathname expansion patterns (@pxref{Filename Expansion}), and so on.
es: Puesto que nos gustaría que Bash y Readline se hicieran cargo de algunos de los otros detalles por nosotros, usamos otras varias opciones para decirles a Bash y a Readline qué hacer. La opción @option{-o nombres-de-archivo} le indica a Readline que las posibles compleciones deberían ser tratadas como nombres de archivo, y entrecomilladas apropiadamente. Esta opción también hará que Readline añada una barra a nombres de archivo que pueda reconocer como directorios (por lo cual puede que queramos extender @code{_comp_cd} para añadir una barra si estamos usando directorios encontrados mediante @var{CDPATH}: Readline no puede distinguir si esas compleciones son directorios). La opción @option{-o nospace} le dice a Readline que no añada un carácter de espacio al nombre de directorio, en caso de que queramos agregárselo. La opción @option{-o bashdefault} trae el resto de las compleciones «predeterminadas de Bash» ---posible compleción que Bash añade al conjunto de Readline habilitado por defecto---. Estas incluyen cosas como la compleción de nombres de instrucciones, compleción de variables para palabras que empiezan por @samp{@{}, compleciones que contienen patrones de expansión de nombres de archivo (@pxref{Expansión de Nombre de Archivo}) y demás.

source: Once installed using @code{complete}, @code{_comp_cd} will be called every time we attempt word completion for a @code{cd} command.
es: Una vez instalada usando @code{complete}, @code{_comp_cd} será llamado cada vez que intentemos una compleción de palabra para una instrucción @code{cd}.

source: Many more examples -- an extensive collection of completions for most of the common GNU, Unix, and Linux commands -- are available as part of the bash_completion project. This is installed by default on many GNU/Linux distributions. Originally written by Ian Macdonald, the project now lives at @url{http://bash-completion.alioth.debian.org/}. There are ports for other systems such as Solaris and Mac OS X.
es: Muchos más ejemplos ---una extensa colección de compleciones para la mayoría de las instrucciones comunes de GNU, Unix y Linux--- están disponibles como parte del proyecto bash_completion. Esto está instalado por defecto en muchas distribuciones de GNU/Linux. Originalmente escrito por Ian Macdonald, el proyecto vive ahora en @url{http://bash-completion.alioth.debian.org/}. Hay puertos para otros sistemas como Solaris y Mac OS X.

source: An older version of the bash_completion package is distributed with bash in the @file{examples/complete} subdirectory.
es: Una versión más antigua del paquete bash_completion se distribuye con bash en el subdirectorio @file{examples/complete}.
