Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: Specify how arguments to each @var{name} should be completed. If the @option{-p} option is supplied, or if no options are supplied, existing completion specifications are printed in a way that allows them to be reused as input. The @option{-r} option removes a completion specification for each @var{name}, or, if no @var{name}s are supplied, all completion specifications. The @option{-D} option indicates that other supplied options and actions should apply to the ``default'' command completion; that is, completion attempted on a command for which no completion has previously been defined. The @option{-E} option indicates that other supplied options and actions should apply to ``empty'' command completion; that is, completion attempted on a blank line. The @option{-I} option indicates that other supplied options and actions should apply to completion on the inital non-assignment word on the line, or after a command delimiter such as @samp{;} or @samp{|}, which is usually command name completion. If multiple options are supplied, the @option{-D} option takes precedence over @option{-E}, and both take precedence over @option{-I}. If any of @option{-D}, @option{-E}, or @option{-I} are supplied, any other @var{name} arguments are ignored; these completions only apply to the case specified by the option.
es: Especifica cómo deber@'ian ser completados los argumentos para cada @var{nombre}. Si se proporciona la opción @option{-p}, o si no se proporcionan opciones, se imprimen las especificaciones de compleción existentes de un modo que permite que puedan ser reutilizados como entrada. La opción @option{-r} elimina una especificación de compleción por cada @var{nombre} o, si no se proporcionan @var{nombre}s, todas las especificaciones de compleción. La opción @option{-D} indica que otras opciones y acciones proporcionadas se deber@'ian aplicar a la instrucción de compleción ``default''; esto es, la compleción intentada en una instrucción para la que no ha sido definida una compleción previamente. La opción @option{-E} indica que otras opciones y acciones proporcionadas deber@'ian aplicarse a la instrucción de compleción ``empty''; esto es, la compleción intentada en una l@'inea en blanco. La opción @option{-l} indica que otras acciones y opciones proporcionadas deber@'ian aplicarse a la compleción en la palabra inicial de no asignación en la l@'inea o después de un delimitador de instrucción como @samp{;} o @samp{|}, que es normalmente el nombre de compleción de instrucción. Si se proporcionan varias opciones, la opción @option{-D} tiene precedencia sobre @option{-E}, y ambas tienen preferencia sobre @option{-l}. Si se proporciona cualquiera de las opciones @option{-D}, @option{-E} o @option{-l}, se ignoran cualquier otras argumentos @var{nombre}; estas compleciones solo se aplican al caso especificado por la opción.

source: The process of applying these completion specifications when word completion is attempted is described above (@pxref{Programmable Completion}).
es: El proceso de aplicar estas especificaciones de compleción cuando se intenta la compleción de palabra se describe más arriba (@pxref{Compleción Programable}).

source: Other options, if specified, have the following meanings. The arguments to the @option{-G}, @option{-W}, and @option{-X} options (and, if necessary, the @option{-P} and @option{-S} options) should be quoted to protect them from expansion before the @code{complete} builtin is invoked.
es: Otras opciones, si se especifican, tienen los siguientes significados. Los argumentos para las opciones @option{-G}, @option{-W}, and @option{-X} (y, si es necesario, las opciones @option{-P} y @option{-S}) deben ser entrecomillados para protegerlos de la expansión antes de que sea llamada la instrucción integrada @code{complete}.

source: -o @var{comp-option}
es: -o @var{opción-comp}

source: The @var{comp-option} controls several aspects of the compspec's behavior beyond the simple generation of completions. @var{comp-option} may be one of:
es: La @var{opción-comp} controla varios aspectos del comportamiento de compspec más allá de la simple generación de compleciones. @var{opción-comp} puede ser una de:

source: Perform the rest of the default Bash completions if the compspec generates no matches.
es: Realiza el resto de las compleciones predeterminadas de Bash si la compspec no genera coincidencias.

source: Use Readline's default filename completion if the compspec generates no matches.
es: Una la compleción de nombre de archivo predeterminada de Readline si la compspec no genera coincidencias.

source: Perform directory name completion if the compspec generates no matches.
es: Realiza compleción de nombre de directorio si la compspec no genera coincidencias.

source: Tell Readline that the compspec generates filenames, so it can perform any filename-specific processing (like adding a slash to directory names, quoting special characters, or suppressing trailing spaces). This option is intended to be used with shell functions specified with @option{-F}.
es: Le dice a Readline que la compspec genera nombres de archivo, para que pueda realizar cualquier procesamiento específico para nombres de archivo (como añadir una barra a nombres de directorio, entrecomillar caracteres especiales o suprimir los espacios finales). Esta opción está pensada para usarse con la función del intérprete especificada con @option{-F}.

source: Tell Readline not to quote the completed words if they are filenames (quoting filenames is the default).
es: Le dice a Readline que no entrecomille las palabras completadas si son nombres de archivo (entrecomillar nombres de archivo es lo predeterminado).

source: Tell Readline not to sort the list of possible completions alphabetically.
es: Le dice a Readline que no ordene la lista de posibles compleciones alfabéticamente.

source: Tell Readline not to append a space (the default) to words completed at the end of the line.
es: Le dice a Readline que no añada un espacio (lo predeterminado) a palabras completadas al final de la línea.

source: After any matches defined by the compspec are generated, directory name completion is attempted and any matches are added to the results of the other actions.
es: Después de que las coincidencias definidas por la compspec hayan sido generadas, se intenta la compleción de nombre de directorio y se añaden las coincidencias a los resultados de las otras acciones.

source: -A @var{action}
es: -A @var{acción}

source: The @var{action} may be one of the following to generate a list of possible completions:
es: La @var{acción} puede ser una de las siguientes para generar una lista de posibles compleciones:

source: Alias names. May also be specified as @option{-a}.
es: Nombres de alias. También puede ser especificada como @option{-a}.

source: Array variable names.
es: Nombres de variable de vector.

source: Readline key binding names (@pxref{Bindable Readline Commands}).
es: Nombres de asociación de teclas de Readline (@pxref{Órdenes Asociables de Readline}).

source: Names of shell builtin commands. May also be specified as @option{-b}.
es: Nombres de instrucciones integradas del intérprete. También puede ser especificado como @option{-b}.

source: Command names. May also be specified as @option{-c}.
es: Nombres de instrucciones. También puede ser especificado como @option{-c}.

source: Directory names. May also be specified as @option{-d}.
es: Nombres de directorio. También puede ser especificado como @option{-d}.

source: Names of disabled shell builtins.
es: Nombres de instrucciones integradas deshabilitadas.

source: Names of enabled shell builtins.
es: Nombres de instrucciones integradas habilitadas.

source: Names of exported shell variables. May also be specified as @option{-e}.
es: Nombres de variables del intérprete exportadas. También puede ser especificado como @option{-e}.

source: File names. May also be specified as @option{-f}.
es: Nombres de archivo. También puede ser especificado como @option{-f}.

source: Names of shell functions.
es: Nombres de funciones del intérprete.

source: Group names. May also be specified as @option{-g}.
es: Nombres de grupo. También puede ser especificado como @option{-g}.

source: Help topics as accepted by the @code{help} builtin (@pxref{Bash Builtins}).
es: Temas de ayuda como acepta la instrucción integrada @code{help} (@pxref{Instrucciones Integradas del Intérprete}).

source: Hostnames, as taken from the file specified by the @env{HOSTFILE} shell variable (@pxref{Bash Variables}).
es: Nombres de anfitrión, como son tomados por el archivo especificado por la variable del intérprete @env{HOSTNAME} (@pxref{Variables de Bash}).

source: Job names, if job control is active. May also be specified as @option{-j}.
es: Nombres de tarea, si el control de tareas está activo. También puede ser especificado como @option{-j}.

source: Shell reserved words. May also be specified as @option{-k}.
es: Palabras reservadas del intérprete. También puede ser especificado como @option{-k}.

source: Names of running jobs, if job control is active.
es: Nombres de tareas ejecutándose, si el control de tareas está activado.

source: Service names. May also be specified as @option{-s}.
es: Nombres de servicios. También puede ser especificado como @option{-s}.

source: Valid arguments for the @option{-o} option to the @code{set} builtin (@pxref{The Set Builtin}).
es: Argumentos válidos para la opción @option{-o} de la instrucción integrada @code{set} (@pxref{La Instrucción Integrada Set}).

source: Shell option names as accepted by the @code{shopt} builtin (@pxref{Bash Builtins}).
es: Los nombres de opción del intérprete como acepta la instrucción integrada @code{shopt} (@pxref{Instrucciones Integradas de Bash}).

source: Signal names.
es: Nombres de señal.

source: Names of stopped jobs, if job control is active.
es: Nombres de tareas detenidas, si está activado el control de tareas.

source: User names. May also be specified as @option{-u}.
es: Nombres de usuario. También puede ser especificado como @option{-u}.

source: Names of all shell variables. May also be specified as @option{-v}.
es: Nombres de todas las variables del intérprete. También puede ser especificado como @option{-v}.

source: -C @var{command}
es: -C @var{instrucción}

source: @var{command} is executed in a subshell environment, and its output is used as the possible completions.
es: @var{instrucción} se ejecuta en un entorno de subintérprete y su salida se usa como las posibles compleciones.

source: -F @var{function}
es: -F @var{función}

source: The shell function @var{function} is executed in the current shell environment. When it is executed, $1 is the name of the command whose arguments are being completed, $2 is the word being completed, and $3 is the word preceding the word being completed, as described above (@pxref{Programmable Completion}). When it finishes, the possible completions are retrieved from the value of the @env{COMPREPLY} array variable.
es: La función del intérprete @var{función} se ejecuta en el entorno actual del intérprete. Cuando se ejecuta, $1 es el nombre de la instrucción cuyos argumentos están siendo completados, $2 es la palabra siendo completada, y $3 es la palabra que precede a la palabra siendo completada, como se describe anteriormente (@pxref{Compleción Programable}). Cuando finaliza, se recuperan las posibles compleciones del valor de la variable de vector @env{COMPREPLY}.

source: -G @var{globpat}
es: -G @var{patglob}

source: The filename expansion pattern @var{globpat} is expanded to generate the possible completions.
es: La expansión de nombre de archivo @var{patglob} se expande para generar las posibles compleciones.

source: -P @var{prefix}
es: -P @var{prefijo}

source: @var{prefix} is added at the beginning of each possible completion after all other options have been applied.
es: @var{prefijo} se añade al comienzo de cada posible compleción después de que se hayan aplicado todas las otras opciones.

source: -S @var{suffix}
es: -S @var{sufijo}

source: @var{suffix} is appended to each possible completion after all other options have been applied.
es: @var{sufijo} se añade a cada compleción posible después de que se hayan aplicado todas las otras opciones.

source: -W @var{wordlist}
es: -W @var{lista-de-palabras}

source: The @var{wordlist} is split using the characters in the @env{IFS} special variable as delimiters, and each resultant word is expanded. The possible completions are the members of the resultant list which match the word being completed.
es: La @var{lista-de-palabras} se divide usando los caracteres en la variable especial @env{IFS} como delimitadores, y se expande cada palabra resultante. Las posibles compleciones son los miembros de la lista resultante que coinciden con la palabra que está siendo completada.

source: -X @var{filterpat}
es: -X @var{filtrapat}

source: @var{filterpat} is a pattern as used for filename expansion. It is applied to the list of possible completions generated by the preceding options and arguments, and each completion matching @var{filterpat} is removed from the list. A leading @samp{!} in @var{filterpat} negates the pattern; in this case, any completion not matching @var{filterpat} is removed.
es: @var{filtrapat} es un patrón como se usa para la expansión de nombre de archivo. Se aplica a la lista de posibles compleciones generada por las opciones y argumentos precedentes, y cada compleción coincidente con @var{filtrapat} se elimina de la lista. Un @samp{!} inicial en @var{filtrapat} niega el patrón; en este caso, cualquier compleción que no coincide con @var{filtrapat} es eliminada.

source: The return value is true unless an invalid option is supplied, an option other than @option{-p} or @option{-r} is supplied without a @var{name} argument, an attempt is made to remove a completion specification for a @var{name} for which no specification exists, or an error occurs adding a completion specification.
es: El valor de retorno es verdadero a no ser que se proporcione una opción inválida, una opción diferente de @option{-p} o @option{-r} se proporcione sin un argumento @var{nombre}, se realice un intento para eliminar una especificación de compleción para un @var{nombre} para el cual no existe ninguna especificación u ocurre un error añadiendo una especificación de compleción.

source: @code{compopt} [-o @var{option}] [-DEI] [+o @var{option}] [@var{name}]
es: @code{opc-comp} [-o @var{opción}] [-DEI] [+o @var{opción}] [@var{nombre}]

source: Modify completion options for each @var{name} according to the @var{option}s, or for the currently-executing completion if no @var{name}s are supplied. If no @var{option}s are given, display the completion options for each @var{name} or the current completion. The possible values of @var{option} are those valid for the @code{complete} builtin described above. The @option{-D} option indicates that other supplied options should apply to the ``default'' command completion; that is, completion attempted on a command for which no completion has previously been defined. The @option{-E} option indicates that other supplied options should apply to ``empty'' command completion; that is, completion attempted on a blank line. The @option{-I} option indicates that other supplied options should apply to completion on the inital non-assignment word on the line, or after a command delimiter such as @samp{;} or @samp{|}, which is usually command name completion.
es: Modifica opciones de compleción para cada @var{nombre} según las @var{opcion}es, o para la compleción actualmente en ejecución si no se proporcionan @var{nombre}s. Si no se dan @var{opcion}es, muestra las opciones de compleción para cada @var{nombre} o la compleción actual. Los posibles valores de @var{opción} son aquellos válidos para la instrucción integrada @code{complete} descrita anteriormente. La opción @option{-D} indica que otras opciones proporcionadas deber@'ian aplicarse a la compleción de instrucción «predeterminada»; es decir, la compleción intentada en una instrucción para la cual no se ha definido ninguna compleción anteriormente. La opción @option{-E} indica que otras opciones proporcionadas deber@'ian aplicarse la compleción de instrucción «vac@'ia»; es decir, la compleción intentada en una l@'inea en blanco. La opción @option{-l} indica que otras opciones proporcionadas deber@'ian aplicarse a la compleción en la palabra inicial de no asignación de la l@'inea, o después de un delimitador de instrucción como @samp{;} o @samp{|}, que es normalmente la compleción de nombre de instrucción.

source: If multiple options are supplied, the @option{-D} option takes precedence over @option{-E}, and both take precedence over @option{-I}
es: Si se proporcionan varias opciones, la opción @option{-D} tiene precedencia sobre @option{-E}, y ambas tienen preferencia sobre @option{-I}

source: The return value is true unless an invalid option is supplied, an attempt is made to modify the options for a @var{name} for which no completion specification exists, or an output error occurs.
es: El valor de retorno es verdadero a no ser que se proporcione una opción inválida, se realice un intento de modificar las opciones para un @var{nombre} para el que no existe especificación de compleción u ocurra un error de salida.

source: A Programmable Completion Example
es: Un Ejemplo de Compleción Programable

source: The most common way to obtain additional completion functionality beyond the default actions @code{complete} and @code{compgen} provide is to use a shell function and bind it to a particular command using @code{complete -F}.
es: La forma más común de obtener funcionalidad de compleción adicional más allá de las acciones predeterminadas que proporcionan @code{complete} y @code{compgen} es usar una función del intérprete y asociarla a una instrucción particular usando @code{complete -F}.

source: The following function provides completions for the @code{cd} builtin. It is a reasonably good example of what shell functions must do when used for completion. This function uses the word passed as @code{$2} to determine the directory name to complete. You can also use the @code{COMP_WORDS} array variable; the current word is indexed by the @code{COMP_CWORD} variable.
es: La siguiente función proporciona compleciones para la instrucción integrada @code{cd}. Es un ejemplo razonablemente bueno de lo que las funciones del intérprete deben hacer cuando se usan para compleción. Esta función usa la palabra pasada como @code{$2} para determinar el nombre de directorio que completar. También puede usar la variable de vector @code{COMP_WORDS}; la palabra actual es indexada por la variable @code{COMP_CWORD}.

source: The function relies on the @code{complete} and @code{compgen} builtins to do much of the work, adding only the things that the Bash @code{cd} does beyond accepting basic directory names: tilde expansion (@pxref{Tilde Expansion}), searching directories in @var{$CDPATH}, which is described above (@pxref{Bourne Shell Builtins}), and basic support for the @code{cdable_vars} shell option (@pxref{The Shopt Builtin}). @code{_comp_cd} modifies the value of @var{IFS} so that it contains only a newline to accommodate file names containing spaces and tabs -- @code{compgen} prints the possible completions it generates one per line.
es: Esta función cuenta con las instrucciones integradas @code{complete} y @code{compgen} para hacer gran parte del trabajo, añadiendo solo las casos que el @code{cd} de Bash hace más allá de aceptar nombres de directorios básicos: expansión de virgulilla (@pxref{Expansión de Virgulilla}), buscar directorios en @var{$CDPATH}, que se describe anteriormente (@pxref{Instrucciones Integradas del Bourne Shell}), y un soporte básico para la opción del intérprete (@pxref{La Instrucción Integrada Shopt}) @code{cdable_vars}. @code{_comp_cd} modifica el valor de @var{IFS} de forma que contiene solo una nueva línea para acomodar los nombres de archivos que contienen espacios y tabulaciones ---@code{compgen} imprime las posibles compleciones que genera una por línea---.

source: Possible completions go into the @var{COMPREPLY} array variable, one completion per array element. The programmable completion system retrieves the completions from there when the function returns.
es: Las posibles compleciones van en la variable de vector @var{COMPREPLY}, una compleción por elemento de vector. El sistema de compleción programable recoge las compleciones desde ahí cuando la función retorna.

source: # A completion function for the cd builtin # based on the cd completion function from the bash_completion package _comp_cd() @{ local IFS=$' \t\n' # normalize IFS local cur _skipdot _cdpath local i j k
es: # Una función de compleción para la instrucción integrada cd # basada en la función de compleción de cd del paquete bash_completion _comp_cd() @{ local IFS=$' \t\n' # normaliza IFS local cur _skipdot _cdpath local i j k

source: # Tilde expansion, which also expands tilde to full pathname case "$2" in \~*) eval cur="$2" ;; *) cur=$2 ;; esac
es: # Expansión de virgulilla, que también expande # la virgulilla al nombre de ruta completo case "$2" in \~*) eval cur="$2" ;; *) cur=$2 ;; esac

source: # no cdpath or absolute pathname -- straight directory completion if [[ -z "$@{CDPATH:-@}" ]] || [[ "$cur" == @@(./*|../*|/*) ]]; then # compgen prints paths one per line; could also use while loop IFS=$'\n' COMPREPLY=( $(compgen -d -- "$cur") ) IFS=$' \t\n' # CDPATH+directories in the current directory if not in CDPATH else IFS=$'\n' _skipdot=false # preprocess CDPATH to convert null directory names to . _cdpath=$@{CDPATH/#:/.:@} _cdpath=$@{_cdpath//::/:.:@} _cdpath=$@{_cdpath/%:/:.@} for i in $@{_cdpath//:/$'\n'@}; do if [[ $i -ef . ]]; then _skipdot=true; fi k="$@{#COMPREPLY[@@]@}" for j in $( compgen -d -- "$i/$cur" ); do COMPREPLY[k++]=$@{j#$i/@} # cut off directory done done $_skipdot || COMPREPLY+=( $(compgen -d -- "$cur") ) IFS=$' \t\n' fi
es: # ningún cdpath o nombre de ruta absoluto, # compleción de directorio directa if [[ -z "$@{CDPATH:-@}" ]] || [[ "$cur" == @@(./*|../*|/*) ]]; then # compgen imprime una ruta por línea; # también se podría usar bucle while IFS=$'\n' COMPREPLY=( $(compgen -d -- "$cur") ) IFS=$' \t\n' # CDPATH+directorios en el directorio actual si no está en CDPATH else IFS=$'\n' _skipdot=false # preprocesa CDPATH para convertir nombres de directorio nulos # a . _cdpath=$@{CDPATH/#:/.:@} _cdpath=$@{_cdpath//::/:.:@} _cdpath=$@{_cdpath/%:/:.@} for i in $@{_cdpath//:/$'\n'@}; do if [[ $i -ef . ]]; then _skipdot=true; fi k="$@{#COMPREPLY[@@]@}" for j in $( compgen -d -- "$i/$cur" ); do COMPREPLY[k++]=$@{j#$i/@} # Recortar directorio done done $_skipdot || COMPREPLY+=( $(compgen -d -- "$cur") ) IFS=$' \t\n' fi

source: # variable names if appropriate shell option set and no completions if shopt -q cdable_vars && [[ $@{#COMPREPLY[@@]@} -eq 0 ]]; then COMPREPLY=( $(compgen -v -- "$cur") ) fi
es: # nombres de variable si establecida opción del # intérprete apropiada y no compleciones if shopt -q cdable_vars && [[ $@{#COMPREPLY[@@]@} -eq 0 ]]; then COMPREPLY=( $(compgen -v -- "$cur") ) fi

source: We install the completion function using the @option{-F} option to @code{complete}:
es: Instalamos la función de compleción usando la opción @option{-F} para @code{complete}:

source: # Tell readline to quote appropriate and append slashes to directories; # use the bash default completion for other arguments complete -o filenames -o nospace -o bashdefault -F _comp_cd cd
es: # Ordena a readline entrecomillar apropiadamente y añadir barras a # directorios; usa la compleción predeterminada de bash para otros # argumentos complete -o filenames -o nospace -o bashdefault -F _comp_cd cd
