Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: This directive takes a single filename as an argument and reads commands and bindings from that file. For example, the following directive reads from @file{/etc/inputrc}:
es: Esta directiva toma un único nombre de archivo como un argumento y lee órdenes y asociaciones de ese archivo. Por ejemplo, la siguiente directiva lee de @file{/etc/inputrc}:

source: Here is an example of an @var{inputrc} file. This illustrates key binding, variable assignment, and conditional syntax.
es: He aquí un ejemplo de un archivo @var{inputrc}. Este ilustra la asociación de teclas, la asignación de variables y la sintaxis condicional.

source: # This file controls the behaviour of line input editing for # programs that use the GNU Readline library. Existing # programs include FTP, Bash, and GDB. # # You can re-read the inputrc file with C-x C-r. # Lines beginning with '#' are comments. # # First, include any system-wide bindings and variable # assignments from /etc/Inputrc $include /etc/Inputrc
es: # Este archivo controla el comportamiento de la edición de # la línea de entrada para programas que usan la # biblioteca de GNU Readline. Programas existentes # incluyen FTP, Bash y GDB. # # Puede volver a leer el archivo inputrc con C-x C-r. # Las líneas que comienzan por '#' son comentarios. # # Primero, incluye las asociaciones de alcance a todo el # sistema de /etc/Inputrc $include /etc/Inputrc

source: # # Set various bindings for emacs mode.
es: # # Establece varias asociaciones para el modo emacs.

source: Meta-Control-h: backward-kill-word Text after the function name is ignored
es: Meta-Control-h: backward-kill-word Texto ignorado tras nombre de función

source: # # Arrow keys in keypad mode # #"\M-OD": backward-char #"\M-OC": forward-char #"\M-OA": previous-history #"\M-OB": next-history # # Arrow keys in ANSI mode # "\M-[D": backward-char "\M-[C": forward-char "\M-[A": previous-history "\M-[B": next-history # # Arrow keys in 8 bit keypad mode # #"\M-\C-OD": backward-char #"\M-\C-OC": forward-char #"\M-\C-OA": previous-history #"\M-\C-OB": next-history # # Arrow keys in 8 bit ANSI mode # #"\M-\C-[D": backward-char #"\M-\C-[C": forward-char #"\M-\C-[A": previous-history #"\M-\C-[B": next-history
es: # # Teclas de flecha en modo de teclado # #"\M-OD": backward-char #"\M-OC": forward-char #"\M-OA": previous-history #"\M-OB": next-history # # Teclas de flecha en modo ANSI # "\M-[D": backward-char "\M-[C": forward-char "\M-[A": previous-history "\M-[B": next-history # # Teclas de flecha en modo de teclado de 8 bits # #"\M-\C-OD": backward-char #"\M-\C-OC": forward-char #"\M-\C-OA": previous-history #"\M-\C-OB": next-history # # Teclas de flechas en modo ANSI de 8 bits # #"\M-\C-[D": backward-char #"\M-\C-[C": forward-char #"\M-\C-[A": previous-history #"\M-\C-[B": next-history

source: # An old-style binding. This happens to be the default. TAB: complete
es: # Una asociación de estilo antiguo. Esta resulta ser la predeterminada. TAB: complete

source: # Macros that are convenient for shell interaction $if Bash # edit the path "\C-xp": "PATH=$@{PATH@}\e\C-e\C-a\ef\C-f" # prepare to type a quoted word -- # insert open and close double quotes # and move to just after the open quote "\C-x\"": "\"\"\C-b" # insert a backslash (testing backslash escapes # in sequences and macros) "\C-x\\": "\\" # Quote the current or previous word "\C-xq": "\eb\"\ef\"" # Add a binding to refresh the line, which is unbound "\C-xr": redraw-current-line # Edit variable on current line. "\M-\C-v": "\C-a\C-k$\C-y\M-\C-e\C-a\C-y=" $endif
es: # Macros que son convenientes para la interacción del intérprete $if Bash # edita la ruta "\C-xp": "PATH=$@{PATH@}\e\C-e\C-a\ef\C-f" # prepara para teclear una palabra entrecomillada -- # inserta comillas dobles de apertura y cierre # y se mueve justo después de la comilla de apertura "\C-x\"": "\"\"\C-b" # inserta una barra invertida (probando escapes de # barras invertidas en secuencias y macros) "\C-x\\": "\\" # Entrecomilla la palabra actual o previa "\C-xq": "\eb\"\ef\"" # Añade una asociación para refrescar la línea, la cual no está asociada "\C-xr": redraw-current-line # Edita variable en línea actual. "\M-\C-v": "\C-a\C-k$\C-y\M-\C-e\C-a\C-y=" $endif

source: # use a visible bell if one is available set bell-style visible
es: # usa un timbre visible si hay uno disponible set bell-style visible

source: # don't strip characters to 7 bits when reading set input-meta on
es: # no cortes carácteres a 7 bits al leer set input-meta on

source: # allow iso-latin1 characters to be inserted rather # than converted to prefix-meta sequences set convert-meta off
es: # permite que sean insertados caracteres iso-latin1 # en vez de convertidos a secuencias de meta prefijadas set convert-meta off

source: # display characters with the eighth bit set directly # rather than as meta-prefixed characters set output-meta on
es: # muestra caracteres con el octavo bit establecido # directamente en vez de como caracteres # prefijados por meta set output-meta on

source: # if there are more than 150 possible completions for # a word, ask the user if he wants to see all of them set completion-query-items 150
es: # si hay más de 150 posibles compleciones para una # palabra, pregunta al usuario si quiere verlas todas set completion-query-items 150

source: # For FTP $if Ftp "\C-xg": "get \M-?" "\C-xt": "put \M-?" "\M-.": yank-last-arg $endif
es: # Para FTP $if Ftp "\C-xg": "get \M-?" "\C-xt": "put \M-?" "\M-.": yank-last-arg $endif

source: Commands For Moving
es: Órdenes para Moverse

source: Moving about the line.
es: Moverse por la línea.

source: Commands For History
es: Órdenes para el Historial

source: Getting at previous lines.
es: Accediendo a líneas anteriores.

source: Commands For Text
es: Órdenes para Texto

source: Commands for changing text.
es: Órdenes para cambiar texto.

source: Commands For Killing
es: Órdenes para Cortar

source: Commands for killing and yanking.
es: Instrucciones para cortar y pegar.

source: Numeric Arguments
es: Argumentos Numéricos

source: Specifying numeric arguments, repeat counts.
es: Especificando argumentos numéricos, cuentas de repetición.

source: Commands For Completion
es: Órdenes para Compleción

source: Getting Readline to do the typing for you.
es: Hacer que Readline escriba por usted.

source: Keyboard Macros
es: Macros de Teclado

source: Saving and re-executing typed characters
es: Guardando y volviendo a ejecutar caracteres escritos

source: Miscellaneous Commands
es: Órdenes de Miscelánea

source: Other miscellaneous commands.
es: Otras órdenes de miscelánea.

source: This section describes Readline commands that may be bound to key sequences.
es: Esta sección describe las órdenes de Readline que pueden estar asociadas a secuencias de caracteres.

source: You can list your key bindings by executing @w{@code{bind -P}} or, for a more terse format, suitable for an @var{inputrc} file, @w{@code{bind -p}}. (@xref{Bash Builtins}.)
es: Puede listar sus asociaciones de caracteres ejecutando @w{@code{bind -P}} o, para un formato más terso, válido para un archivo @var{inputrc}, @w{@code{bind -p}}. (@xref{Instrucciones Integradas de Bash}.)

source: Command names without an accompanying key sequence are unbound by default.
es: Por defecto, los nombres de órdenes sin una secuencia de teclas que los acompañen no están asociados.

source: In the following descriptions, @dfn{point} refers to the current cursor position, and @dfn{mark} refers to a cursor position saved by the @code{set-mark} command. The text between the point and mark is referred to as the @dfn{region}.
es: En las siguientes descripciones, @dfn{punto} se refiere a la posición actual del cursor, y @dfn{marca} se refiere a una posición del cursor guardada por la orden @code{set-mark}. Se hace referencia al texto entre el punto y la marca como @dfn{región}.

source: Move to the start of the current line.
es: Se mueve al inicio de la línea actual.

source: Move forward a character.
es: Se mueve adelante un carácter.

source: Move back a character.
es: Se mueve atrás un carácter.

source: Move forward to the end of the next word. Words are composed of letters and digits.
es: Se mueve adelante hasta el final de la siguiente palabra. Las palabras se componen de letras y dígitos.

source: Move back to the start of the current or previous word. Words are composed of letters and digits.
es: Se mueve atrás hasta el principio de la siguiente o la anterior palabra. Las palabras están compuestas de letras y dígitos.

source: Move forward to the end of the next word. Words are delimited by non-quoted shell metacharacters.
es: Se mueve adelante hasta el final de la siguiente palabra. Las palabras están delimitadas por metacaracteres del intérprete sin entrecomillar.

source: Move back to the start of the current or previous word. Words are delimited by non-quoted shell metacharacters.
es: Se mueve atrás al comienzo de la actual o siguiente palabra. Las palabras están delimitadas por metacaracteres del intérprete sin entrecomillar.

source: Attempt to move point to the same physical screen column on the previous physical screen line. This will not have the desired effect if the current Readline line does not take up more than one physical line or if point is not greater than the length of the prompt plus the screen width.
es: Trata de mover el punto a la misma columna de pantalla en la anterior l@'inea f@'isica de pantalla. Esto no tendrá el efecto deseado si la l@'inea actual de Readline no ocupa más de una l@'inea f@'isica o si el punto no es mayor que la longitud del prompt más la anchura de la pantalla.

source: Attempt to move point to the same physical screen column on the next physical screen line. This will not have the desired effect if the current Readline line does not take up more than one physical line or if the length of the current Readline line is not greater than the length of the prompt plus the screen width.
es: Trata de mover el punto a la misma columna de pantalla en la siguiente l@'inea f@'isica de pantalla. Esto no tendrá el efecto deseado si la l@'inea actual de Readline no ocupa más de una l@'inea f@'isica o si la longitud de la actual l@'inea de Readline no es mayor que la longitud del prompt más la anchura de la pantalla.

source: Clear the screen and redraw the current line, leaving the current line at the top of the screen.
es: Limpia la pantalla y vuelve a dibujar la línea actual, dejando la línea actual en la parte superior de la pantalla.

source: Refresh the current line. By default, this is unbound.
es: Recarga la línea actual. Por defecto, esto está sin asociar.

source: Commands For Manipulating The History
es: Órdenes para Manipular el Historial

source: accept-line (Newline or Return)
es: accept-line (Nueva Línea o Retorno)

source: Accept the line regardless of where the cursor is. If this line is non-empty, add it to the history list according to the setting of the @env{HISTCONTROL} and @env{HISTIGNORE} variables. If this line is a modified history line, then restore the history line to its original state.
es: Acepta la línea sin importar dónde esté el cursor. Si esta línea no está vacía, la añade a la lista del historial según los ajustes de las variables @env{HISTCONTROL} y @env{HISTIGNORE}. Si esta línea es una línea del historial modificada, entonces restablece la línea del historial a su estado original.

source: Accept the line regardless of where the cursor is. If this line is non-empty, it may be added to the history list for future recall with @code{add_history()}. If this line is a modified history line, the history line is restored to its original state.
es: Acepta la línea sin importar donde esté el cursor. Si esta línea no está vacía, puede ser añadida a la lista del historial para otra llamada futura con @code{add_history()}. Si esta línea es una línea del historial modificada, la línea del historial se restablece a su estado original.

source: Move `back' through the history list, fetching the previous command.
es: Se mueve `atrás' a través de la lista del historial, obteniendo anteriores instrucciones.

source: Move `forward' through the history list, fetching the next command.
es: Se mueve `adelante' a través de la lista del historial, obteniendo la siguiente instrucción.

source: Move to the first line in the history.
es: Se mueve a la primera línea en el historial.

source: Move to the end of the input history, i.e., the line currently being entered.
es: Se mueve al final de la entrada del historial, es decir, la línea que está siendo introducida actualmente.

source: Search backward starting at the current line and moving `up' through the history as necessary. This is an incremental search.
es: Busca hacia tras empezando en la línea actual y moviéndose `arriba' a través del historial según sea necesario. Esto es una búsqueda incremental.

source: Search forward starting at the current line and moving `down' through the history as necessary. This is an incremental search.
es: Busca hacia delante empezando en la línea actual y moviéndose `abajo' a través del historial según sea necesario. Esto es una búsqueda incremental.

source: Search backward starting at the current line and moving `up' through the history as necessary using a non-incremental search for a string supplied by the user. The search string may match anywhere in a history line.
es: Busca hacia tras empezando en la línea actual y moviéndose `arriba' a través del historial según sea necesario usando una búsqueda no incremental para una cadena proporcionada por el usuario. La cadena de búsqueda puede coincidir en cualquier lugar en una línea del historial.

source: Search forward starting at the current line and moving `down' through the history as necessary using a non-incremental search for a string supplied by the user. The search string may match anywhere in a history line.
es: Busca hacia delante empezando en la línea actual y moviéndose `abajo' a través del historial según sea necesario usando una búsqueda no incremental para una cadena proporcionada por el usuario. La cadena de búsqueda puede coincidir en cualquier lugar en una línea del historial.

source: Search forward through the history for the string of characters between the start of the current line and the point. The search string must match at the beginning of a history line. This is a non-incremental search. By default, this command is unbound.
es: Busca hacia delante a través del historial para la cadena de caracteres entre el comienzo de la línea actual y el punto. La cadena de búsqueda debe coincidir al principio de la línea del historial. Esto es una búsqueda no incremental. Por defecto, esta instrucción no está asociada.

source: Search backward through the history for the string of characters between the start of the current line and the point. The search string must match at the beginning of a history line. This is a non-incremental search. By default, this command is unbound.
es: Busca hacia tras a través del historial para la cadena de caracteres entre el comienzo de la línea actual y el punto. La cadena de búsqueda debe coincidir al principio de la línea del historial. Esto es una búsqueda no incremental. Por defecto, esta instrucción no está asociada.

source: Search forward through the history for the string of characters between the start of the current line and the point. The search string may match anywhere in a history line. This is a non-incremental search. By default, this command is unbound.
es: Busca hacia delante a través del historial para la cadena de caracteres entre el comienzo de la línea actual y el punto. La cadena de búsqueda puede coincidir en cualquier lugar de la línea del historial. Esto es una búsqueda no incremental. Por defecto, esta instrucción no está asociada.

source: Search backward through the history for the string of characters between the start of the current line and the point. The search string may match anywhere in a history line. This is a non-incremental search. By default, this command is unbound.
es: Busca hacia tras a través del historial para la cadena de caracteres entre el comienzo de la línea actual y el punto. La cadena de búsqueda puede coincidir en cualquier lugar de la línea del historial. Esto es una búsqueda no incremental. Por defecto, esta instrucción no está asociada.

source: Insert the first argument to the previous command (usually the second word on the previous line) at point. With an argument @var{n}, insert the @var{n}th word from the previous command (the words in the previous command begin with word 0). A negative argument inserts the @var{n}th word from the end of the previous command. Once the argument @var{n} is computed, the argument is extracted as if the @samp{!@var{n}} history expansion had been specified.
es: Inserta el primer argumento para la instrucción previa (normalmente la segunda palabra en la línea anterior) en el punto. Con un argumento @var{n}, inserta la palabra número @var{n} de la instrucción anterior (las palabras en la instrucción anterior comienzan con palabra 0). Un argumento negativo inserta la palabra número @var{n} desde el final de la instrucción previa. Una vez que sea computado el argumento @var{n}, se extrae el argumento como si se hubiera especificado la expansión del historial @samp{!@var{n}}.

source: Insert last argument to the previous command (the last word of the previous history entry). With a numeric argument, behave exactly like @code{yank-nth-arg}. Successive calls to @code{yank-last-arg} move back through the history list, inserting the last word (or the word specified by the argument to the first call) of each line in turn. Any numeric argument supplied to these successive calls determines the direction to move through the history. A negative argument switches the direction through the history (back or forward). The history expansion facilities are used to extract the last argument, as if the @samp{!$} history expansion had been specified.
es: Inserta el último argumento de la instrucción anterior (la última palabra de la anterior entrada del historial). Con un argumento numérico, se comporta exactamente como @code{yank-nth-arg}. Las llamadas sucesivas a @code{yank-last-arg} se mueven atrás a través de la lista del historial, insertando la última palabra (o la palabra especificada por el argumento de la primera llamada) de cada línea en orden. Cualquier argumento numérico proporcionado a estas llamadas sucesivas determina la dirección a la que moverse por el historial. Un argumento negativo alterna la dirección por el historial (atrás o adelante). Se usan las herramientas de expansión del historial para extraer el último argumento, como si se hubiera especificado la expansión del historial @samp{!$}.

source: Commands For Changing Text
es: Órdenes para Cambiar Texto

source: The character indicating end-of-file as set, for example, by @code{stty}. If this character is read when there are no characters on the line, and point is at the beginning of the line, Readline interprets it as the end of input and returns @sc{eof}.
es: El carácter que indica fin-de-fichero como establece, por ejemplo, @code{stty}. Si se lee este carácter cuando no hay caracteres en la línea y el punto está al principio de la línea, Readline lo interpreta como el final de entrada y devuelve @sc{eof}.

source: Delete the character at point. If this function is bound to the same character as the tty @sc{eof} character, as @kbd{C-d} commonly is, see above for the effects.
es: Borra el carácter en el punto. Si está función está asociada al mismo carácter que el carácter tty @sc{eof}, como está comúnmente @kbd{C-d}, consulte arriba los efectos.

source: Delete the character behind the cursor. A numeric argument means to kill the characters instead of deleting them.
es: Borra el carácter antes del cursor. Un argumento numérico significa cortar los caracteres en vez de borrarlos.

source: Delete the character under the cursor, unless the cursor is at the end of the line, in which case the character behind the cursor is deleted. By default, this is not bound to a key.
es: Borra el carácter bajo el cursor, a no ser que el cursor esté al final de la línea, en cuyo caso es borrado el carácter antes del cursor. Por defecto, esto no está asociado a una tecla.

source: Add the next character typed to the line verbatim. This is how to insert key sequences like @kbd{C-q}, for example.
es: Añade el siguiente carácter tecleado a la línea literal. Esto es cómo insertar secuencias de teclas como @kbd{C-q}, por ejemplo.

source: Insert a tab character.
es: Inserta un carácter de tabulación.

source: Insert yourself.
es: Inserte por sí mismo.

source: This function is intended to be bound to the "bracketed paste" escape sequence sent by some terminals, and such a binding is assigned by default. It allows Readline to insert the pasted text as a single unit without treating each character as if it had been read from the keyboard. The characters are inserted as if each one was bound to @code{self-insert} instead of executing any editing commands.
es: Esta función está pensada para estar asociada a la secuencia de escape «bracketed paste» enviada por algunas terminales, y tal asociación está asignada por defecto. Permite a Readline insertar el texto pegado como una única unidad sin tratar cada carácter como si hubiera sido leído del teclado. Los caracteres se insertan como si cada uno estuviera asociado a @code{self-insert} en vez de ejecutar las órdenes de edición.

source: Drag the character before the cursor forward over the character at the cursor, moving the cursor forward as well. If the insertion point is at the end of the line, then this transposes the last two characters of the line. Negative arguments have no effect.
es: Arrastra el carácter antes del cursor adelante del carácter en el cursor, moviendo también el cursor adelante. Si el punto de inserción está al final de la línea, esto transpone los últimos dos caracteres de la línea. Los argumentos negativos no tienen efecto.

source: Drag the word before point past the word after point, moving point past that word as well. If the insertion point is at the end of the line, this transposes the last two words on the line.
es: Arrastra la palabra antes del punto tras la palabra después del punto, moviendo el punto también tras esa palabra. Si el punto de inserción está al final de la línea, esto traspone las dos últimas palabras en la línea.

source: Uppercase the current (or following) word. With a negative argument, uppercase the previous word, but do not move the cursor.
es: Pone en mayúscula la actual (o siguiente) palabra. Con un argumento negativo, pone en mayúscula la palabra anterior, pero no mueve el cursor.

source: Lowercase the current (or following) word. With a negative argument, lowercase the previous word, but do not move the cursor.
es: Pone en minúscula la actual (o siguiente) palabra. Con un argumento negativo, pone en minúscula la palabra anterior, pero no mueve el cursor.

source: Capitalize the current (or following) word. With a negative argument, capitalize the previous word, but do not move the cursor.
es: Pone la primera letra de la actual (o siguiente) palabra en mayúscula. Con un argumento negativo se aplica a la palabra anterior, pero no mueve el cursor.
