Repository: davidam/bashrefes
Catalog: rluser.*.po
Languages: es

source: Perform history expansion on the current line and insert a space (@pxref{History Interaction}).
es: Realiza la expansión de historial en la línea actual e inserta un espacio (@pxref{Interacción con el Historial}).

source: Perform alias expansion on the current line (@pxref{Aliases}).
es: Realiza la expansión de alias en la línea actual (@pxref{Aliases}).

source: Perform history and alias expansion on the current line.
es: Realiza expansión de alias y de historial en la línea actual.

source: A synonym for @code{yank-last-arg}.
es: Un sinónimo de @code{yank-last-arg}.

source: Accept the current line for execution and fetch the next line relative to the current line from the history for editing. A numeric argument, if supplied, specifies the history entry to use instead of the current line.
es: Acepta la línea actual para ejecución y obtiene la siguiente línea relativa a la línea actual del historial para editar. Un argumento numérico, si se proporciona, especifica la entrada del historial que usar en vez de la l@'inea actual.

source: Invoke an editor on the current command line, and execute the result as shell commands. Bash attempts to invoke @code{$VISUAL}, @code{$EDITOR}, and @code{emacs} as the editor, in that order.
es: Llama a un editor en la línea actual de orden y ejecuta el resultado como instrucciones del intérprete. Bash trata de llamar a @code{$VISUAL}, @code{$EDITOR} y @code{emacs} como el editor, en ese orden.

source: When in @code{vi} command mode, this causes a switch to @code{emacs} editing mode.
es: Cuando está en el modo de orden de @code{vi}, esto causa un cambio al modo de edición de @code{emacs}.

source: When in @code{emacs} editing mode, this causes a switch to @code{vi} editing mode.
es: Cuando está en el modo de orden de @code{emacs}, esto causa un cambio al modo de edición de @code{vi}.

source: While the Readline library does not have a full set of @code{vi} editing functions, it does contain enough to allow simple editing of the line. The Readline @code{vi} mode behaves as specified in the @sc{posix} standard.
es: Si bien la biblioteca Readline tiene un conjunto completo de las funciones de edición de @code{vi}, contiene lo suficiente para permitir la edición simple de la línea. El modo @code{vi} de Readline se comporta como se especifica en el estándar @sc{posix}.

source: In order to switch interactively between @code{emacs} and @code{vi} editing modes, use the @samp{set -o emacs} and @samp{set -o vi} commands (@pxref{The Set Builtin}).
es: Para alternar interactivamente entre los modos de edición de @code{emacs} y @code{vi}, use las instrucciones @samp{set -o emacs} y @samp{set -o vi} (@pxref{La Instrucción Integrada Set}).

source: In order to switch interactively between @code{emacs} and @code{vi} editing modes, use the command @kbd{M-C-j} (bound to emacs-editing-mode when in @code{vi} mode and to vi-editing-mode in @code{emacs} mode).
es: Para alternar interactivamente entre los modos de edición de @code{emacs} y @code{vi}, use la órden @kbd{M-C-j} (asociada con emacs-editing-mode en modo @code{vi} y con vi-editing-mode en modo @code{emacs}).

source: The Readline default is @code{emacs} mode.
es: El predeterminado de Readline es el modo @code{emacs}.

source: When you enter a line in @code{vi} mode, you are already placed in `insertion' mode, as if you had typed an @samp{i}. Pressing @key{ESC} switches you into `command' mode, where you can edit the text of the line with the standard @code{vi} movement keys, move to previous history lines with @samp{k} and subsequent lines with @samp{j}, and so forth.
es: Cuando introduces una línea en el modo @code{vi}, ya está metido en el modo de `inserción', como si hubiera escrito @samp{i}. Pulsar @key{ESC} le cambia al modo de `órdenes', donde puede editar el texto de la línea con las teclas de movimiento estándares de @code{vi}, moverse a líneas del historial previas con @samp{k} y a líneas siguientes con @samp{j} y demás.

source: Programmable Completion
es: Compleción Programable

source: programmable completion
es: compleción programable

source: When word completion is attempted for an argument to a command for which a completion specification (a @var{compspec}) has been defined using the @code{complete} builtin (@pxref{Programmable Completion Builtins}), the programmable completion facilities are invoked.
es: Cuando se intenta la compleción de palabra para un argumento de una instrucción para la que ha sido definida una especificación de compleción (una @var{compspec}) usando la instrucción integrada @code{complete} (@pxref{Instrucciones Integradas de Compleción Programable}), se llaman a las utilidades de compleción.

source: First, the command name is identified. If a compspec has been defined for that command, the compspec is used to generate the list of possible completions for the word. If the command word is the empty string (completion attempted at the beginning of an empty line), any compspec defined with the @option{-E} option to @code{complete} is used. If the command word is a full pathname, a compspec for the full pathname is searched for first. If no compspec is found for the full pathname, an attempt is made to find a compspec for the portion following the final slash. If those searches do not result in a compspec, any compspec defined with the @option{-D} option to @code{complete} is used as the default. If there is no default compspec, Bash attempts alias expansion on the command word as a final resort, and attempts to find a compspec for the command word from any successful expansion
es: Primero se identifica el nombre de la instrucción. Si se ha definido una compspec para esa instrucción, la compspec se usa para generar la lista de posibles compleciones para la palabra. Si la palabra de instrucción es la cadena vac@'ia (compleción intentada al principio de una l@'inea vac@'ia), se usa cualquier compspec definida con la opción @option{-E} para @code{complete}. Si la palabra de instrucción es un nombre de ruta completo, se busca primero una compspec para el nombre de ruta completo. Si no se encuentra una compspec para el nombre de ruta completo, se hace un intento para encontrar una comspec para la porción que sigue a la barra final. Si ninguna de esas búsquedas produce una compspec, cualquier compspec definida con la opción @option{-D} de @code{complete} se usa como la predeterminada. Si no hay compspec predeterminada, Bash trata la expansión de alias en la palabra de instrucción como un último recurso y trata de encontrar una compspec para la palabra de instrucción desde cualquier expansión exitosa

source: Once a compspec has been found, it is used to generate the list of matching words. If a compspec is not found, the default Bash completion described above (@pxref{Commands For Completion}) is performed.
es: Una vez que se haya encontrado una compspec, se usa para generar la lista de palabras coincidentes. Si no se ha encontrado una compspec, se realiza la compleción predeterminada de Bash descrita anteriormente (@pxref{Órdenes para Compleción}).

source: First, the actions specified by the compspec are used. Only matches which are prefixed by the word being completed are returned. When the @option{-f} or @option{-d} option is used for filename or directory name completion, the shell variable @env{FIGNORE} is used to filter the matches. @xref{Bash Variables}, for a description of @env{FIGNORE}.
es: Primero se usan las acciones especificadas por la compspec. Solo son devueltas las coincidencias prefijadas por la palabra que está siendo completada. Cuando se usa la opción @option{-f} o @option{-d} para la compleción de nombre de archivo o directorio, se usa la variable del intérprete @env{FIGNORE} para filtrar las coincidencias. @xref{Variables de Bash}, para una descripción de @env{FIGNORE}.

source: Any completions specified by a filename expansion pattern to the @option{-G} option are generated next. The words generated by the pattern need not match the word being completed. The @env{GLOBIGNORE} shell variable is not used to filter the matches, but the @env{FIGNORE} shell variable is used.
es: Todas las compleciones especificadas por un patrón de expansión de nombre de archivo para la opción @option{-G} son generadas después. Las palabras generadas por el patrón no necesitan coincidir con la palabra que está siendo completada. La variable del intérprete @env{GLOBIGNORE} no se usa para filtrar las coincidencias, sino que se usa la variable del intérprete @env{FIGIGNORE}.

source: Next, the string specified as the argument to the @option{-W} option is considered. The string is first split using the characters in the @env{IFS} special variable as delimiters. Shell quoting is honored within the string, in order to provide a mechanism for the words to contain shell metacharacters or characters in the value of @env{IFS}. Each word is then expanded using brace expansion, tilde expansion, parameter and variable expansion, command substitution, and arithmetic expansion, as described above (@pxref{Shell Expansions}). The results are split using the rules described above (@pxref{Word Splitting}). The results of the expansion are prefix-matched against the word being completed, and the matching words become the possible completions.
es: A continuación, se considera la cadena especificada como el argumento para la opción @option{-W} La cadena se divide primero usando los caracteres en la variable especial @env{IFS} como delimitadores. Se respeta el entrecomillado del intérprete dentro de la cadena, para proporcionar un mecanismo para que las palabras contengan metacaracteres del intérprete o caracteres en el valor de @env{IFS}. Cada palabra es entonces expandida usando la expansión de llaves, expansión de virgulilla, expansión de parámetro y variable, sustitución de instrucción y expansión aritmética, como se describe anteriormente (@pxref{Expansiones del Intérprete}). Los resultados se dividen usando las reglas descritas anteriormente (@pxref{División de Palabras}). Los resultados de la expansión son coincididos con los prefijos con la palabra que está siendo completada, y las palabras coincidentes se convierten en las posibles compleciones.

source: After these matches have been generated, any shell function or command specified with the @option{-F} and @option{-C} options is invoked. When the command or function is invoked, the @env{COMP_LINE}, @env{COMP_POINT}, @env{COMP_KEY}, and @env{COMP_TYPE} variables are assigned values as described above (@pxref{Bash Variables}). If a shell function is being invoked, the @env{COMP_WORDS} and @env{COMP_CWORD} variables are also set. When the function or command is invoked, the first argument ($1) is the name of the command whose arguments are being completed, the second argument ($2) is the word being completed, and the third argument ($3) is the word preceding the word being completed on the current command line. No filtering of the generated completions against the word being completed is performed; the function or command has complete freedom in generating the matches.
es: Después de que estas coincidencias hayan sido generadas, se llama a cualquier función o instrucción del intérprete especificada con las opciones @option{-F} y @option{-C}. Cuando se llama a la instrucción o función, se asignan valores a las variables @env{COMP_LINE}, @env{COMP_POINT}, @env{COMP_KEY} y @env{COMP_TYPE} como se describe anteriormente (@pxref{Variables de Bash}). Si se está llamando a una función del intérprete, se establecen también las variables @env{COMP_WORDS} y @env{COMP_CWORD}. Cuando se llama a la función o instrucción, el primer argumento ($1) es el nombre de la instrucción cuyos argumentos están siendo completados, el segundo argumento ($2) es la palabra que está siendo completada y el tercer argumento ($3) es la palabra que precede a la palabra que está siendo completada en la línea de órdenes actual. No se realiza ningún filtrado de las compleciones generadas sobre la palabra que está siendo completada; la función o instrucción tiene libertad absoluta para generar las coincidencias.

source: Any function specified with @option{-F} is invoked first. The function may use any of the shell facilities, including the @code{compgen} and @code{compopt} builtins described below (@pxref{Programmable Completion Builtins}), to generate the matches. It must put the possible completions in the @env{COMPREPLY} array variable, one per array element.
es: Se llama primero a cualquier función especificada con @option{-F}. La función puede usar cualquiera de las herramientas del intérprete, incluyendo las instrucciones integradas @code{compgen} y @code{compopt} descritas a continuación (@pxref{Instrucciones Integradas de Compleción Programable}), para generar las coincidencias. Debe poner las posibles compleciones en la variable de vector @env{COMPREPLY}, una por elemento de vector.

source: Next, any command specified with the @option{-C} option is invoked in an environment equivalent to command substitution. It should print a list of completions, one per line, to the standard output. Backslash may be used to escape a newline, if necessary.
es: A continuación, se llama a cualquier instrucción especificada con la opción @option{-C} en un entorno equivalente a la sustitución de instrucción. Debería imprimir una lista de compleciones, una por línea, en la salida estándar. La barra invertida puede ser usada para escapar una nueva línea, si es necesario.

source: After all of the possible completions are generated, any filter specified with the @option{-X} option is applied to the list. The filter is a pattern as used for pathname expansion; a @samp{&} in the pattern is replaced with the text of the word being completed. A literal @samp{&} may be escaped with a backslash; the backslash is removed before attempting a match. Any completion that matches the pattern will be removed from the list. A leading @samp{!} negates the pattern; in this case any completion not matching the pattern will be removed. If the @code{nocasematch} shell option (see the description of @code{shopt} in @ref{The Shopt Builtin}) is enabled, the match is performed without regard to the case of alphabetic characters.
es: Después de que sean generadas todas las posibles compleciones, se aplica a la lista cualquier filtro especificado con la opción @option{-X}. El filtro es un patrón como el que se usa para la expansión de nombre de archivo; un @samp{&} en el patrón es reemplazado por el texto de la palabra que está siendo completada. Un @samp{&} literal se puede escapar con una barra invertida; se elimina la barra invertida antes de intentar una coincidencia. Cualquier compleción que coincida con el patrón será eliminada de la lista. Un @samp{!} inicial niega el patrón; en este caso se eliminará cualquier compleción que no coincida con el patrón. Si la opción del intérprete @code{nocasematch} (vea la descripción de @code{shopt} en @ref{La Instrucción Integrada Shopt}) está activada, la coincidencia se realiza sin tener en cuenta las mayúsculas y minúsculas de caracteres alfabéticos.

source: Finally, any prefix and suffix specified with the @option{-P} and @option{-S} options are added to each member of the completion list, and the result is returned to the Readline completion code as the list of possible completions.
es: Finalmente, los prefijos y sufijos especificados con las opciones @option{-P} y @option{-S} se añaden a cada miembro de la lista de compleción, y el resultado es devuelto al código de compleción de Readline como la lista de compleciones posibles.

source: If the previously-applied actions do not generate any matches, and the @option{-o dirnames} option was supplied to @code{complete} when the compspec was defined, directory name completion is attempted.
es: Si las acciones aplicadas anteriormente no generan ningún resultado y la opción @option{-o dirnames} fue proporcionada a @code{complete} cuando compspec fue definida, se intenta la compleción de nombre de directorio.

source: If the @option{-o plusdirs} option was supplied to @code{complete} when the compspec was defined, directory name completion is attempted and any matches are added to the results of the other actions.
es: Si la opción @option{-o plusdirs} fue proporcionada a @code{complete} cuando la compspec fue definida, se intenta la compleción de nombre de directorio y las coincidencias se añaden a los resultados de las otras acciones.

source: By default, if a compspec is found, whatever it generates is returned to the completion code as the full set of possible completions. The default Bash completions are not attempted, and the Readline default of filename completion is disabled. If the @option{-o bashdefault} option was supplied to @code{complete} when the compspec was defined, the default Bash completions are attempted if the compspec generates no matches. If the @option{-o default} option was supplied to @code{complete} when the compspec was defined, Readline's default completion will be performed if the compspec (and, if attempted, the default Bash completions) generate no matches.
es: Por defecto, si se encuentra una compspec, lo que sea que genere es devuelto al código de compleción como el conjunto completo de compleciones posibles. Las compleciones predeterminadas de Bash no se intentan, y se deshabilita el valor predeterminado de Readline de compleción de nombre de archivo. Si la opción @option{-o bashdefault} fue proporcionada a @code{complete} cuando la compspec fue definida, se intentan las compleciones predeterminadas de Bash si compspec no genera coincidencias. Si la opción @option{-o default} fue proporcionada a @code{complete} cuando la compspec fue definida, la compleción predeterminada de Readline se realizará si la compspec (y, si se intenta, las compleciones predeterminadas de Bash) no genera coincidencias.

source: When a compspec indicates that directory name completion is desired, the programmable completion functions force Readline to append a slash to completed names which are symbolic links to directories, subject to the value of the @var{mark-directories} Readline variable, regardless of the setting of the @var{mark-symlinked-directories} Readline variable.
es: Cuando una compspec indica que se desea la compleción de nombre de directorio, las funciones de compleción programables fuerza a Readline a añadir una barra a los nombres completados que son enlaces simbólicos a directorios, sujetos al valor de la variable de Readline @var{mark-directories}, sin importar el ajuste de la variable de Readline @var{mark-symlinked-directories}.

source: There is some support for dynamically modifying completions. This is most useful when used in combination with a default completion specified with @option{-D}. It's possible for shell functions executed as completion handlers to indicate that completion should be retried by returning an exit status of 124. If a shell function returns 124, and changes the compspec associated with the command on which completion is being attempted (supplied as the first argument when the function is executed), programmable completion restarts from the beginning, with an attempt to find a new compspec for that command. This allows a set of completions to be built dynamically as completion is attempted, rather than being loaded all at once.
es: Hay algún soporte para modificar dinámicamente compleciones. Esto es muy útil cuando se usa en conjunto con una compleción predeterminada especificada con @option{-D}. Es posible para las funciones del intérprete ser ejecutadas como manejadores de compleción para indicar que la compleción debería ser reintentada devolviendo un estado de salida de 124. Si una función del intérprete devuelve 124 y cambia la compspec asociada con la instrucción en que la compleción se está intentando (proporcionada como el primer argumento cuando se ejecuta la función), la compleción programable se reinicia desde el principio, con un intento de encontrar una nueva compspec para esa instrucción. Esto permite que un conjunto de compleciones sea construido dinámicamente mientras se intenta la compleción, en vez de ser cargado de golpe.

source: For instance, assuming that there is a library of compspecs, each kept in a file corresponding to the name of the command, the following default completion function would load completions dynamically:
es: Por ejemplo, asumiendo que hubiera una biblioteca de compspecs, cada una en un archivo correspondiente al nombre de la instrucción, la siguiente compleción predeterminada cargaría compleciones dinámicamente:

source: Programmable Completion Builtins
es: Instrucciones Integradas de Compleción Programable

source: completion builtins
es: instrucciones integradas de compleción

source: Three builtin commands are available to manipulate the programmable completion facilities: one to specify how the arguments to a particular command are to be completed, and two to modify the completion as it is happening.
es: Hay disponibles tres instrucciones integradas para manipular las herramientas de compleción programables: una para especificar cómo van a ser completados los argumentos para una instrucción particular, y dos para modificar la compleción mientras ocurre.

source: @code{compgen [@var{option}] [@var{word}]}
es: @code{compgen [@var{opción}] [@var{palabra}]}

source: Generate possible completion matches for @var{word} according to the @var{option}s, which may be any option accepted by the @code{complete} builtin with the exception of @option{-p} and @option{-r}, and write the matches to the standard output. When using the @option{-F} or @option{-C} options, the various shell variables set by the programmable completion facilities, while available, will not have useful values.
es: Genera posibles coincidencias de compleción para @var{palabra} de acuedo a las @var{opcione}s, que pueden ser cualquier opción aceptada por la instrucción integrada @code{complete} con la excepción de @option{-p} y @option{-r}, y escribe las coincidencias a la salida estándar. Al usar las opciones @option{-F} o @option{-C}, las distintas variables del intérprete establecidas por las herramientas de compleción programables, mientras estén disponibles, no tendrán valores útiles.

source: The matches will be generated in the same way as if the programmable completion code had generated them directly from a completion specification with the same flags. If @var{word} is specified, only those completions matching @var{word} will be displayed.
es: Las coincidencias serán generadas de la misma forma que si el código de la compleción programable las hubiera generado directamente de una especificación de compleción con las mismas banderas. Si se especifica @var{palabra}, solo se mostrarán aquellas compleciones que coincidan con @var{palabra}.

source: The return value is true unless an invalid option is supplied, or no matches were generated.
es: El valor de retorno es verdadero a no ser que se proporcione una opción inválida o no se hayan generado coincidencias.

source: @code{complete [-abcdefgjksuv] [-o @var{comp-option}] [-DEI] [-A @var{action}] [-G @var{globpat}] [-W @var{wordlist}] [-F @var{function}] [-C @var{command}] [-X @var{filterpat}] [-P @var{prefix}] [-S @var{suffix}] @var{name} [@var{name} @dots{}]} @code{complete -pr [-DEI] [@var{name} @dots{}]}
es: @code{complete [-abcdefgjksuv] [-o @var{opción-comp}] [-DEI] [-A @var{acción}] [-G @var{rutglob}] [-W @var{lista-palabras}][-F @var{función}] [-C @var{instrucción}] [-X @var{filtrapat}] [-P @var{prefijo}] [-S @var{sufijo}] @var{nombre} [@var{nombre} @dots{}]} @code{complete -pr [-DEI] [@var{nombre} @dots{}]}
